<?php
$arrayAnalyze = "";
//$arrayAnalyze .= "var objAnalyze = {
//    'row1' : {
//        'key1' : 'input',
//        'key2' : 'input',
//        'key3' : 'input',
//        'key4' : 'input'
//    }
//};";
$arrayAnalyze .= "var analyze = [[0,1,2,3],[0,1,2,3],[0,1,2,3],[0,1,2,3],[0,1,2,3],[0,1,2,3],[0,1,2,3]]; ";
$label1 = 'رضایت' ;
$label2 = 'خشم' ;
$label3 = 'غم' ;
$label4 = 'استرس' ;
$bgColor2 = 'rgba(255, 0, 0,0.4)' ;
$bgColor1 = 'rgba(14, 255, 0,0.4)' ;
if($list['list']['topic']['topic_type']==4){
    $topicType = 'فعالیت روزانه و رفتار در رابطه با ' ;
    $approach1 = 'داشتن فعالیت' ;
    $approach2 = 'نداشتن فعالیت' ;
}elseif($list['list']['topic']['topic_type']==2){
    $topicType = 'رابطه کلی من با ' ;
    $approach1 = 'حس من درباره او' ;
    $approach2 = 'فکر من درباره حس او به من' ;
    $label1 = 'محبت' ;
    $label2 = 'خشم' ;
    $label3 = 'محبت' ;
    $label4 = 'استرس' ;
}
$degree = array(0,36,72,108,144,180,216,252,288,324) ;
$labels = '' ;
$data1 = '' ;
$data2 = '' ;
//echo'<pre>'; print_r($list['list']['score']);
$A = 0 ;
$B = 0 ;
$C = 0 ;
$D = 0 ;
foreach($list['list']['sensor'] as $k=>$v){
    $labels .= ','.$degree[$k].":'".$v['title']."'" ;
    if($v['sensor_type']==1) {
        if (isset($list['list']['score'][1][$v['id']])) {
            $data1 .= ',{ name:'."'".$v['title']."',color:'$bgColor1',y:". pow($list['list']['score'][1][$v['id']],2).'}';
            $A += pow($list['list']['score'][1][$v['id']],2) ;
        }
        if (isset($list['list']['score'][2][$v['id']])) {
            $data2 .= ',{ name:'."'".$v['title']."',color:'".($list['list']['topic']['topic_type']!=2?$bgColor2:$bgColor1)."',y:". pow($list['list']['score'][2][$v['id']],2).'}';
            $C += pow($list['list']['score'][2][$v['id']],2) ;
        }
    }
    if($v['sensor_type']==2){
        if (isset($list['list']['score'][1][$v['id']])) {
            $data1 .= ',{ name:'."'".$v['title']."',color:'$bgColor2',y:". pow($list['list']['score'][1][$v['id']],2).'}';
            $B += pow($list['list']['score'][1][$v['id']],2);
        }
        if(isset($list['list']['score'][2][$v['id']])) {
            $data2 .= ',{ name:'."'".$v['title']."',color:'".($list['list']['topic']['topic_type']!=2?$bgColor1:$bgColor2)."',y:". pow($list['list']['score'][2][$v['id']],2).'}';
            $D += pow($list['list']['score'][2][$v['id']],2);
        }
    }
}
$labels = substr($labels,1,strlen($labels)) ;
$data1 = substr($data1,1,strlen($data1)) ;
$data2 = substr($data2,1,strlen($data2)) ;
//echo $labels ;
//echo '$data1='.$data1 ;
//echo "A=$A,B=$B,C=$C,D=$D" ;
/////////////////////////// ANALYS //////////////////////////////////////
$range_one_hundred = array(1=>array('min'=>0,'max'=>101),2=>array('min'=>101,'max'=>203),3=>array('min'=>203,'max'=>304),4=>array('min'=>304,'max'=>405),5=>array('min'=>405,'max'=>505),6=>array('min'=>505,'max'=>605)) ;
$range_two_hundred = array(1=>array('min'=>10,'max'=>210),2=>array('min'=>210,'max'=>410),3=>array('min'=>410,'max'=>610),4=>array('min'=>610,'max'=>810),5=>array('min'=>810,'max'=>1210)) ;
$percentMaxRange = 405 ;
//$percentMaxRange = 605 ;

$r = 0 ;
$result = array(1=>array('A'=>array(),'B'=>array(),'C'=>array(),'D'=>array()),2=>array(1=>array(),2=>array(),3=>array())) ;

$percentArray = array();
if($list['list']['topic']['topic_type']==1 || $list['list']['topic']['topic_type']==3 || $list['list']['topic']['topic_type']==4 || $list['list']['topic']['topic_type']==5 || $list['list']['topic']['topic_type']==6){
    //////////////// دوست داشتن حسی/////////////////////////////
    /////////////// A ///////////////////
    $percent =round(($A*100)/$percentMaxRange,0);
    $percentArray['A'] = $percent ;
    if($A >= 0 && $A < 101) {
        $result[1]['A'][1] = "علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف، $percent در صد می باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange  واحد می‌باشد و این عدد برای وضعیت فعلی شما $A واحد است، که واقعا بسیار کم و ناکافی می‌باشد. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید. <br>در واقع انرژیی که در این ناحیه از گراف حسی می بینی، مهمترین و کا‌رآمدترین منبع انرژی برای فعالیت‌کردن و رسیدن به هدف می‌باشد. این انرژی بیان‌گرعلاقه و محبت شما به موضوع هم هست." ;
        $result[1]['A'][2] = "علاقه شما به حرکت در مسیر رسیدن به هدف $percent درصد می‌باشد که در واقع بسیار کم است. البته این جدا از علاقه تو به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه تو به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br>از خودت بپرس: «چقدر علاقه‌مند به حرکت در این مسیر و انجام فعالیت‌های لازم مربوط به آن هستی؟» این میزان علاقه خیلی مهم‌تر از علاقه تو به خود هدف می‌باشد و در مورد شما این مقدار واقعا کافی نیست. با این ذهنیت، حرکت در این مسیر، شادی بسیار کمی در شما ایجاد می‌کند و فراموش نکن که اصلا فایده ندارد هدف را دوست داشته باشی اما مسیر رسیدن به آن را نه." ;
        $result[1]['A'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت‌کنی. به واژه‌هایی که به کار میبری فکر کن  و  حس‌وحالت رو به یاد بیاور.<br> تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، تقریبا هیچ توجهی ندارید و شاید حتی هیچ نکته مثبتی را درآن  نمی‌بینید. ممکن است بگویی که من اصلا درباره این فعالیت‌ها حرفی نمی‌زنم. دقت کن : شادی ناشی از انجام این دسته از فعالیت‌ها باعث تولید انرژی برای پیش‌رفتن در مسیر می‌شود و شما با مدل واگویه‌ها و یا حتی نداشتن هیچ واگویه ای در این زمینه، خود را از این یگانه منبع تولید انرژی پیش یرنده محروم کرده‌اید." ;
        $result[1]['A'][4] = "اگر می‌خواهی واقعا به سمت هدف حرکت کنی لازم است مسیر رسیدن به آن را نیز دوست داشته باشی. بهت پیشنهاد میکنم:<ul><li>به نکات مثبتی که در این مسیر وجود دارد، بیشتر توجه‌کنی و سعی‌کنی این فعالیت‌ها رو برای خودت جالب‌تر و جذاب‌ترکنی. </li><li>با خود و دیگران درباره این‌که چقدر انجام این فعالیت‌ها خوب و انرژی‌بخش است، بیشتر و بیشترحرف بزن. </li></ul>" ;
    }
    elseif($A >=  101 && $A < 203) {
        $result[1]['A'][1] = "علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف، $percent در صد می باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange  واحد می‌باشد و این عدد برای وضعیت فعلی شما $A واحد است، که در واقع کم است. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید. <br>در واقع انرژیی که در این ناحیه از گراف حسی می بینی، مهمترین و کار‌آمدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می‌باشد. این انرژی بیان‌گر علاقه و محبت شما به موضوع هم هست." ;
        $result[1]['A'][2] = "علاقه شما به حرکت در مسیر رسیدن به هدف $percent درصد می باشد که در واقع کم است. البته این جدا از علاقه تو به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه تو به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br>از خودت بپرس: «چقدر علاقه‌مند به حرکت در این مسیر و انجام فعالیت‌های لازم مربوط به آن هستی؟ » این میزان علاقه خیلی مهمتر از علاقه تو به خود هدف می‌باشد و در مورد شما این مقدارکافی نیست. با این ذهنیت، حرکت در این مسیر، شادی چندانی در شما ایجاد نمی‌کند و فراموش نکن که اصلا فایده ندارد هدف را دوست داشته باشی اما مسیر رسیدن به آن را نه." ;
        $result[1]['A'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار میبری فکرکن و حس‌وحالت رو به یاد بیار.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، تقریبا بی‌توجه هستید.دقت کن: شادی ناشی از انجام این دسته از فعالیت ها باعث تولید انرژی برای پیش رفتن در مسیر می‌شود و این مدل از واگویه ها انرژی خیلی کمی تولید می‌کند." ;
        $result[1]['A'][4] = "اگر می‌خواهی واقعا به سمت هدف حرکت کنی لازم است مسیر رسیدن به آن را نیز دوست داشته باشی. بهت پیشنهاد میکنم:</br>به نکات مثبتی که در این مسیر وجود دارد، بیشتر توجه‌کنی و سعی‌کنی این فعالیت‌ها رو برای خودت جالب‌تر و جذاب‌تر کنی با خود و دیگران درباره اینکه چقدر انجام این فعالیت‌ها خوب و انرژی بخش هست، بیشتر و بیشتر حرف بزن." ;
    }
    elseif($A >= 203 && $A <= 250) {
        $result[1]['A'][1] = "علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف،$percent  درصد می‌باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange  واحد می‌باشد و این عدد برای وضعیت فعلی شما $A  واحد است، که می‌توان گفت بد نیست. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید.<br> در واقع انرژیی که در این ناحیه از گراف حسی می‌بینی، مهمترین و کارامدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می باشد. این انرژی بیان‌گر علاقه و محبت شما به موضوع هم هست." ;
        $result[1]['A'][2] = "علاقه شما به حرکت در مسیر رسیدن به هدف $percent درصد می باشد که بد نیست. البته این جدا از علاقه تو به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه تو به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br>از خودت بپرس:«چقدر علاقه‌مند به حرکت در این مسیر و انجام فعالیت‌های لازم مربوط به آن هستی؟ » این میزان علاقه خیلی مهمتر از علاقه تو به خود هدف می‌باشد و در مورد شما و با این ذهنیت، حرکت در این مسیر، حداقل انرژی مثبت را در اختیارت می‌گذارد. این مقدارانرژی زیاد نیست اما کم هم نیست. برای رسیدن به هدف بهتر است که این مقدار بیشتر شود." ;
        $result[1]['A'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار می‌بری فکر کن وحس وحالت  را به یاد بیاور.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، تا حدی توجه داری.دقت کن: شادی ناشی از انجام این دسته از فعالیت ها باعث تولید انرژی برای پیش رفتن در مسیر می‌شود و این مدل واگویه‌های شما باعث تولید انرژی می‌شود که البته مقدار آن زیاد نیست." ;
        $result[1]['A'][4] = "اگر می‌خواهی واقعا به سمت هدف حرکت کنی لازم است:<ul><li>به نکات مثبتی که در این مسیر وجود دارد، توجه کنی و سعی کنی این فعالیت‌ها رو برای خودت جالب‌تر کنی.</li><li>با خود و دیگران درباره این‌که چقدر انجام این فعالیت‌ها خوب و انرژی بخش است، بیشتر حرف بزن.</li></ul>" ;
    }
    elseif($A >= 251 && $A <= 304) {
        $result[1]['A'][1] = "علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف،$percent  درصد می‌باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange واحد می‌باشد و این عدد برای وضعیت فعلی شما $A واحد است، که می‌توان گفت خوب است. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید.<br> در واقع انرژیی که در این ناحیه از گراف حسی می بینی، مهمترین و کارآمدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می باشد. این انرژی بیان‌گرعلاقه و محبت شما به موضوع هم هست." ;
        $result[1]['A'][2] = "علاقه شما به حرکت در مسیر رسیدن به هدف $percent  درصد می‌باشد که می‌توان گفت خوب است و می‌تواند بهتر‌هم بشود. البته این جدا از علاقه تو به خود هدف و رسیدن به آن است.<br> اینجا، صحبت از علاقه شما به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است که خیلی مهمتر از علاقه شما به خود هدف است و در مورد شما این مقدار خوب است. با این ذهنیت، حرکت در این مسیر، انرژی مثبت لازم را در اختیار شما قرار می‌دهد." ;
        $result[1]['A'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار می بری فکرکن و حس‌وحالت را به یاد بیاور.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، توجه نسبتا خوبی دارید. دقت کن: شادی ناشی از انجام این دسته از فعالیت ها باعث تولید انرژی برای پیش‌رفتن در مسیر می شود و این مدل واگویه‌های شما، باعث تولید انرژی می‌شود و البته می‌تواند بیشتر هم باشد." ;
        $result[1]['A'][4] = "اگر می‌خواهی واقعا به سمت هدف حرکت کنی لازم است:<ul><li>به نکات مثبتی که در این مسیر وجود دارد، بیشتر توجه کنی و سعی کنی این فعالیت‌ها رو برای خودت جذاب‌ترکنی.</li><li>با خود و دیگران درباره این‌که چقدر انجام این فعالیت‌ها خوب و انرژی‌بخش است، بیشتر حرف بزن.</li></ul>" ;
    }
    elseif($A >= 305 && $A <= 360) {
        $result[1]['A'][1] = "علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف،$percent  درصد می‌باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange واحد می‌باشد و این عدد برای وضعیت فعلی شما $A  واحد است، که واقعا خوب است. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید. <br>در واقع انرژیی که در این ناحیه از گراف حسی می‌بینی، مهمترین و کارآمدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می باشد. این انرژی بیان‌گر علاقه و محبت شما به موضوع هم هست." ;
        $result[1]['A'][2] = "علاقه شما به حرکت در مسیر رسیدن به هدف $percent درصد می‌باشد که می‌توان گفت واقعا خوب است. البته این جدا از علاقه تو به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه تو به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br>از خودت بپرس: «چقدرعلاقه‌مند به حرکت در این مسیر وانجام فعالیت‌های لازم مربوط به آن هستی؟ » این میزان علاقه خیلی مهمتراز علاقه تو به خود هدف می‌باشد و در مورد شما این مقدارخیلی خوب است. با این ذهنیت، حرکت در این مسیر، انرژی مثبت خیلی خوبی  در اختیار شما قرارمی‌دهد. شما واقعا ازانجام این فعالیت‌ها لذت می‌برید و چنین کارهایی به زندگی شما هیجان مثبت می دهد. انجام چنین فعالیت‌هایی برای موجودیت حسی شما نسبتا عالی است، البته برای تحلیل جامع تر لازم است نواحی دیگر گراف هم بررسی شود." ;
        $result[1]['A'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار می‌بری فکرکن و حس‌وحالت را به یاد بیاور.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، توجه نسبتا خوبی دارید. دقت کن: شادی ناشی از انجام این دسته از فعالیت‌ها باعث تولید انرژی برای پیش رفتن در مسیر می‌شود و مدل واگویه‌های شما، باعث تولید این انرژی  می‌شود و می‌تواند بیشتر هم باشد." ;
        $result[1]['A'][4] = " اگر می‌خواهی واقعا به سمت هدف حرکت کنی لازم است در نظر داشته باشی:</br>توجه نسبتا خوب شما به نکات مثبت فعالیت‌هایی که لازم است در راه رسیدن به هدف انجام بدهی، مهمترین و بهترین قابلیت در این مسیرمحسوب می شود. این توجه مثبت را کم نکن. در این راه واگویه‌های خوب شما مشکلی ندارند و لازم است به قسمت‌های دیگر هم توجه کنی. " ;

    }
    elseif($A >= 361 && $A <= 454) {
        $result[1]['A'][1] = "علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف،$percent  درصد می‌باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange واحد می‌باشد و این عدد برای وضعیت فعلی شما $A واحد است، که واقعا عالی است. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید.<br>در واقع انرژیی که در این ناحیه از گراف حسی می‌‌بینی، مهمترین و کارآمدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می‌باشد. این انرژی بیان‌گرعلاقه و محبت شما به موضوع هم هست." ;
        $result[1]['A'][2] = "علاقه شما به حرکت در مسیر رسیدن به هدف $percent درصد می باشد که می‌توان گفت : «هی رفیق ! این واقعا عالیه» البته این جدا از علاقه تو به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه تو به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br> از خودت بپرس: «چقدر علاقه‌مند به حرکت در این مسیر و انجام فعالیت‌های لازم مربوط به آن هستی؟» این میزان علاقه خیلی مهمتر از علاقه تو به خود هدف می باشد، و در مورد شما این مقدار واقعا عالی است. شما از انجام این فعالیت‌ها لذت می برید و آنها برای موجودیت حسی شما عالی است و به زندگی شما هیجان مثبت می‌دهد. با این ذهنیت، حرکت در این مسیر، انرژی مثبت لازم را در اختیار شما قرار می‌دهد که البته بی‌نظیر می‌باشد. برای تحلیل جامع تر لازم است نواحی دیگر گراف هم بررسی شود." ;
        $result[1]['A'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار می بری فکرکن و حس‌وحالت را به یاد بیاور.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، توجه خوبی دارید. دقت کن: شادی ناشی از انجام این دسته از فعالیت ها باعث تولید انرژی برای پیش رفتن در مسیر می‌شود و این مدل واگویه‌های شما، باعث تولید این انرژی می‌شود." ;
        $result[1]['A'][4] = " اگر می‌خواهی واقعا به سمت هدف حرکت کنی لازم است در نظر داشته باشی:</br>توجه نسبتا خوب شما به نکات مثبت فعالیت‌هایی که لازم است در راه رسیدن به هدف انجام بدهی، مهم‌ترین و بهترین قابلیت در این مسیرمحسوب می شود.این توجه مثبت را همواره حفظ کن و اجازه نده که از مقدارش کم شود.در این راه واگویه‌های خوب مشکلی ندارند و لازم هست به قسمتهای دیگر هم توجه کنی." ;
    }
    elseif($A >= 455 && $A <= 504) {
        $result[1]['A'][1] = "علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف،$percent  درصد می‌باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange واحد می‌باشد و این عدد برای وضعیت فعلی شما $A واحد است، که بیشتر از حد نرمال است. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید.<br>در واقع انرژیی که دراین ناحیه از گراف حسی می بینی، مهمترین و کارآمدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می‌باشد. این انرژی بیان‌گرعلاقه و محبت شما به موضوع هم هست." ;
        $result[1]['A'][2] = "علاقه شما به حرکت در مسیر رسیدن به هدف $percent  درصد می‌باشد که می‌توان گفت که زیادی خوب است. به عبارتی دیگر خوب است اما طبیعی نیست. شما از انجام این کار خیلی زیاد لذت می‌برید و احتمال اینکه به لذتش وابسته شوید بسیار بالاست. البته این جدا از علاقه شما به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه شما به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br>از خودت بپرس:« چقدر علاقه‌مند به حرکت در این مسیر و انجام فعالیت‌های لازم مربوط به آن هستی؟» این میزان علاقه خیلی مهمتر از علاقه تو به خود هدف می‌باشد. درحال حاضربا این ذهنیت، حرکت در این مسیر، انرژی مثبت زیادی را در اختیار شما قرار می دهد که بیشتر از حد نرمال است." ;
        $result[1]['A'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار می‌بری فکر کن و حس‌وحالت را به یاد بیاور.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، توجه بسیارخوبی دارید اما درباره خوبی‌های این کارکمی اغراق می‌کنید و تا حدود زیادی هیجان‌زده هستید و التهاب دارید. در نهایت، تمام این عوامل می‌تواند منجر به وابستگی شما شود. " ;
        $result[1]['A'][4] = "اگر می خواهید به حرکت به سمت هدف ادامه دهید، پیشنهاد می‌کنم:</br> گفتگوهای خوبت را درباره مسیر رسیدن به هدف و فعالیت‌های مربوط به آن حفظ کنی اما آنها را بیش از حد هیجانی نکنی. بهتر است تعادل در لذت بردن برقرار شود." ;
    }
    elseif($A >= 505 && $A <= 605) {
        $result[1]['A'][1] = "علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف،$percent  درصد می‌باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange واحد می‌باشد و این عدد برای وضعیت فعلی شما $A  واحد است،که به شکل غیرطبیعی خوب است. شما می‌توانید میزان آن را در ناحیهA  گراف ببینید.<br>در واقع انرژیی که در این ناحیه از گراف حسی می‌بینی، مهمترین و کارآمدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می‌باشد. این انرژی بیان‌گرعلاقه و محبت شما به موضوع هم هست." ;
        $result[1]['A'][2] = "علاقه شما به حرکت در مسیر رسیدن به هدف $percent درصد می‌باشد که می‌توان گفت که بیشتر از حد نرمال هست، به عبارتی دیگر خوب است اما طبیعی نیست. شما از انجام این کار بیش از حد لذت می‌برید. البته لذت بردن از مسیر لازم است اما شما خیلی بیش از حد هیجان‌زده هستید.دقت کن:این جدا از علاقه تو به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه تو به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br>از خودت بپرس: «چقدر علاقه‌مند به حرکت در این مسیر و انجام فعالیت‌های لازم مربوط به آن هستی؟ » این میزان علاقه خیلی مهمتر از علاقه تو به خود هدف می‌باشد. درحال حاضر با این ذهنیت، حرکت در این مسیر، انرژی مثبت فوق‌العاده زیادی را در اختیار شما قرار می‌دهد که واضح است خیلی بیشتر از حد نرمال می‌باشد. این بسیار عالیست اما طبیعی نیست." ;
        $result[1]['A'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار می‌بری فکر کن و حس‌و‌حالت را به یاد بیاور.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، توجه بسیارخوبی دارید و این انرژی خوبی برای شما فراهم کرده است  اما  درباره خوبی‌های این کار تا کمی اغراق می‌کنید و بسیارهیجان‌زده هستید که می‌تواند منجر به وابستگی شما شود. واگویه‌های شما تا حدی خیال پردازانه شده است و درباره خوبی‌های این فعالیت‌ها التهاب دارید." ;
        $result[1]['A'][4] = " اگر می‌خواهید به حرکت به سمت هدف ادامه دهید، پیشنهاد می‌کنم:</br> گفتگوهای خوبت را درباره مسیر رسیدن به هدف و فعالیت‌های مربوط به آن حفظ کنی اما آنها را بیش از حد هیجانی نکنی. بهتر است تعادل در لذت بردن برقرار شود. " ;
    }
    /////////////// B ///////////////////
    $percent =round(($B*100)/$percentMaxRange,0);
    $percentArray['B'] = $percent ;
    if($B >= 0  && $B <= 25 ) {
        $result[1]['B'][1] = "تلاش برای رسیدن به هدف در شما $percentدرصد خشم ایجاد می‌کند که می توان آن را نادیده گرفت چرا که هیچ نقش بازدارنده‌ای در حرکت به سمت هدف ندارد. این حالت برای حرکت به سمت هدف ایده‌آل می باشد. شما می توانید میزان آن را در ناحیه B گراف ببینید." ;
        $result[1]['B'][2] = "تلاش برای رسیدن به هدف در شما خشمی ایجاد نمی‌کند. به عبارت دیگر شما نسبت به انجام دادن کارهای لازم برای رسیدن به هدف اصلا احساس بدی ندارید. به این ترتیب در مسیر حرکت شما، انرژی بازدارنده‌ای وجود ندارد." ;
        $result[1]['B'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می‌بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضر هیچ توجهی به نکات منفی و سختی‌های مسیر ندارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران گفتگو نمی‌کنید." ;
        $result[1]['B'][4] = "این‌که شما در حال حاضر هیچ توجهی به نکات منفی و سختی‌های مسیر ندارید و درباره آنها با خود و دیگران گفتگو نمی‌کنید، واقعا جای تبریک دارد و بسیار امیدوارکننده است.<br>پیشنهاد می کنم که نسبت به اهمیت این مساله هشیار باشید و به شکلی آگاهانه این وضعیت را حفظ کنید." ;
    }
    elseif($B >= 26 && $B <= 101 ) {
        $result[1]['B'][1] = "تلاش برای رسیدن به هدف در شما  $percentدرصد خشم ایجاد می‌کند که می توان گفت این مقدار، خیلی کم است. این حالت برای حرکت به سمت هدف عالی می‌باشد. شما می توانید میزان آن را در ناحیه B   گراف ببینید." ;
        $result[1]['B'][2] = "تلاش برای رسیدن به هدف در شما درصد خیلی کمی خشم ایجاد می‌کند. به عبارت دیگر شما نسبت به انجام دادن کارهای لازم برای رسیدن به هدف احساس بدی ندارید. به این ترتیب در مسیر حرکت شما،انرژی بازدارنده‌‌ی خیلی کمی وجود دارد که درحد نرمال است." ;
        $result[1]['B'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضرتوجه چندانی به نکات منفی و سختی های مسیر ندارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران خیلی کم گفتگو می‌کنید." ;
        $result[1]['B'][4] = "اینکه شما در حال حاضرتوجه چندانی به نکات منفی مسیر ندارید و درباره آنها با خود و دیگران گفتگو نمی کنید، جای تبریک دارد و امیدوارکننده هست.<br>پیشنهاد می‌کنم اگر می ‌خواهید در مسیر هدف حرکت کنید، نسبت به اهمیت این مساله هشیار باشید و به شکل آگاهانه‌ای این وضعیت را حفظ کنید." ;
    }
    elseif($B >= 102  && $B <= 203 ) {
        $result[1]['B'][1] = "تلاش برای رسیدن به هدف در شما<span dir='ltr'>$percent</span>   خشم ایجاد می‌کند که کمی زیاد است. این حالت برای حرکت به سمت هدف زیاد خوب نیست. شما می‌توانید میزان آن را در ناحیه B   گراف ببینید." ;
        $result[1]['B'][2] = "تلاش برای رسیدن به هدف در شما میزان خشم نسبتا زیادی تولید می‌کند که بیشترازحد نرمال است. به عبارت دیگر شما نسبت به انجام دادن کارهای لازم برای رسیدن به هدف، کمی احساس بد دارید. به این ترتیب در مسیر حرکت شما، انرژی بازدارنده‌‌ وجود دارد که بخشی از نیروی خودت را علیه خودت بکار ‌می‌گیرد و مقدار آن در مقایسه با حد استاندارد $percentMaxRange واحدی،  $B  واحد می‌باشد." ;
        $result[1]['B'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضربه نکات منفی و سختی های مسیرتوجه دارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران گفتگو می کنید." ;
        $result[1]['B'][4] = "اگر می ‌خواهید در مسیر هدف حرکت کنید پیشنهاد می کنم:<br>درباره بدی‌های فعالیت‌هایی که لازم است در مسیر رسیدن به هدف انجام بدهی، کمتر با خود و دیگران حرف بزن. <br>لازم نیست تا این حد به وجوه منفی و حس‌های منفی توجه داشته ‌‌باشی." ;
    }
    elseif($B >= 204  && $B <= 304 ) {
        $result[1]['B'][1] = "تلاش برای رسیدن به هدف در شما<span dir='ltr'>$percent</span>   درصد خشم ایجاد می‌کند که زیاد است. این حالت برای حرکت به سمت هدف اصلا خوب نیست. شما می‌توانید میزان آن را در ناحیه B   گراف ببینید." ;
        $result[1]['B'][2] = "تلاش برای رسیدن به هدف در شما میزان خشم زیادی تولید می‌کند که حسابی بیشتراز حد نرمالی است که ما برای انجام فعالیت‌ها شناسایی کرده‌ایم. به عبارت دیگر شما نسبت به انجام دادن کارهای لازم برای رسیدن به هدف، احساس بدی دارید هرچند که ممکن است از خود هدف خوشت بیاید یا رسیدن به آن برایت مهم باشد. به این ترتیب در مسیر حرکت شما، انرژی بازدارنده‌‌ قابل توجهی وجود دارد که بخش نه چندان کمی از نیروی خودت را علیه خودت بکار‌می گیرد ومقدار آن در مقایسه با حد استاندارد $percentMaxRange واحدی،   $B واحد می‌باشد. حتی اگر با وجود این حجم از خشم و نیروی بازدارنده فعال، شما باز‌هم موفق شوید که به هدفتان برسید (در تحلیل های پیش رو این حالت را نیز بررسی خواهیم کرد)، در اینصورت نیز این خشم در شما به تدریج تجمیع شده که به هیچ وجه برای شما خوب نیست." ;
        $result[1]['B'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضربه نکات منفی و سختی های مسیرتوجه نسبتا زیادی دارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران زیاد حرف می زنید و نکته مهم این‌که جنس این گفتگو و‌ حرفها از نوع بدی می‌باشد." ;
        $result[1]['B'][4] = "با این شکل گراف و این میزان از خشم هزینه زیادی پرداخت خواهید کرد و ما می‌خواهیم هزینه حرکت به سمت هدف برای شما به حداقل برسد.<br>اگر می ‌خواهید در مسیر هدف حرکت کنید و این فعالیت‌ها تنها راه رسیدن به هدف می باشد، پیشنهاد می‌کنم:<ul><li>درباره بدی‌های فعالیت‌هایی که لازم است در مسیر رسیدن به هدف انجام بدهی، کمتر با خود و دیگران حرف بزن.</li><li>لازم نیست تا این حد به وجوه منفی و حس‌های منفی توجه داشته ‌‌باشی و با خود مرتب آنها را واگویه کنید. </li><li>حواست باشد که برای رسیدن به هدف باید در این مسیر حرکت کنی، مگر اینکه راه دیگری هم وجود داشته باشد که در این صورت بهتر است آن را انتخاب کنی. </li></ul>" ;
    }
    elseif($B >= 305  && $B <= 405 ) {
        $result[1]['B'][1] = "تلاش برای رسیدن به هدف در شما<span dir='ltr'>$percent</span>   درصد خشم ایجاد می‌کند که واقعا زیاداست، یعنی خیلی بیشتر از حدی که ما برای انجام فعالیت نرمال می دانیم. این وضعیت برای حرکت به سمت هدف اصلا خوب نیست. شما می‌ توانید میزان آن را در ناحیه B گراف ببینید." ;
        $result[1]['B'][2] = "تلاش برای رسیدن به هدف در شما میزان خشم زیادی تولید می‌کند که حسابی بیشترازحد نرمالی است که ما برای انجام فعالیت‌ها شناسایی کرده‌ایم. به عبارت دیگر شما نسبت به انجام دادن کارهای لازم برای رسیدن به هدف، واقعا احساس بدی دارید هرچند که ممکن است از خود هدف خوشتان بیاید یا رسیدن به آن برایتان مهم باشد. به این ترتیب در مسیر حرکت شما، انرژی بازدارنده‌‌ قابل توجهی وجود دارد که بخش زیادی از نیروی خودت را علیه خودت بکار‌ می‌گیرد، ومقدار آن در مقایسه با حد استاندارد $percentMaxRange واحدی،  $B واحد می‌باشد.حتی اگر با وجود این حجم از خشم و نیروی بازدارنده فعال، شما باز‌هم موفق شوید که به هدفتان برسید (در تحلیل های پیش رو این حالت را نیز بررسی خواهیم کرد)، در اینصورت نیز این خشم در شما به تدریج تجمیع شده که به هیچ وجه برای شما خوب نیست.<br>این مقدار خشم می تواند به شما و اطرافیانتان آسیب برساند. منظور این نیست که این حالت شما را پرخاشگر می‌کند چراکه این تنها یک دسته از فعالیت های شماست و شما خوشبختانه فعالیت های زیاد دیگری نیز دارید. اما اگر دیگر فعالیت‌های شما نیزمانند این دسته باشند و در شما خشم تولید کنند، در این حالت حتما پرخاشگر خواهید شد." ;
        $result[1]['B'][3] = "دلیلش ساده است . تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضربه نکات منفی و سختی های مسیرتوجه نسبتا زیادی دارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران زیاد حرف می زنید و نکته مهم اینکه جنس این گفتگو و‌ حرفها از نوع  بدی می باشد." ;
        $result[1]['B'][4] = "بااین شکل گراف و این میزان از خشم هزینه زیادی پرداخت خواهید کرد و ما می‌خواهیم هزینه حرکت به سمت هدف برای شما به حداقل برسد.<br>اگر می ‌خواهید در مسیر هدف حرکت کنید و این فعالیت‌ها تنها راه رسیدن به هدف می باشد، پیشنهاد می‌کنم:<ul><li>درباره بدی‌های فعالیت‌هایی که لازم است در مسیر رسیدن به هدف انجام بدهی، کمتر با خود و دیگران حرف بزن. </li><li>لازم نیست تا این حد به وجوه منفی و حس‌های منفی توجه داشته ‌‌باشی و با خود مرتب آنها را واگویه کنید. </li><li>حواست باشد که برای رسیدن به هدف باید در این مسیر حرکت کنی، مگر اینکه راه دیگری هم وجود داشته باشد که در این صورت بهتر است آن را انتخاب کنی. </li></ul>" ;
    }
    elseif($B >= 406 && $B <= 505 ) {
        $result[1]['B'][1] = "تلاش برای رسیدن به هدف در شما<span dir='ltr'>$percent</span>   درصد خشم ایجاد می‌کند که از زیاد هم زیادتر است.این حالت برای حرکت به سمت هدف واقعا بد است. شما می توانید میزان آن را در ناحیه B گراف ببینید." ;
        $result[1]['B'][2] = "تلاش برای رسیدن به هدف در شما میزان خشم خیلی زیادی تولید می‌کند. رفیق تو واقعا از حرکت در مسیر رسیدن به هدفت بدت می‌آید حتی می توان گفت نفرت داری ، هرچند که ممکن است از خود هدف خوشت بیاید یا رسیدن به آن برایت مهم باشد. به این ترتیب در مسیر حرکت شما، انرژی بازدارنده‌‌ بزرگی وجود دارد که بخش مهمی از نیروی خودت را علیه خودت بکار ‌می‌گیرد ومقدار آن در مقایسه با حد استاندارد $percentMaxRange واحدی،  $B واحد می‌باشد! حتی اگر با وجود این حجم از خشم و نیروی بازدارنده فعال، شما باز‌هم موفق شوید که به هدفتان برسید (که البته خیلی سخت خواهد بود و در تحلیل های پیش رو این حالت را نیز بررسی خواهیم کرد)، در اینصورت نیز این خشم در شما کم کم تجمیع شده که به هیچ وجه برای شما خوب نیست.<br>این مقدار خشم می تواند به شما و اطرافیانتان آسیب برساند.منظور این نیست که این حالت شما را پرخاشگر می‌کند چراکه این تنها یک دسته از فعالیت‌های شماست و شما خوشبختانه فعالیت‌های زیاد دیگری نیز دارید. اما اگر دیگر فعالیت‌های شما نیزمانند این دسته باشند و در شما خشم تولید کنند، در این حالت حتما پرخاشگر خواهید شد." ;
        $result[1]['B'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضربه نکات منفی و سختی های مسیر بیش از حد توجه دارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران خیلی زیاد و حتی در حد اغراق حرف می زنید." ;
        $result[1]['B'][4] = "با این شکل گراف و این میزان از خشم هزینه زیادی پرداخت خواهید کرد و ما می خواهیم هزینه حرکت به سمت هدف برای شما به حداقل برسد.<br>اگر می ‌خواهید در مسیر هدف حرکت کنید و این فعالیت‌ها تنها راه رسیدن به هدف می باشد، پیشنهاد می کنم:<ul><li>درباره بدی‌های فعالیت‌هایی که لازم است در مسیر رسیدن به هدف انجام بدهی، کمتر با خود و دیگران حرف بزن. </li><li>لازم نیست تا این حد به وجوه منفی و حس‌های منفی توجه داشته ‌‌باشی و با خود مرتب آنها را واگویه کنید. </li><li>حواست باشد که برای رسیدن به هدف باید در این مسیر حرکت کنی، مگر اینکه راه دیگری هم وجود داشته باشد که در این صورت بهتر است آن را انتخاب کنی. </li></ul>" ;
    }
    elseif($B >= 506 && $B <= 605 ) {
        $result[1]['B'][1] = "تلاش برای رسیدن به هدف در شما<span dir='ltr'>$percent</span>   درصد خشم ایجاد می‌کند از زیاد هم زیادتر است حتی می شود گفت که«آخرشه». این حالت برای حرکت به سمت هدف خیلی بد است. شما می توانید میزان آن را در ناحیه B گراف ببینید." ;
        $result[1]['B'][2] = "تلاش برای رسیدن به هدف در شما میزان خشم خیلی زیادی تولید می‌کند. رفیق تو واقعا از حرکت در مسیر رسیدن به هدفت بدت می‌آید حتی می توان گفت  نفرت داری. هرچند که ممکن است از خود هدف خوشت بیاید یا رسیدن به آن برایت مهم باشد.به این ترتیب در مسیر حرکت شما، انرژی بازدارنده‌‌ بزرگی وجود دارد که بخش مهمی از نیروی خودت را علیه خودت بکار‌می گیرد ومقدار آن در مقایسه با حد استاندارد $percentMaxRange واحدی،  $B واحد می‌باشد!<br>حتی اگربا وجود این حجم از خشم و نیروی بازدارنده فعال، شما باز‌ هم موفق شوید که به هدفتان برسید (که البته خیلی سخت خواهد بود و در تحلیل های پیش رو این حالت را نیز بررسی خواهیم کرد)، در اینصورت نیزاین خشم در شما کم‌کم تجمیع شده که به هیچ وجه برای شما خوب نیست.<br>این مقدار خشم می تواند به شما و اطرافیانتان واقعا آسیب می‌زند. منظور این نیست که این حالت شما را پرخاشگر می‌کند چراکه این تنها یک دسته از فعالیت‌های شماست و شما خوشبختانه فعالیت‌های زیاد دیگری نیز دارید. اما اگر بیشتر فعالیت‌های دیگر شما مانند این دسته باشند و در شما خشم تولید کنند، در این حالت حتما پرخاشگر خواهید شد." ;
        $result[1]['B'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضر به نکات منفی و سختی های مسیر بیش از حد توجه دارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران خیلی زیاد والبته خیلی بد حرف می زنید. حتی می‌توان گفت که واقعا اغراق می‌کنی. واقعا موضوع تا این حد بد است؟" ;
        $result[1]['B'][4] = "با این شکل گراف و این میزان از خشم هزینه زیادی پرداخت خواهید کرد و ما می خواهیم هزینه حرکت به سمت هدف برای شما به حداقل برسد.<br>اگر می ‌خواهید در مسیر هدف حرکت کنید و این فعالیت‌ها تنها راه رسیدن به هدف می‌باشد، پیشنهاد می‌کنم:<ul><li>درباره بدی‌های فعالیت‌هایی که لازم است در مسیر رسیدن به هدف انجام بدهی، کمتر با خود و دیگران حرف بزن. </li><li>لازم نیست تا این حد به وجوه منفی و حس‌های منفی توجه داشته ‌‌باشی و با خود مرتب آنها را واگویه کنید. به این همه بدگویی نیازی نیست. </li><li>حواست باشد که برای رسیدن به هدف باید در این مسیر حرکت کنی، مگر اینکه راه دیگری هم وجود داشته باشد که در این صورت بهتر است آن را انتخاب کنی.</li></ul>" ;
    }
    /////////////// C ///////////////////
    $percent =round(($C*100)/$percentMaxRange,0);
    $percentArray['C'] = $percent ;
    if($C >= 0  && $C <= 25 ) {
        $result[1]['C'][1] = "حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف، غمی در شما ایجاد نمی‌کند. شما می توانید میزان این انرژی را در ناحیه C گراف ببینید." ;
        $result[1]['C'][2] = "حرکت در مسیر این هدف برای شما غمی تولید نمی کند  واین برای حرکت به سمت هدف واقعا خوب است و البته این بخش از ماجرا، جای خوشوقتی و تبریک دارد. شما علاقه ای به انجام ندادن این کار ندارید. این یعنی انرژی بازدارنده پنهانی هم وجود ندارد، انرژی پنهانی که فقط بعضی مواقع ظاهر می‌شود و روی کیفیت تلاش، گاه‌‌و بیگاه اثر منفی می‌گذارد که  خوشبختانه در مورد شما این انرژی وجود ندارد." ;
        $result[1]['C'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه هایی که به کار می برید فکر کنید و حس و حالتان را به یاد بیاورید. تمام داستان این است: شما درباره انجام ندان فعالیت ها و رها کردن آنها یا رفتن به سمت هدف دیگری، حرف های خوب نمی زنید. یعنی با حسرت حرف نمی زنید واین بسیار  خوب است." ;
        $result[1]['C'][4] = "این مدل رویکرد برای کسی که می خواهد به هدفش برسد درست است. بر آن هشیار باشید و حفظش کنید." ;
    }
    elseif($C >= 26 && $C <= 101 ) {
        $result[1]['C'][1] = "حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف، درحدود <span dir='ltr'>$percent</span>  درصد غم به همراه دارد.این مقدار غم نرمال است. شما می توانید میزان آن را در ناحیه C گراف ببینید." ;
        $result[1]['C'][2] = "حرکت در مسیر این هدف برای شما مقدار غمی تولید می‌کند که نرمال است ومشکلی برای حرکت به سمت هدف ایجاد نمی‌کند.شما علاقه‌ی خیلی کمی نسبت به انجام ندادن این فعالیت‌ها دارید و این به این معناست که دراین مسیر، انرژی بازدارنده بسیار کمی وجود دارد که واقعا جای تبریک دارد. این انرژی پنهان است و گاهی ظاهر میشود و بر کیفیت تلاش، گاه‌ و بیگاه اثر منفی می‌گذارد که خوشبختانه در مورد شما قابل توجه نیست.<br>مثلا اگر هنوز فعالیت‌های مربوط به مسیر هدف را آغاز نکرده‌اید، هر موقع که می‌خواهید شروع کنید، این انرژی پنهان به‌صورت انرژی مخالف ظاهر می‌شود و شروع کار را برای شما سخت‌تر از آنی که هست جلوه می‌دهد. اما به محض برداشتن اولین قدم، این انرژی عقب زده می شود و شما حس می‌کنید که انجام کار به دشواریی که به نظر می‌آمد نیست. بدین خاطر یه این انرژی، اینرسی یا مقاومت در برابر تغییر هم می‌گوییم." ;
        $result[1]['C'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما درباره انجام ندادن این فعالیت‌ها و رها کردنشان و یا رفتن به سمت هدفی دیگر چندان با حسرت حرف نمی‌زنید." ;
        $result[1]['C'][4] = "این مدل رویکرد برای کسی که می خواهد به هدفش برسد درست است و شما می توانید حتی آن را بهتر کنید. برای این کار لازم است:<br>درباره احساسات و شرایط خوب ناشی از انجام ندادن این فعالیت ها کمتر حرف بزنید یا با احساس کمتری حرف بزنید." ;
    }
    elseif($C >= 102  && $C <= 203 ) {
        $result[1]['C'][1] = "حرکت در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، درحدود <span dir='ltr'>$percent</span>  درصد غم به همراه دارد. این مقدار غم در‌‌بازه نرمال نیست و یک مقدار زیاد است. شما می توانید میزان آن را در ناحیه C گراف ببینید." ;
        $result[1]['C'][2] = "حرکت در مسیر این هدف برای شما مقدار غمی تولید می‌کند که یک مقدار زیاد است اما واقعا مشکلی برای حرکت به سمت هدف ایجاد نمی‌کند. با این وجود، این میزان غم، هزینه حسی و روانی محسوب می شود. شما علاقه‌ی کمی نسبت به انجام ندادن این فعالیت ها دارید و این به این معناست که دراین مسیر، انرژی بازدارنده کمی وجود دارد.این انرژی پنهان است و گاهی ظاهر می‌شود. هر زمان که به حرکت نکردن در این مسیر فکر می‌کنی و با خود یا دیگران درباره‌ی آن حرف می‌زنی ، به طرز عجیبی فعال می‌شود و با ظاهر شدنش اثر منفی برکیفیت تلاش ها و فعالیت ها می‌گذارد که خوشبختانه در مورد شما هنوز زیاد نیست اما محسوس است." ;
        $result[1]['C'][3] = "دلیلش ساده است . تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما درباره انجام ندادن این فعالیت‌ها و رها کردنشان و یا رفتن به سمت هدفی دیگر تا‌حدی با حسرت و آرزو حرف می زنید." ;
        $result[1]['C'][4] = "این مدل رویکرد برای کسی که می خواهد به هدفش برسد خوب نیست و شما می توانید آن را بهتر کنید. برای این کار لازم است:<br>درباره احساسات و شرایط خوب ناشی از انجام ندادن این فعالیت ها کمتر حرف بزنید یا با احساس کمتری حرف بزنید." ;
    }
    elseif($C >= 204  && $C <= 304 ) {
        $result[1]['C'][1] = "حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف، درحدود <span dir='ltr'>$percent</span>  درصد غم به همراه دارد. این مقدار غم بیشتر از حد استاندارد است. هرچند بطور‌کامل غم، در حرکت به سمت هدف مشکلی مستمرایجاد نمی‌کند اما به هر حال هزینه حسی و روانی محسوب می شود. و شما می توانید میزان این انرژی را در ناحیهC  گراف ببینید." ;
        $result[1]['C'][2] = "شما دوست دارید که در این مسیر حرکت نکنید و این به این معناست که انرژی بازدارنده‌ی وجود دارد. این انرژی پنهان است و گاهی ظاهر میشود. هر زمان که به حرکت نکردن در این مسیر فکر می‌کنید و با خود یا دیگران درباره‌ی آن حرف می‌زنید ، به طرز عجیبی فعال می‌شود و با ظاهر شدنش اثر منفی برکیفیت تلاش ها و فعالیت ها می گذارد. بیشترین اثر منفی این انرژی برروی پشتکار و پایداری شما در طی کردن مسیر به سمت هدف می‌باشد. حتما تجربه کرده‌اید ؛ هنگامی‌که خسته یا عصبی هستید این نیرو ظاهر می شود و تمایل شما را برای ادامه دادن مسیر کم می‌کند." ;
        $result[1]['C'][3] = "دلیلش ساده است . تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما درباره انجام ندادن این فعالیت‌ها و رها کردنشان و یا رفتن به سمت هدفی دیگر تا‌حدی با حسرت و آرزو حرف می زنید." ;
        $result[1]['C'][4] = "این مدل رویکرد برای کسی که می‌خواهد به هدفش برسد خوب نیست ولازم است که آن را بهتر کنید. برای این کار پیشنهاد می کنم:<br>درباره احساسات و شرایط خوب ناشی از انجام ندادن این فعالیت ها کمتر حرف بزنید یا با احساس کمتری حرف بزنید. " ;
    }
    elseif($C >= 305  && $C <= 405 ) {
        $result[1]['C'][1] = "حرکت در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، درحدود <span dir='ltr'>$percent</span>  درصد غم به همراه دارد.این مقدار غم کاملا بیشتر از حد استاندارد است. هرچند بطور‌کامل غم، در حرکت به سمت هدف مشکلی مستمرایجاد نمی‌کند اما به هر حال هزینه حسی و روانی محسوب می شود. و شما می توانید میزان این انرژی را در ناحیه C گراف ببینید." ;
        $result[1]['C'][2] = " شما واقعا دوست دارید که در این مسیر حرکت نکنید و این به این معناست که انرژی بازدارنده‌ی قابل توجهی وجود دارد. این انرژی پنهان است و گاهی ظاهر میشود. هر زمان که به حرکت نکردن در این مسیر فکر می‌کنید و با خود یا دیگران درباره‌ی آن حرف می‌زنید ، به طرز عجیبی فعال می‌شود و با ظاهر شدنش اثر منفی برکیفیت تلاش ها و فعالیت‌ها می‌گذارد. بیشترین اثر منفی این انرژی برروی پشتکار و پایداری شما در طی کردن مسیر به سمت هدف می باشد. حتما تجربه کرده‌اید؛ هنگامی‌که خسته یا عصبی هستید این نیرو ظاهر می شود و تمایل شما را برای ادامه دادن مسیر کم می‌کند." ;
        $result[1]['C'][3] = "دلیلش ساده است . تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما درباره انجام ندادن این فعالیت‌ها و رها کردنشان و یا رفتن به سمت هدفی دیگر تا‌حدی با حسرت و آرزو حرف می زنید." ;
        $result[1]['C'][4] = "یک  لحظه فکر کن .«آیا واقعا انجام ندادن این کارها و فعالیت ها تا این حد میتواند خوب باشد؟» پاسخ هر چه باشد لازم است به این نکته توجه کنید که این رویکرد برای کسی که میخواهد به هدفی برسد به هیچ‌وجه خوب نیست و حرکت به سمت این هدف با این وضعیت از واگویه هامی تواند تبدیل به یکی از منابع جدی اندوه شود.<br>اما چه باید کرد؟<br>تنها کاری که باید انجام دهید این است : «درباره شرایط و احساسات خوب ناشی از حرکت نکردن در این مسیر و انجام ندادن فعالیت های آن کمتر حرف بزنید و یا حداقل با احساس و حسرت کمتری با خود و دیگری در این رابطه گفتگو کنید.»<br>پس به طور کلی پیشنهاد می کنم : <ul><li>یا از حرکت در این مسیر صرف‌نظر کنید و بی خیال این هدف شوید.</li><li>یا اگر برایتان امکان پذیر نیست که  هدف را تغییر بدهید، مسیر بهتری برای رسیدن به آن پیدا کنید.</li><li>و یا اگر نمی‌توانید و یا نمی‌خواهید هدف و مسیر رسیدن به آن را عوض کنید، به طور جدی بر روی خنثی کردن و کم اهمیت کردن واگویه‌های فعلی خویش کار کنید.</li></ul>" ;
    }
    elseif($C >= 406 && $C <= 505 ) {
        $result[1]['C'][1] = "حرکت در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، درحدود<span dir='ltr'>$percent</span>   درصد غم به همراه دارد. این مقدار غم خیلی بیشتر از حد استاندارد است(ما حد استاندارد را 25درصد در‌نظر گرفته‌ایم). هرچند بطور‌کامل غم، در حرکت به سمت هدف مشکلی مستمرایجاد نمی‌کند اما به هر حال هزینه حسی و روانی محسوب می شود و شما می‌توانید میزان این انرژی را در ناحیه C گراف ببینید." ;
        $result[1]['C'][2] = " شما به طور جدی دوست دارید که در این مسیر حرکت نکنید و این به این معناست که انرژی بازدارنده ی قابل توجهی وجود داردکه در مورد شما به حد التهاب حسی رسیده است. این انرژی پنهان است و گاهی ظاهر میشود.هر زمان که به حرکت نکردن در این مسیر فکر میکنید و با خود یا دیگران درباره ی آن حرف میزنید ، به طرز عجیبی فعال می‌شود و با ظاهر شدنش اثر منفی برکیفیت تلاش ها و فعالیت ها می گذارد. بیشترین اثر منفی این انرژی برروی پشتکار و پایداری شما در طی کردن مسیر به سمت هدف می باشد. حتما تجربه کرده‌اید؛ هنگامی‌که خسته یا عصبی هستید این نیرو ظاهر می شود و تمایل شما را برای ادامه دادن مسیر کم می‌کند." ;
        $result[1]['C'][3] = "دلیلش ساده است . تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما درباره انجام ندادن این فعالیت‌ها و رها کردنشان و یا رفتن به سمت هدفی دیگر با حسرت و آرزوی زیاد و حتی درحد اغراق حرف می زنید. در صورت اصلاح نکردن این مدل از واگویه ها، حرکت در این مسیر به منظور رسیدن به هدف ، برای تو به یک منبع بزرگ از غم و اندوه تبدیل خواهد شد که بی شک این حجم از غم مخرب خواهد بود." ;
        $result[1]['C'][4] = "یک لحظه فکر کن .«آیا واقعا انجام ندادن این کارها و فعالیت ها تا این حد میتواند خوب باشد؟» من که بعید می دانم انجام ندادن این کارها تا این حد خوب باشد.<br>به هر حال پاسخ هر چه باشد لازم است به این نکته توجه کنید که این رویکرد برای کسی که میخواهد به هدفی برسد به هیچ وجه خوب نیست و حرکت به سمت این هدف با این وضعیت از واگویه هامی تواند تبدیل به یکی از منابع جدی اندوه شود و بسیار حالگیر است.<br>اما چه باید کرد؟<br>تنها کاری که باید انجام دهید این است: «درباره شرایط و احساسات خوب ناشی از حرکت نکردن در این مسیر و انجام ندادن فعالیت های آن کمتر حرف بزنید و یا حداقل با احساس و حسرت کمتری با خود و دیگری در این رابطه گفتگو کنید.»<br> پس به طور کلی پیشنهاد می کنم:<ul><li>یا از حرکت در این مسیر صرف‌نظر کنید و بی‌خیال این هدف شوید.</li><li>یا اگر برایتان امکان پذیر نیست که  هدف را تغییر بدهید، مسیر بهتری برای رسیدن به آن پیدا کنید.</li><li>و یا اگر نمی توانید و یا نمی خواهید هدف و مسیر رسیدن به آن را عوض کنید، به طور جدی بر روی خنثی کردن و کم اهمیت کردن واگویه های فعلی خویش کار کنید.</li></ul>" ;
    }
    elseif($C >= 506 && $C <= 605 ) {
        $result[1]['C'][1] = "حرکت در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف ، درحدود <span dir='ltr'>$percent</span>  درصد غم به همراه دارد. این مقدار غم به شکل غیر طبیعی بیشتر از حد استاندارد است(ما حد استاندارد را 25درصد در‌نظر گرفته ایم). هرچند بطور‌کامل غم، در حرکت به سمت هدف مشکلی مستمرایجاد نمی‌کند اما به هر حال هزینه حسی و روانی محسوب می شود. و شما می توانید میزان این انرژی را در ناحیه C گراف ببینید." ;
        $result[1]['C'][2] = "شما به طورکاملا جدی دوست دارید که در این مسیر حرکت نکنید و این به این معناست که انرژی بازدارنده ی قابل توجهی وجود داردکه در مورد شما به انتهای حد التهاب حسی رسیده است. این انرژی پنهان است و گاهی ظاهر میشود.هر زمان که به حرکت نکردن در این مسیر فکر میکنید و با خود یا دیگران درباره ی آن حرف میزنید، به طرز عجیبی فعال میشود و با ظاهر شدنش اثر منفی برکیفیت تلاش ها و فعالیت ها می گذارد. بیشترین اثر منفی این انرژی برروی پشتکار و پایداری شما در طی کردن مسیر به سمت هدف می باشد. حتما تجربه کرده‌اید؛ هنگامیکه خسته یا عصبی هستید این نیرو ظاهر می شود و تمایل شما را برای ادامه دادن مسیر کم می‌کند." ;
        $result[1]['C'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما درباره انجام ندادن این فعالیت‌ها و رها کردنشان و یا رفتن به سمت هدفی دیگر با حسرت و آرزوی زیاد و حتی درحد اغراق حرف می زنید،اغراق آمیز و غیر‌طبیعی.در صورت اصلاح نکردن این مدل از واگویه ها ، حرکت در این مسیر به منظور رسیدن به هدف ، برای تو به یک منبع بزرگ از غم و اندوه تبدیل خواهد شد که بی شک این حجم از غم مخرب خواهد بود." ;
        $result[1]['C'][4] = "یک لحظه فکر کن. «آیا واقعا انجام ندادن این کارها و فعالیت ها تا این حد میتواند خوب باشد؟» من که بعید می دانم انجام ندادن این کارها تا این حد خوب باشد.<br>با من هم عقیده باشید یا نه، لازم است به این نکته توجه کنید که این رویکرد برای کسی که میخواهد به هدفی برسد به هیچ وجه خوب نیست و حرکت به سمت این هدف با این وضعیت از واگویه هامی تواند تبدیل به یکی از منابع جدی اندوه شود و بسیار حالگیر است.<br>اما چه باید کرد؟<br>تنها کاری که باید انجام دهید این است: «درباره شرایط و احساسات خوب ناشی از حرکت نکردن در این مسیر و انجام ندادن فعالیت های آن کمتر حرف بزنید و یا حداقل با احساس و حسرت کمتری با خود و دیگری در این رابطه گفتگو کنید.»<br>پس به طور کلی پیشنهاد می کنم:<ul><li>یا از حرکت در این مسیر صرف‌نظر کنید و بی‌خیال این هدف شوید.</li><li>یا اگر برایتان امکان پذیر نیست که  هدف را تغییر بدهید، مسیر بهتری برای رسیدن به آن پیدا کنید.</li><li>و یا اگر نمی توانید و یا نمی خواهید هدف و مسیر رسیدن به آن را عوض کنید، به طور جدی بر روی خنثی کردن و کم اهمیت کردن واگویه های فعلی خویش کار کنید.</li></ul>" ;
    }
    /////////////// D ///////////////////
    $percent =round(($D*100)/$percentMaxRange,0);
    $percentArray['D'] = $percent ;
    if($D >= 0  && $D <= 25 ) {
        $result[1]['D'][1] = "شما در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، خوشبختانه استرسی ندارید و این عالی است. نگاهی به  ناحیه D گراف بیاندازید." ;
        $result[1]['D'][2] = "انرژی که درناحیه D گراف دیده می‌شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. خوشبختانه، شما برای حرکت در مسیر هدف استرسی ندارید." ;
        $result[1]['D'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه هایی که به کار می برید فکر کنید و حس و حالتان را به یاد بیاورید. تمام داستان این است: شما درباره اینکه انجام ندادن این فعالیت‌ها ویا نرسیدن به هدف چقدر بد، خطرناک و مضر است هیچ واگویه‌ای ندارید." ;
        $result[1]['D'][4] = "این حالت بهترین قابلیت برای طی کردن درست وبدون استرس مسیر می باشد. نسبت به آن هشیار باشید و آن را حفظ کنید." ;
    }
    elseif($D >= 26 && $D <= 101 ) {
        $result[1]['D'][1] = "شما در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، خوشبختانه استرس کمی دارید یعنی در محدوده‌ای که ما آن راعادی می‌دانیم واین عالی است. نگاهی به  ناحیه  D گراف بیاندازید." ;
        $result[1]['D'][2] = "انرژی که درناحیه D گراف دیده می شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. انرژی استرس کارایی چندانی ندارد و میزان بهروری آن بسیار کم است. یعنی باعث می شود که در عمل، به اندازه زمان و انرژی که برای انجام کار هزینه می کنیم، نتیجه نگیریم. فکر می کنم لازم نیست که اثرات ویرانگر استرس بر بدن و روان را توضیح بدهم.<br>اما خبر خوب این است که، شما برای حرکت در مسیر هدف استرس کمی دارید، یعنی در محدوده‌ای که ما آن را عادی می دانیم. اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید این حدود <span dir='ltr'>$percent</span>  درصداز حداکثر مقدار خودش می باشد و این عالیست." ;
        $result[1]['D'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه‌هایی که به کار می‌برید فکر کنید و حس‌و‌حالتان را به یاد بیاورید. تمام داستان این است: شما درباره اینکه انجام ندادن این فعالیت‌ها ویا نرسیدن به هدف چقدر بد، خطرناک و مضر است تقریبا واگویه ی ندارید اما لازم است بیشتر حواستان باشد." ;
        $result[1]['D'][4] = "کافیست مراقب باشید که استرس تقویت نشود. واقعیت این است که این اتفاق خیلی آسان تر ازآنچه بنظر میاد، ممکن میشود. واگویه های منفی درباره اینکه انجام نشدن این کارها یا نرسیدن به هدف چقدر بد و خطرناک یا مضر است منجر به تقویت این ناحیه می شود. اگر چه بنظر می آید که این نوع مکالمات ذهنی باعث می‌شود به کار بیشتر اهمیت بدهید، اما باور کنید به مشکلاتی که ایجاد می‌کند نمی ارزد و سطح خلاقیت و هوشمندی در کار را هم کاهش می دهد." ;
    }
    elseif($D >= 102  && $D <= 203 ) {
        $result[1]['D'][1] = "شما در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، استرس کمی دارید در واقع کمی بیشتر از مقداری که می توان آن را عادی در‌نظر گرفت.  نگاهی به  ناحیه D گراف بیاندازید." ;
        $result[1]['D'][2] = "انرژی که درناحیه D گراف دیده می شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. انرژی استرس کارایی چندانی ندارد و میزان بهروری آن بسیار کم است. یعنی باعث می شود که در عمل به اندازه زمان و انرژی که برای انجام کار هزینه می کنیم، نتیجه نگیریم. فکر می کنم لازم نیست که اثرات ویرانگر استرس بر بدن و روان را توضیح بدهم.<br>شما برای حرکت در مسیر هدف استرس کمی دارید. اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید این حدود <span dir='ltr'>$percent</span>  درصد از حداکثر مقدار خودش می باشد. قبول دارم مقدار زیادی نیست اما هیچی هم نیست. همین مقدارهم، سطح خلاقیت و هوشمندی در کار را کاهش می دهد. پس لازم است که به آن توجه کنید چراکه می تواند خیلی سریع و زیرپوستی رشد کند و اوضاع را بدتر کند." ;
        $result[1]['D'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه‌هایی که به کار می برید فکر کنید و حس‌و‌حالتان را به یاد بیاورید. تمام داستان این است: شما واگویه های منفی درباره اینکه انجام نشدن این کارها یا نرسیدن به هدف چقدر بد و خطرناک یا مضر است، دارید ودرمورد آن با خود یا دیگران  حرف می زنید.اگر چه به‌نظر می‌آید این نوع مکالمات ذهنی باعث می‌شود به کاراهمیت بیشتری بدهید اما باور کنید به مشکلاتی که ایجاد می‌کند نمی ارزد و سطح خلاقیت و هوشمندی در کار را هم کاهش می دهد." ;
        $result[1]['D'][4] = "شمابرای حرکت در مسیر هدف به این واگویه‌ها و گفتگو‌ها نیاز ندارید. آنها هیچ کمکی نمی‌کنند. بهتر ‌است راجع به این‌که چقدر انجام این فعالیت ها بامزه و دوست داشتنی هستند، حرف بزنید ومراقب باشید که استرس تقویت نشود." ;
    }
    elseif($D >= 204  && $D <= 304 ) {
        $result[1]['D'][1] = "شما در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، استرس دارید که در واقع این مقدار کم نیست. در ‌نظر داشته باشید که استرس تا 25 درصد، تقریبا عادی‌‌است اما همان‌طور که می بینید درصد شما بیشتر از این میزان است. شما می‌توانید میزان آن را در ناحیه D گراف ببینید." ;
        $result[1]['D'][2] = "انرژی که درناحیه D گراف دیده می شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. انرژی استرس کارایی چندانی ندارد و میزان بهره‌وری آن بسیار کم است. یعنی باعث می شود که در عمل به اندازه زمان و انرژی که برای انجام کار هزینه می کنیم، نتیجه نگیریم. فکر می‌کنم لازم نیست که اثرات ویرانگر استرس بر بدن و روان را توضیح بدهم.<br>شما برای حرکت در مسیر هدف استرس دارید و مقدارش کم هم نیست. اکنون و با ذهنیتی که در حال حاضر درباره فعالیت‌ها دارید این حدود <span dir='ltr'>$percent</span>  درصد از حداکثر مقدار خودش می باشد. این مقدار سطح خلاقیت و هوشمندی در کار را کاهش می‌دهد." ;
        $result[1]['D'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه هایی که به کار می برید فکر کنید و حس‌و‌حالتان را به یاد بیاورید. تمام داستان این است: شما واگویه های منفی درباره اینکه انجام نشدن این کارها یا نرسیدن به هدف چقدر بد و خطرناک یا مضر است، دارید ودرمورد آن با خود یا دیگران  حرف می زنید.اگر چه به‌نظر می‌آید این نوع مکالمات ذهنی باعث می‌شود به کاراهمیت بیشتری بدهید اما باور کنید به مشکلاتی که ایجاد می‌کند نمی‌ارزد و سطح خلاقیت و هوشمندی در کار را هم کاهش می‌دهد." ;
        $result[1]['D'][4] = "شما برای حرکت در مسیر هدف به این واگویه‌ها و گفتگو‌ها نیاز ندارید. آنها واقعا کمکی نمی کنند. بدون این گفتگوها، می توانید مطمئن باشید با صرف وقت کمتر نتیجه بهتری خواهید گرفت. به حرفم اعتماد کنید، بهتر ‌است راجع به این که چقدر انجام این فعالیت‌ها بامزه و دوست داشتنی هستند، حرف بزنید." ;
    }
    elseif($D >= 305  && $D <= 405 ) {
        $result[1]['D'][1] = "شما در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، استرس زیادی دارید یا به ‌عبارتی خیلی زیاد. در ‌نظر داشته باشید که استرس تا 25 درصد، تقریبا عادی‌‌است اما همان‌طور که می بینید درصد شما بیشتر از این میزان است. شما می توانید میزان آن را در ناحیه D گراف ببینید." ;
        $result[1]['D'][2] = "انرژی که درناحیه D گراف دیده می شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. انرژی استرس کارایی چندانی ندارد و میزان بهروری آن بسیار کم است. یعنی باعث می شود که در عمل به اندازه زمان و انرژی که برای انجام کار هزینه می کنیم، نتیجه نگیریم. فکر می کنم لازم نیست که اثرات ویرانگر استرس بر بدن و روان را توضیح بدهم.<br>شما برای حرکت در مسیر هدف استرس زیادی دارید. اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید این حدود <span dir='ltr'>$percent</span>  درصد از حداکثر مقدار خودش می باشد. این مقدار سطح خلاقیت و هوشمندی در کار را کاهش می‌دهد. شما ممکن است وقت یا توجه زیادی به موضوع اختصاص بدهید اما این کار به این معنی نیست که نتیجه متناسبی هم ازآن خواهید گرفت." ;
        $result[1]['D'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه هایی که به کار می برید فکر کنید و حس و حالتان را به یاد بیاورید. تمام داستان این است: شما واگویه‌های منفی زیادی درباره اینکه انجام نشدن این کارها یا نرسیدن به هدف چقدر بد و خطرناک یا مضر است، دارید ودرمورد آن با خود یا دیگران زیاد حرف می زنید.اگر چه بنظر می‌آید این نوع مکالمات ذهنی باعث می‌شود به کار اهمیت بیشتری بدهید اما باور کنید به مشکلاتی که ایجاد می‌کند نمی‌ارزد و سطح خلاقیت و هوشمندی در کار را هم کاهش می دهد. این واگویه ها شما را تشویق خواهند کرد که وقت یا توجه زیادی به موضوع اختصاص بدهید اما این به این معنی نیست که نتیجه متناسبی هم ازآن خواهید گرفت.<br>راستش، این مقدار استرس آنقدر زیاد است که من احتمال می‌دهم هنگام پر کردن گراف دچار اشتباه شده باشید. یعنی به‌جای اینکه به این فکر کنید که چقدر انجام ندادن کارهای لازم در مسیر هدف بد است به این فکر کرده باشید که چقدر نرسیدن به هدف بد است. اگر اینطوراست، پیشنهاد می کنم دوباره گراف را با دقت بیشتری پر کنید. اما اگر درست پر کرده‌اید و به فعالیت در مسیر هدف فکر کرده‌اید و نه خود هدف، پس باید بگویم شما واقعا از انجام ندادن این فعالیت ها بدتان می آید.اما سوال مهم این است که این میزان بد‌آمدن چقدر به پیشرفت در مسیر کمک می‌کند؟" ;
        $result[1]['D'][4] = "شما برای حرکت در مسیر هدف به این واگویه ها و گفتگو ها نیاز ندارید. آنها واقعا کمکی نمی کنند. بدون این گفتگوها، می توانید مطمئن باشید با گذاشتن وقت کمتر نتیجه بهتری خواهید گرفت. به حرفم اعتماد کنید. بهتر ‌است راجع به این که چقدر انجام این فعالیت ها بامزه و دوست داشتنی هستند، حرف بزنید." ;
    }
    elseif($D >= 406 && $D <= 505 ) {
        $result[1]['D'][1] = "شما در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف، استرس خیلی زیادی را تجربه می‌کنید که می‌توان گفت حتی غیر‌طبیعی‌است. در ‌نظر داشته باشید که استرس تا 25 درصد، تقریبا عادی‌‌است اما همان‌طور که می بینید درصد شما بیشتر از این میزان است. شما می توانید میزان آن را در ناحیه D گراف ببینید." ;
        $result[1]['D'][2] = "انرژی که درناحیه D گراف دیده می شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. انرژی استرس کارایی چندانی ندارد و میزان بهروری آن بسیار کم است. یعنی باعث می شود که در عمل به اندازه زمان و انرژی که برای انجام کار هزینه می کنیم، نتیجه نگیریم. فکر می کنم لازم نیست که اثرات ویرانگر استرس بر بدن و روان را توضیح بدهم.<br>شما برای حرکت در مسیر هدف استرس خیلی زیادی دارید. اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید این حدود <span dir='ltr'>$percent</span>  درصد از حداکثر مقدار خودش می باشد. این مقدار سطح خلاقیت و هوشمندی در کار را کاهش میدهد. این یک استرس ملتهب است که حداکثر مقدار خودش را هم رد کرده است. این حالت در دراز مدت هم به روحیه و هم به بدن شما آسیب می رساند. هی رفیق با این کار یه منبع واقعی استرس برای خودت دست و پا می کنی." ;
        $result[1]['D'][3] = "دلیلش ساده است . تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه هایی که به کار می برید فکر کنید و حس و حالتان را به یاد بیاورید. دلیل این مقدار استرس این است که بیش از‌‌حد واگویه های منفی درباره اینکه انجام نشدن این کارها یا نرسیدن به هدف چقدر بد و خطرناک یا مضر است، دارید ودرمورد آن با خود یا دیگران خیلی زیاد حرف می زنید. اگر چه بنظر می آید این نوع مکالمات ذهنی باعث میشود به کاراهمیت بیشتری بدهید اما باور کنید به مشکلاتی که ایجاد می‌کند نمی ارزد و سطح خلاقیت و هوشمندی در کار را هم کاهش می دهد. این واگویه ها شما را تشویق خواهند کرد که وقت یا توجه زیادی به موضوع اختصاص بدهید اما این به این معنی نیست که نتیجه متناسبی هم ازآن خواهید گرفت.<br>راستش، این مقدار استرس آنقدرغیرطبیعی زیاد است که من احتمال می دهم هنگام پر کردن گراف دچار اشتباه شده باشید. یعنی بجای اینکه به این فکر کنید که چقدر انجام ندادن کارهای لازم در مسیر هدف بد است به این فکر کرده باشید که چقدر نرسیدن به هدف بد است. اگر اینطور است، پیشنهاد می‌کنم دوباره گراف را بادقت بیشتری پر کنید. اما اگر درست پر کرده‌اید و به فعالیت در مسیر هدف فکر کرده‌اید و نه خود هدف، پس باید بگویم شما حسابی از انجام ندادن این فعالیت ها بدتان می آید.اما سوال مهم این است که این میزان بد‌آمدن چقدر به پیشرفت در مسیر کمک می‌کند؟" ;
        $result[1]['D'][4] = "شما برای حرکت در مسیر هدف به این همه واگویه و گفتگو نگران کننده نیاز ندارید. آنها واقعا کمکی نمی کنند. به کمتر از آن هم نیازی نیست.بدون این گفتگوها، می توانید مطمئن باشید با گذاشتن وقت کمتر نتیجه بهتری خواهید گرفت. به حرفم اعتماد کنید. بهتر ‌است راجع به این که چقدر انجام این فعالیت ها بامزه و دوست داشتنی هستند، حرف بزنید." ;
    }
    elseif($D >= 506 && $D <= 605 ) {
        $result[1]['D'][1] = "شما در این مسیر و انجام فعالیت های لازم  جهت رسیدن به هدف ، استرس عجیبی دارید یا شاید بهتر بگم بشکلی غیر طبیعی زیاد. در ‌نظر داشته باشید که استرس تا 25 درصد، تقریبا عادی‌‌است اما همان‌طور که می بینید درصد شما بیشتر از این میزان است. شما می توانید میزان آن را در ناحیه  D گراف ببینید." ;
        $result[1]['D'][2] = "انرژی که درناحیه D گراف دیده می شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. انرژی استرس کارایی چندانی ندارد و میزان بهره‌وری آن بسیار کم است. یعنی باعث می شود که در عمل به اندازه زمان و انرژی که برای انجام کار هزینه می‌کنیم، نتیجه نگیریم. فکر می‌کنم لازم نیست که اثرات ویرانگر استرس بر بدن و روان را توضیح بدهم.<br>شما برای حرکت در مسیر هدف استرس خیلی زیادی دارید. اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید این حدود <span dir='ltr'>$percent</span>  درصد از حداکثر مقدار خودش می باشد. این مقدار سطح خلاقیت و هوشمندی در کار را کاهش می‌دهد. این یک استرس کاملا ملتهب است که حداکثر مقدار خودش را هم رد کرده است. این حالت در دراز مدت هم به روحیه و هم به بدن شما آسیب می رساند. هی رفیق با این کار یه منبع واقعی استرس برای خودت دست و پا می کنی." ;
        $result[1]['D'][3] = "دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه هایی که به کار می برید فکر کنید و حس و حالتان را به یاد بیاورید. دلیل این مقدار استرس این است که بیش از‌‌حد واگویه های منفی درباره اینکه انجام نشدن این کارها یا نرسیدن به هدف چقدر بد و خطرناک یا مضر است، دارید ودرمورد آن با خود یا دیگران خیلی زیاد حرف می زنید. اگر چه بنظر می آید این نوع مکالمات ذهنی باعث میشود به کاراهمیت بیشتری بدهید اما باور کنید به مشکلاتی که ایجاد می‌کند نمی ارزد و سطح خلاقیت و هوشمندی در کار را هم کاهش می دهد. این واگویه ها شما را تشویق خواهند کرد که وقت یا توجه زیادی به موضوع اختصاص بدهید اما این به این معنی نیست که نتیجه متناسبی هم ازآن خواهید گرفت.<br>راستش، این مقدار استرس آنقدرغیرطبیعی زیاد است که من احتمال می‌دهم هنگام پر کردن گراف دچار اشتباه شده باشید. یعنی بجای اینکه به این فکر کنید که چقدر انجام ندادن کارهای لازم در مسیر هدف بد است به این فکر کرده باشید که چقدر نرسیدن به هدف بد است. اگر اینطوراست، پیشنهاد می‌کنم دوباره گراف را با دقت بیشتری پر کنید. اما اگر درست پر کرده‌اید و به فعالیت در مسیر هدف فکر کرده‌اید و نه خود هدف، پس باید بگویم شما حسابی از انجام ندادن این فعالیت ها بدتان می آید و نفرت دارید. اما سوال مهم این است که این میزان بد‌آمدن چقدر به پیشرفت در مسیر کمک می‌کند؟" ;
        $result[1]['D'][4] = "شما برای حرکت در مسیر هدف به این همه واگویه و گفتگو نگران کننده نیاز ندارید. آنها واقعا کمکی نمی‌کنند. به کمتر از آن هم نیازی نیست.بدون این گفتگوها، می توانید مطمئن باشید با گذاشتن وقت کمتر نتیجه بهتری خواهید گرفت. به حرفم اعتماد کنید. بهتر ‌است راجع به این که چقدر انجام این فعالیت ها بامزه و دوست داشتنی هستند، حرف بزنید." ;
    }
    ////////////////    نیاز حسی    /////////////////////
    /////////////// A-B ///////////////////
    $x = $A - $B ;
    $percent = round(($x * 100) / $percentMaxRange, 0);
    if($x <= -25 ) {
        //$percent =round(((-1*$x)*100)/$percentMaxRange,0);
        $result[2][1][1] = "نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی ،سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی، رضایت است یعنی نشان می‌دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می‌گذارد. <br>مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می‌کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست." ;
        $result[2][1][2] = "اکنون و با ذهنیتی که در حال حاضر درباره فعالیت‌ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  <span dir='ltr'>$percent</span>  درصد است. <br>اوه !! این عدد منفی است. یعنی با این برنامه ای که در سر دارید، حرکت به سمت هدف، نه تنها قادر به ارضای نیازهای درونی شما نیست که برعکس حال شما را بدتر نیز خواهد کرد. حرکت در این مسیر باعث می‌شود که در مجموع احساس عدم‌رضایت کنید و این حالت به هیچ‌وجه برای رسیدن به هدف خوب نیست.<br>برای افزایش سطح رضایت از انجام دادن  کارهایی که لازم است برای رسیدن به هدف  انجام بدهید به شما پیشنهاد می‌کنم:<br> واگویه‌های مثبت نسبت به انجام دادن کارهای لازم برای رسیدن به هدف را افزایش دهید و واگویه‌های منفی، بازهم نسبت به انجام دادن آن کارها را کاهش دهید.<br> توجه داشته باشید که این دو به هیچ‌وجه با یکدیگر یکی نیستند. احساسات منفی شما نسبت به فعالیت‌ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می‌باشد.لازم است که واگویه‌های منفی را به نحوی خنثی کنید.<br>شاید برای این کار به مشاوره دقیق تری نیاز داشته باشید." ;
    }
    elseif($x > -25 && $x <= 25 ) {
//        if($x<0){
//            $percent =round(((-1*$x)*100)/$percentMaxRange,0);
//        }
        $result[2][1][1] = "نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی، سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی، رضایت است یعنی نشان می دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می‌گذارد. مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست." ;
        $result[2][1][2] = "اکنون و با ذهنیتی که در حال حاضر درباره فعالیت‌ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  <span dir='ltr'>$percent</span>  درصد است. <br>اوه! این مقدار یعنی هیچی. پس با این برنامه ای که در سر دارید، حرکت به سمت هدف، نمی تواند به ارضای نیازهای درونی شما کمکی بکند. حرکت در این مسیر باعث نمی‌شود که در مجموع احساس رضایت کنید البته خوشبختانه باعث ایجاد حس عدم رضایت هم نمی‌شود. به عبارت دیگر انجام دادن و یا ندادن این فعالیت‌ها برای شما علی‌السویه است که  این حالت چندان جالب نیست.<br>برای افزایش سطح رضایت از انجام دادن  کارهایی که لازم است برای رسیدن به هدف  انجام بدهید به شما پیشنهاد می‌کنم:<br> واگویه‌های مثبت نسبت به انجام دادن کارهای لازم برای رسیدن به هدف را افزایش دهید و واگویه‌های منفی، بازهم نسبت به انجام دادن آن کارها را کاهش دهید.<br> توجه داشته باشید که این دو به هیچ‌وجه با یکدیگر یکی نیستند. احساسات منفی شما نسبت به فعالیت ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می‌باشد.لازم است که واگویه‌های منفی را به نحوی خنثی کنید. شاید برای این کار به مشاوره دقیق‌تری نیاز داشته باشید." ;
    }
    elseif($x >= 26  && $x <= 100 ) {
        $result[2][1][1] = "نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی ،سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی رضایت است یعنی نشان می‌دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می‌گذارد. مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می‌کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست." ;
        $result[2][1][2] = "اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  <span dir='ltr'>$percent</span>  درصد است. <br>خب این میزان خیلی کم است. یعنی با این برنامه ای که در سر دارید، حرکت به سمت هدف، می تواند کمک خیلی کمی به ارضای نیازهای درونی شما  کند. درمجموع حرکت در این مسیر باعث نمی شود که  احساس رضایت کنید اما خوشبختانه  باعث ایجاد حس عدم رضایت هم نمی‌شود. دوست من این وضعیت برای رسیدن به هدف خیلی جالب نیست.<br>برای افزایش سطح رضایت از انجام دادن  کارهایی که لازم است برای رسیدن به هدف  انجام بدهید به شما پیشنهاد می کنم:<br> واگویه‌های مثبت نسبت به انجام دادن کارهای لازم برای رسیدن به هدف را افزایش دهید و واگویه های منفی، بازهم نسبت به انجام دادن آن کارها را کاهش دهید.<br> توجه داشته باشید که این دو به هیچ وجه با یکدیگر یکی نیستند. احساسات منفی شما نسبت به فعالیت ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می باشد.لازم است که واگویه‌های منفی را به نحوی خنثی کنید. شاید برای این‌کار به مشاوره دقیق‌تری نیاز داشته باشید." ;
    }
    elseif($x >= 101  && $x < 203 ) {
        $result[2][1][1] = "نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی ،سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی رضایت است یعنی نشان می دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می‌گذارد. مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست." ;
        $result[2][1][2] = "اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  <span dir='ltr'>$percent</span>  درصد است. <br>خب این میزان بدک نیست. یعنی با این برنامه ای که در سر دارید، حرکت به سمت هدف، می تواند به ارضای نیازهای درونی شما کمک کند. حرکت در این مسیر باعث می‌شود که در مجموع احساس رضایت کنید البته نه چندان زیاد اما باز هم خوب است. ما ترجیح می‌دهیم که اوضاع بگونه ای باشد که فعالیت های روزانه منبع حس رضایت و ارضا درونی هم باشد. در حال حاضر شما در این وضعیت نیستید اما می توان آن را بهتر هم کرد.<br>برای افزایش سطح رضایت از انجام دادن کارهایی که لازم است برای رسیدن به هدف  انجام بدهید به شما پیشنهاد می کنم:<br> واگویه‌های مثبت نسبت به انجام دادن کارهای لازم برای رسیدن به هدف را افزایش دهید و واگویه های منفی، بازهم نسبت به انجام دادن آن کارها را کاهش دهید.<br> توجه داشته باشید که این دو به هیچ وجه با یکدیگر یکی نیستند. احساسات منفی شما نسبت به فعالیت‌ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می باشد.لازم است که واگویه های منفی را به نحوی خنثی کنید. شاید برای این کار به مشاوره دقیق تری نیاز داشته باشید." ;
    }
    elseif($x >= 203  && $x < 304 ) {
        $result[2][1][1] = "نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی ،سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی رضایت است یعنی نشان می دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می‌گذارد. مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می‌کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست." ;
        $result[2][1][2] = "اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  <span dir='ltr'>$percent</span>  درصد است. <br>خب این مقدارخوب است. یعنی با این برنامه ای که در سر دارید، حرکت به سمت هدف، می تواند به ارضای نیازهای درونی شما کمک محسوسی کند. حرکت در این مسیر باعث می شود که در مجموع احساس رضایت خوبی داشته باشید و این جای تبریک دارد. ما ترجیح می‌دهیم که اوضاع بگونه ای باشد که فعالیت های روزانه منبع حس رضایت و ارضا درونی هم باشد. شما در حال حاضردر وضعیت خوبی هستید اما می توانید آن را بهتر کنید.<br>من نمی‌دانم که از نظر بیرونی چقدر به این فعالیت‌ها نیاز دارید ( فعالیت را می گویم و نه هدف را) اما می‌دانم که از نظر حسی به آن نیاز دارید. این وضع نتیجه ی وجود واگویه های مثبت نسبت به انجام دادن کارهای لازم و اندک بودن واگویه های منفی بازهم نسبت به همان کارهاست.توجه داشته باشید که این دو به هیچ وجه با یکدیگر یکی نیستند.<br>احساسات منفی شما نسبت به فعالیت ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می باشد." ;
    }
    elseif($x >= 304 && $x <= 455 ) {
        $result[2][1][1] = "نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی ،سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی رضایت است یعنی نشان می دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می گذارد. مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست." ;
        $result[2][1][2] = "اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  <span dir='ltr'>$percent</span>  درصد است. <br>خب این مقدارعالیست. یعنی با این برنامه ای‌که در سر دارید، حرکت به سمت هدف، می تواند به ارضای نیازهای درونی شما کمک درست و حسابی کند. حرکت در این مسیر باعث می شود که در مجموع احساس رضایت بسیارخوبی داشته باشید و این واقعا جای تبریک دارد چرا که ما ترجیح می‌دهیم که اوضاع بگونه ای باشد که فعالیت های روزانه منبع حس رضایت و ارضا درونی هم باشد که در مورد شما دقیقا به همین شکل است.<br>من نمی دانم که از نظر بیرونی چقدر به این فعالیت‌ها نیاز دارید ( فعالیت را می‌گویم و نه هدف را) اما می‌دانم که از نظر حسی به آن واقعا نیاز دارید. این وضع نتیجه‌ی وجود واگویه های مثبت نسبت به انجام دادن کارهای لازم و اندک بودن واگویه های منفی بازهم نسبت به همان کارهاست.توجه داشته باشید که این دو به هیچ وجه با یکدیگر یکی نیستند.احساسات منفی شما نسبت به فعالیت ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می باشد." ;
    }
    elseif($x > 455 && $x <= 605 ) {
        $result[2][1][1] = "نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی ،سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی رضایت است یعنی نشان می دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می‌گذارد. مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می‌کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست." ;
        $result[2][1][2] = "اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  <span dir='ltr'>$percent</span>  درصد است.<br>خب این مقدار بیشتر از خوب است. یعنی با این برنامه ای که در سر دارید، حرکت به سمت هدف، می تواند کاملا به ارضای نیازهای درونی شما کمک کند. <br>حرکت در این مسیر باعث می‌شود که در مجموع احساس رضایت بیش از حدی داشته باشید . این وضعیت از یک نظر جای تبریک دارد چرا که ما ترجیح می‌دهیم که اوضاع بگونه‌ای باشد که فعالیت های روزانه منبع حس رضایت و ارضا درونی هم باشد که در مورد شما دقیقا به همین شکل است. اما ما شاهد التهاب هم هستیم. یعنی در مقایسه با حالت متعادل،این مقدار خارج از حد تعادل است واین نشان می‌دهد که هیجان‌زدگی غیر طبیعی وجود دارد. <br>توصیه ما همیشه حفظ تعادل در عالی‌ترین سطح می باشد. وجود التهاب در اینجا هشداریست مبنی بر اینکه  به این فعالیت آنقدر هم که فکر می‌کنید نیاز ندارید. منظورم این است که به آن نیاز دارید ولی نه تا این حد. فقط آگاه باشید که  بخشی از نیازی که حس می‌کنید واقعی نیست. (همان مقدار که از صددرصد بیشتر است)<br>این وضع نتیجه ی وجود واگویه های زیادی مثبت نسبت به انجام دادن کارهای لازم و اندک بودن واگویه های منفی بازهم نسبت به همان کارها می باشد. توجه داشته باشید که این دو به هیچ وجه با یکدیگر یکی نیستند.احساسات منفی شما نسبت به فعالیت‌ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می‌باشد." ;
    }
    /////////////// C-D ///////////////////
    $x = $C - $D ;
    $percent = round(($x * 100) / $percentMaxRange, 0);
    if($x <= -100 ) {
        //$percent =round(((-1*$x)*100)/$percentMaxRange,0);
        $result[2][2][1] = " نیاز حسی به ترک فعالیت و حرکت نکردن به سمت هدف یعنی اینکه شما چقدر نیاز دارید که این کار را انجام ندهید یا به بیان بهتر چقدر ترک کردن مسیر و بی خیال شدن آن به ارضای نیازهای درونی شما کمک می‌کند. و در این مورد خاص بر اساس چیزهایی که به من گفتید،این مقدار  <span dir='ltr'>$percent</span>   درصد است.<br> این بدین معناست که ترک کردن مسیر و انجام ندادن این فعالیت ها نه تنها کمکی به ارضای نیازهای درونی شما نمی کند ( باعث حس رضایت نمی‌شود) که حتی باعث ایجاد عدم رضایت می شود." ;
        $result[2][2][2] = "طبق آنچه گفته شد می توان نتیجه گرفت که  موجودیت حسی شما واقعا نمی خواهد که این مسیر را بیخیال شود حتی اگر خود شما بخواهید. شاید تصور شما این است که  ترک مسیر منجر به  ایجاد نارضایتی درونی می‌شودکه برای موفقیتت می‌تواند خوب باشد.اما من نمی توانم بگویم خوب است. شخصا به عنوان دانش گراف حسی،( اگه قبول کنی به من بگی شخص!)ترجیح می دهم که این عدد نزدیک صفر باشد یعنی ترک کردن این فعالیت‌ها نه حال شما  را خراب کند و نه حال شما را خوب کند. <br>بله این واقعا بهتراست." ;
    }
    elseif($x > -100 && $x <= 100 ) {
//        if($x<0){
//            $percent =round(((-1*$x)*100)/$percentMaxRange,0);
//        }
        $result[2][2][1] = "نیاز حسی به ترک فعالیت و حرکت نکردن به سمت هدف یعنی اینکه شما چقدر نیاز دارید که این کار را انجام ندهید یا به بیان بهتر چقدر ترک کردن مسیر و بی‌خیال شدن آن به ارضای نیاز‌های درونی شما کمک می کند. و در این مورد خاص بر اساس چیزهایی که به من گفتید، این مقدار  <span dir='ltr'>$percent</span>   درصد است.<br> این بدین معناست که ترک کردن مسیر و انجام ندادن این فعالیت‌ها باعث  احساس رضایت چندانی  نمی‌شود و البته باعث عدم رضایت هم نمی‌شود." ;
        $result[2][2][2] = "طبق آنچه گفته شد می توان نتیجه گرفت که  موجودیت حسی شما واقعا نمی‌خواهد که این مسیر را بی‌خیال شود حتی اگر خود شما بخواهید. شاید تصور شما این است که  ترک مسیر منجر به  ایجاد نارضایتی درونی می‌شودکه برای موفقیتت می تواند خوب باشد.اما من نمی توانم بگویم خوب است. شخصا به عنوان دانش گراف حسی،( اگه قبول کنی به من بگی شخص!)ترجیح می دهم که این عدد نزدیک صفر باشد یعنی ترک کردن این فعالیت ها نه حال شما  را خراب کند و  نه حال شما را  خوب کند. <br>بله این واقعا بهتراست. جای تبریک دارد چراکه شما در چنین وضعیتی قرار دارید. <br>پس تبریک من را بپذیرید." ;
    }
    elseif($x > 100  && $x <= 405 ) {
        $result[2][2][1] = " نیاز حسی به ترک فعالیت و حرکت نکردن به سمت هدف یعنی اینکه شما چقدر نیاز دارید که این کار را انجام ندهید یا به بیان بهتر چقدر ترک کردن مسیر و بی خیال شدن آن به ارضای نیاز های درونی شما کمک می کند. و در این مورد خاص بر اساس چیزهایی که به من گفتید، این مقدار  <span dir='ltr'>$percent</span>   درصد است. این بدین معناست که ترک کردن مسیر و انجام ندادن این فعالیت ها باعث میشود احساس رضایت کنید." ;
        $result[2][2][2] = "اینکه ترک این فعالیت‌ها در راستای ارضای نیاز های درونی شما باشد خبر خوبی برای حرکت در مسیر هدف محسوب نمی‌شود اما به خودی خود هم نگران کننده نیست. چون چیزی که بیشتر اهمیت دارد این است که چقدر به انجام این فعالیت ها احساس نیاز دارید.<br> شخصا به عنوان دانش گراف حسی،( اگه قبول کنی به من بگی شخص!)ترجیح می دهم که این عدد نزدیک صفر باشد یعنی ترک کردن این فعالیت ها نه حال شما  را خراب کند و  نه حال شما را  خوب کند.این واقعا بهترین حالت است. <br>اما الان وضعیت شما به این شکل نیست. چون حجم واگویه هایی از جنس «چقدر دوست دارم این کار رو انجام ندم» خیلی بیشتر از واگویه هایی است که می گویند «چقدر ترک کردن این کار می تواد بد باشه»." ;
    }
    elseif($x > 405  && $x <= 605 ) {
        $result[2][2][1] = " نیاز حسی به ترک فعالیت و حرکت نکردن به سمت هدف یعنی اینکه شما چقدر نیاز دارید که این کار را انجام ندهید یا به بیان بهتر چقدر ترک کردن مسیر و بی‌خیال شدن آن به ارضای نیاز های درونی شما کمک می‌کند. و در این مورد خاص بر اساس چیزهایی که به من گفتید، این مقدار  <span dir='ltr'>$percent</span>   درصد است.<br> این بدین معناست که ترک کردن مسیر و انجام ندادن این فعالیت ها باعث می‌شود به شکل غیر طبیعی  احساس رضایت کنید." ;
        $result[2][2][2] = "اینکه ترک این فعالیت ها در راستای ارضای نیاز های درونی شما باشد خبر خوبی برای حرکت در مسیر هدف محسوب نمی‌شود .<br> شخصا به عنوان دانش گراف حسی،( اگه قبول کنی به من بگی شخص!)ترجیح می‌دهم که این عدد نزدیک صفر باشد یعنی ترک کردن این فعالیت ها نه حال شما  را خراب کند و  نه حال شما را  خوب کند.این واقعا بهترین حالت است. <br>اما الان اصلا اینجوری نیست. چون حجم واگویه‌هایی که با خود دارید که می گویند«چقدر دوست دارم این کار رو انجام ندم» خیلی بیشتر از واگویه‌هایی است که می‌گویند«چقدر ترک کردن این کار می تواند بد باشه»." ;
    }/////////////// A-B و C-D ///////////////////
    $x1 = $A - $B ;
    $x2 = $C - $D ;
    if($x1 < -25  && $x2 <= -100 ) {
        $result[2][3][1] = "همینطورکه پیداست اینجا وضعیت خاصی وجود دارد. وضعیتی که نشان می‌دهد هم حرکت کردن به سمت هدف برخلاف نیازهای درونی شماست و هم ترک کردن این مسیر! نه انجام دادن این کار به بهبود حسی شما کمکی می‌کند و نه ترک کردن آن، پس الان هیچ تصمیمی همراستا با نیازهای درونی شما نیست. <br>دوست من این وضعیت سختی است. معنی آن این است که در این حالت هیچ انتخابی در دنیای بیرون، شما را راضی نخواهد کرد. <br>پس ابتدا نیاز دارید قبل از هر اقدام عملی گراف خود را تغییر بدهید. کاری که با تغییر واگویه ها و مکالمات ذهنی امکان پذیر است.<br>اگه می خواهید که این کار را ادامه دهید لازم است حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر را آرام کنید.<br>ولی اگه می خواهید این مسیر را ترک کنید لازم است که حرف های منفی نسبت به هدف را تقویت کنی و بقیه ناحیه ها را آرام کنید.<br>البته بهتراست که قبل از تصمیم گیری، به تحلیل من درباره توانایی حسی هم گوش کنی." ;
    }
    elseif($x1 < -25 && ($x2 > -100 && $x2 <=100 )) {
        $result[2][3][1] = "ما در اینجا با این وضعیت مواجه هستیم که حرکت در این مسیر برخلاف نیازهای درونی شماست در حالی که ترک کردن این مسیر نه به نفع این نیازها است و نه برخلاف آنها. پس در حال حاضر نیازهای حسی شما به گونه‌ای هستند که اوضاع اندکی به نفع ترک فعالیت است.<br>اگر می‌خواهید که این کار را ادامه بدهید لازم است که حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر را آرام کنید. یعنی گفتگوهای منفی درباره انجام دادن، گفتگوهای مثبت درباره انجام ندادن وگفتگوهای منفی نسبت به انجام ندادن همگی کاهش پیدا کنند.<br>ولی اگر می‌خواهید این مسیر را ترک کنید لازم است که حرف های منفی نسبت به هدف را تقویت کنید و بقیه ناحیه ها را آرام کنید. <br>البته بهتر است که قبل از تصمیم گیری به تحلیل من درباره توانایی حسی هم گوش کنید." ;
    }
    elseif($x1 < -25 && $x2 > 100 ) {
        $result[2][3][1] = "حرکت در این مسیر برخلاف نیازهای درونی شماست  و از سوی دیگر ترک کردن این مسیر در جهت ارضای این نیازها است. پس در حال حاضر از نظر نیازهای حسی اوضاع به نفع ترک فعالیت است.<br>اگر می‌خواهید که این کار را ادامه بدهید لازم است که حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر  را آرام کنید. یعنی گفتگوهای منفی درباره انجام دادن، گفتگوهای مثبت درباره انجام ندادن و گفتگوهای منفی نسبت به انجام ندادن همگی کاهش پیدا کنند.<br>ولی اگر می خواهید این مسیر را ترک کنید لازم است که حرف‌های منفی نسبت به هدف را تقویت کنید و بقیه ناحیه ها را آرام کنید. <br>البته بهتر است که قبل از تصمیم گیری، به تحلیل من درباره توانایی حسی خود هم گوش کنید." ;
    }
    elseif(($x1 >= -25 && $x1 <= 25) && $x2 <= -100 ) {
        $result[2][3][1] = "از یک سو حرکت در این مسیر برای نیازهای درونی شماعلی السویه است واز سوی دیگر حرکت نکردن در این مسیر، در جهت خلاف ارضای این نیازها است. پس در حال حاضر از نظر نیازهای حسی اوضاع کمی به نفع انجام فعالیت است.<br>اگر می‌خواهید که این کار را ادامه بدهید لازم است که حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر  را آرام کنید. یعنی گفتگوهای منفی درباره انجام دادن، گفتگوهای مثبت درباره انجام ندادن و گفتگوهای منفی نسبت به انجام ندادن همگی کاهش پیدا کنند.<br>ولی اگه می خواهید این مسیر را ترک کنید لازم است که حرف های منفی نسبت به هدف را تقویت کنید و بقیه ناحیه ها را آرام کنید. <br>البته بهتر است که قبل از تصمیم گیری، به تحلیل من درباره توانایی حسی خود هم گوش کنید." ;
    }
    elseif(($x1 >= -25 && $x1 <= 25) && ($x2 > -100 && $x2 <= 100 )) {
        $result[2][3][1] = "هم حرکت کردن و هم حرکت نکردن در این مسیر، هردو برای نیازهای درونی شماعلی السویه است. شما هدف و فعالیتی را انتخاب کرده‌اید که بود و نبودش تاثیر معنی داری بر موجودیت حس شما نمی‌گذارد. این بی تفاوتی چندان جالب نیست.حالت بهتر این است که حرکت در مسیر روی موجودیت حسی اثر ارضا کننده بگذارد.<br>اگر می‌خواهید که این کار را ادامه بدهید لازم است که حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر  را آرام کنید. یعنی گفتگوهای منفی درباره انجام دادن، گفتگوهای مثبت درباره انجام ندادن و گفتگوهای منفی نسبت به انجام ندادن همگی کاهش پیدا کنند.<br>ولی اگر می خواهید این مسیر را ترک کنید لازم است که حرف های منفی نسبت به هدف را تقویت کنید و بقیه ناحیه ها را آرام کنید.<br>البته بهتر است که قبل از تصمیم گیری، به تحلیل من درباره توانایی حسی خود هم گوش کنید." ;
    }
    elseif(($x1 >= -25 && $x1 <= 25) && $x2 > 100 ) {
        $result[2][3][1] = "حرکت در این مسیر برای نیازهای درونی شماعلی السویه است ولی از سوی دیگر حرکت نکردن در این مسیر در جهت ارضای این نیازها است. پس در حال حاضر از نظر نیازهای حسی،اوضاع به نفع انجام ندادن فعالیت است.<br>اگر می‌خواهید که این کار را ادامه بدهید لازم است که حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر  را آرام کنید. یعنی گفتگوهای منفی درباره انجام دادن، گفتگوهای مثبت درباره انجام ندادن و گفتگوهای منفی نسبت به انجام ندادن همگی کاهش پیدا کنند.<br>ولی اگر می‌خواهید این مسیر را ترک کنید لازم است که حرف‌های منفی نسبت به هدف را تقویت کنید و بقیه ناحیه‌ها را آرام کنید.<br>البته بهتر است که قبل از تصمیم گیری، به تحلیل من درباره توانایی حسی خود هم گوش کنید." ;
    }
    elseif($x1 > 25  && $x2 <= -100 ) {
        $result[2][3][1] = "از یک سو حرکت در این مسیر برای نیازهای درونی خوب است و از سوی دیگر حرکت نکردن در این مسیر در خلاف جهت ارضای این نیازها است. پس در حال حاضر از نظر نیازهای حسی، اوضاع کاملا به نفع انجام دادن فعالیت است." ;
    }
    elseif($x1 > 25 && ($x2 > -100 && $x2 <= 100 )) {
        $result[2][3][1] = "از یک سو حرکت در این مسیر برای نیازهای درونی شما خوب است و از سوی دیگر حرکت نکردن در این مسیر برای نیازهای موجودیت حسی شما نه بد است و نه خوب. پس در حال حاضر از نظر نیازهای حسی، اوضاع به نفع انجام دادن فعالیت است." ;
    }
    elseif($x1 > 25  && $x2 > 100 ) {
        $result[2][3][1] = "از یک سو هم حرکت در این مسیر برای نیازهای درونی شما خوب است و از سوی دیگر حرکت نکردن  هم در این مسیر برای نیازهای موجودیت حسی شما خوب است. یعنی، چه در مسیر هدف، فعالیت روزانه انجام بدهی و چه انجام ندهی، در هرحال موجودیت حسی شما حال خوبی دارد و به اصطلاح  حال می‌کند. این وضع جالبی‌است که به شما این امکان را می‌دهد که بدون استرس انتخاب کنید.<br>اگر می‌خواهید که این کار را ادامه بدهید لازم است که حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر  را آرام کنید. یعنی گفتگوهای منفی درباره انجام دادن، گفتگوهای مثبت درباره انجام ندادن و گفتگوهای منفی نسبت به انجام ندادن همگی کاهش پیدا کنند.<br>ولی اگر می‌خواهید این مسیر را ترک کنید لازم است که حرف‌های منفی نسبت به هدف را تقویت کنید و بقیه ناحیه‌ها را آرام کنید.<br>البته بهتر است که قبل از تصمیم گیری، به تحلیل من درباره توانایی حسی خود هم گوش کنید." ;
    }
    /////////////// توانایی حسی ///////////////////
    /////////////// (A+D)- B ///////////////////
    /////////////// (A+D)-(B+C) ///////////////////
    $percentMaxRange = 810 ;
    $x = ($A + $D)- $B ;
    $percent = round(($x * 100) / $percentMaxRange, 0);
    $percentArray['A+D-B'] = $percent ;
    if($x < 0 ) {
        //$percent =round(((-1*$x)*100)/$percentMaxRange,0);
        $result[3][1][1] = "عامل «توانایی حسی» نشان می‌دهد شما چقدر می‌توانید بر این کار اثرگذار باشید. درست برعکس عامل «نیاز حسی» که از اثر گذاری موضوع بر شما سخن می‌گفت.<br>این سومین فاکتور از مجموعه تعیین کننده «هماهنگی حسی» است که درکنار علاقه و نیاز حسی، چهارچوب رابطه شما با موضوع را شکل می‌دهد. خوب البته سه چوب! در نهایت، این فاکتور است که می‌گوید شما توانایی انجام این کار را دارید یا خیر. آیاحضور شما در این فعالیت خبر خوبی برای این کار محسوب می‌شود یا خیر ." ;
        $result[3][1][2] = "توانایی حسی <span dir='ltr'>$percent</span>   درصد<br>متاسفانه توانایی شما برای فعالیت در مسیر این هدف منفی است. این یعنی اینکه اصولا برای این کار توانا نیستید. در حقیقت «ناتوانایی حسی» دارید و به عبارت دیگر این کار انتخاب شما نیست (عدم انتخاب) و به اندازه کافی از آن لذت نمی‌برید. اما ممکن است این ناتوانایی را به نداشتن اراده تعبیر کنید که درست نیست.<br>با فشار آوردن بر اراده و افزایش انگیزه‌ها و تاکید بر اهمیت هدف، ناتوانایی به توانایی تبدیل نمی‌شود تنها منجر به افزایش استرس می‌شود.موضوع ربطی به اراده ندارد." ;
        $result[3][1][3] =  "همان طور که گفته شد توانایی شما برای فعالیت در مسیر این هدف منفی است و شما اصولا برای این کار توانا نیستید. البته من متوجه هستم که این خبر ممکن است ناخوشایند و زیادی رک باشد. اما به عنوان دوست و مشاور شما این صراحت را لازم می‌دانم. هرچه باشد شما می‌خواهید وقت قابل توجه‌ای را صرف رسیدن به این هدف کنید. هدفی که درحال حاضر برای آن مناسب نیستید.<br>می‌توانیم بگوییم اثر منفی شما بر این کار بیش از اثر مثبت شما است و اگر اجبارهای بیرونی وجود نداشته باشند چنین فعالیت‌هایی انتخاب موجودیت حسی شما نیست. مکانیزم تصمیم گیری در شما انجام چنین فعالیتی را انتخاب نمی‌کند و تن دادن تحت فشار به آنها تجربه ای موقتی یا تقلبی خواهد بود. در هر فرصتی از انجام این کار طفره می‌روید.این طفره رفتن خود را گاهی بشکل فراموشی نشان می‌دهد و گاهی به‌شکل به تعویق انداختن این دسته از فعالیت‌ها." ;
        $result[3][1][4] =  "با بررسی که انجام شد متوجه شدید که این کار انتخاب شما نیست و به اندازه کافی از آن لذت نمی‌برید. این موضوعی است که باید حل شود.اما چگونه؟<br>اگر مصر به حرکت در این مسیر هستید باید رابطه شما با این فعالیت از درون متحول شود.مکالمات ذهنی، بینش‌ها و نوع نگاه شما به ارزش، اهمیت، فایده و لذت این فعالیت( و نه هدف) اساساً نیاز به تغییر دارد. توصیه می‌کنم پیش از اینکه بخواهید در این مسیر پیشروی را آغاز کنید، وقت و انرژی خود راروی این تغییر سرمایه‌گذاری کنید. ولی به هرحال درصورت حفظ وضع موجود، باید گفت که شما فعلا اصلا مناسب انجام این کار نیستید و می‌دانم این خبر خوبی نیست. پس یا هدف را بی خیال شوید و آن را رها کنید یا طبق روشی که گفتم اول خود را برای پیمودن مسیر آن مناسب کنید." ;
    }
    elseif($x >= 0  && $x < 101 ) {
        $result[3][1][1] =  "عامل «توانایی حسی» نشان می‌دهد شما چقدر می‌توانید بر این کار اثرگذار باشید. درست برعکس عامل «نیاز حسی» که از اثر گذاری موضوع بر شما سخن می‌گفت.<br>این سومین فاکتور از مجموعه تعیین کننده «هماهنگی حسی» است که درکنار علاقه و نیاز حسی، چهارچوب رابطه شما با موضوع را شکل می‌دهد. خوب البته سه چوب! در نهایت ،این فاکتور است که می‌گوید شما توانایی انجام این کار را دارید یا خیر. آیاحضور شما در این فعالیت خبر خوبی برای این کار محسوب می‌شود یا خیر.                    " ;
        $result[3][1][2] =  "توانایی حسی <span dir='ltr'>$percent</span>  درصد<br>متاسفانه توانایی شما برای فعالیت در مسیر این هدف کم است. این یعنی اینکه اصولا برای این کار چندان توانا نیستید. در حقیقت «ناتوانایی حسی» دارید و به عبارت دیگر این کار انتخاب شما نیست (عدم انتخاب) و به اندازه کافی از آن لذت نمی‌برید. اما ممکن است این ناتوانایی را به نداشتن اراده تعبیر کنید که درست نیست.<br>با فشار آوردن بر اراده و افزایش انگیزه‌ها و تاکید بر اهمیت هدف، ناتوانایی به توانایی تبدیل نمی‌شود تنها منجر به افزایش استرس می‌شود.موضوع ربطی به اراده ندارد." ;
        $result[3][1][3] =  "همان طور که گفته شد توانایی شما برای فعالیت در مسیر این هدف کم است و شما برای این کار چندان توانا نیستید. البته من متوجه هستم که این خبر ممکن است ناخوشایند و زیادی رک باشد. اما به عنوان دوست و مشاور شما این صراحت را لازم می‌دانم. هرچه باشد شما می‌خواهید وقت قابل توجه‌ای را صرف رسیدن به این هدف کنید. هدفی که درحال حاضر برای آن مناسب نیستید.<br> می‌توانم بگویم اثر مثبت اندکی بر این کار دارید و اگر اجبارهای بیرونی وجود نداشته باشند چنین فعالیت‌هایی در بسیاری از مواقع انتخاب موجودیت حسی شمانیست. مکانیزم تصمیم گیری در شما انجام چنین فعالیتی را مشتاقانه انتخاب نمی‌کند و تن دادن با بی میلی به آنها تجربه کاملی نیست. خیلی وقت‌ها از انجام این کار طفره می‌روید. این طفره رفتن خود را گاهی به‌شکل فراموشی نشان می‌دهد و گاهی به‌شکل به تعویق انداختن." ;
        $result[3][1][4] =  "با بررسی که انجام شد متوجه شدید که این کار انتخاب شما نیست و به اندازه کافی از آن لذت نمی‌برید. این موضوعی است که باید حل شود.اما چگونه؟<br>اگر مصر به حرکت در این مسیر هستید باید رابطه شما با این فعالیت از درون متحول شود. مکالمات ذهنی، بینش‌ها و نوع نگاه شما به ارزش، اهمیت، فایده و لذت این فعالیت( و نه هدف) اساساً نیاز به تغییر دارد.<br> توصیه می‌کنم پیش از اینکه بخواهید در این مسیر پیشروی را آغاز کنید، وقت و انرژی خود راروی این تغییر سرمایه گذاری کنید. ولی به هرحال درصورت حفظ وضع موجود، باید گفت که شما فعلا چندان مناسب انجام این کار نیستید و می‌دانم این خبربدی است. پس یا هدف را بی خیال شوید و آن را رها کنید یا طبق روشی که گفتم اول خود را برای پیمودن مسیر آن مناسب کنید." ;
    }
    elseif($x >= 101  && $x < 203 ) {
        $result[3][1][1] =  "عامل «توانایی حسی» نشان می‌دهد شما چقدر می‌توانید بر این کار اثرگذار باشید. درست برعکس عامل «نیاز حسی» که از اثر گذاری موضوع بر شما سخن می‌گفت.<br>این سومین فاکتور از مجموعه تعیین کننده «هماهنگی حسی» است که درکنار علاقه و نیاز حسی، چهارچوب رابطه شما با موضوع را شکل می‌دهد. خوب البته سه چوب! در نهایت ،این فاکتور است که می‌گوید شما توانایی انجام این کار را دارید یا خیر. آیاحضور شما در این فعالیت خبر خوبی برای این کار محسوب می‌شود یا خیر." ;
        $result[3][1][2] =  "توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است. این یعنی اینکه شما برای این کار نسبتا توانا هستید. می‌توانم بگویم اثر مثبت بر این کار دارید و اگر اجبارهای بیرونی وجود نداشته باشند برخی از مواقع چنین فعالیت‌هایی خود به خود انتخاب موجودیت حسی شما هست." ;
        $result[3][1][3] =  "همان طور که گفته شد توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است و شما برای این کار نسبتا توانا هستید. <br>مکانیزم تصمیم گیری در شما انجام چنین فعالیتی را انتخاب می‌کند اما نه همیشه و بصورت مداوم. بنابراین بعضی وقت‌ها از انجام این کار طفره می‌روید. این طفره رفتن خود را گاهی به‌شکل فراموشی نشان می‌دهد و گاهی به‌شکل به تعویق انداختن.<br> زمان‌هایی که انجام این کار انتخاب موجودیت حسی شما نیست، ممکن است این عدم انتخاب را به نداشتن اراده تعبیر کنید که تعبیر درستی نیست. با فشار آوردن بر اراده و افزایش انگیزه‌ها و تاکید بر اهمیت هدف، ناتوانایی به توانایی تبدیل نمی‌شود تنها منجر به افزایش استرس می‌شود. موضوع ربطی به اراده ندارد. بعضی وقت‌ها این کار انتخاب شما نیست چون به اندازه کافی از آن لذت نمی‌برید یا بیش از حد از آن ناراحت هستید." ;
        $result[3][1][4] =  "با بررسی که انجام شد متوجه شدید که بعضی وقت‌ها این کار انتخاب شما نیست چون به اندازه کافی از آن لذت نمی‌برید یا بیش از حد از آن ناراحتی. این موضوعی است که باید حل شود.اما چگونه؟<br>اگر مصر به حرکت در این مسیر هستید باید رابطه شما با این فعالیت از درون بهتر شود. مکالمات ذهنی، بینش‌ها و نوع نگاه شما به ارزش ، اهمیت، فایده و لذت این فعالیت و نه هدف نیاز به بهبود دارند. توصیه می‌کنم وقت و انرژی خود را همزمان با پیشرفت در مسیر هدف، برروی این تغییر نیز سرمایه گذاری کنید." ;
    }
    elseif($x >= 203  && $x < 304 ) {
        $result[3][1][1] =  "عامل «توانایی حسی» نشان می‌دهد شما چقدر می‌توانید بر این کار اثرگذار باشید. درست برعکس عامل «نیاز حسی» که از اثر گذاری موضوع بر شما سخن می‌گفت.<br>این سومین فاکتور از مجموعه تعیین کننده «هماهنگی حسی» است که درکنار علاقه و نیاز حسی، چهارچوب رابطه شما با موضوع را شکل می‌دهد. خوب البته سه چوب! در نهایت ،این فاکتور است که می‌گوید شما توانایی انجام این کار را دارید یا خیر. آیاحضور شما در این فعالیت خبر خوبی برای این کار محسوب می‌شود یا خیر." ;
        $result[3][1][2] =  "توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است. خبر خوب اینکه شما برای این کار توانا هستید. می‌توانم بگویم بر این کار بطور محسوس اثر مثبت دارید و اگر اجبارهای بیرونی وجود نداشته باشند خیلی از مواقع چنین فعالیت‌هایی خود به خود انتخاب موجودیت حسی شما هست." ;
        $result[3][1][3] =  "همان طور که گفته شد توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است و شما برای این کار توانا هستید. <br>مکانیزم تصمیم گیری در شما انجام چنین فعالیتی را انتخاب می‌کند اما نه همیشه و بصورت مداوم. بنابراین گاهی از انجام این کار طفره می‌روید. این طفره رفتن خود را گاهی به‌شکل فراموشی نشان می‌دهد و گاهی به‌شکل به تعویق انداختن.<br>زمان‌هایی نه چندان زیاد خواهد بود که انجام این کار انتخاب موجودیت حسی شما نیست، اما ممکن است این عدم انتخاب را به نداشتن اراده تعبیر کنید که تعبیر درستی نیست. با فشار آوردن بر اراده و افزایش انگیزه‌ها و تاکید بر اهمیت هدف، ناتوانایی به توانایی تبدیل نمی‌شود تنها منجر به افزایش استرس می‌شود. موضوع ربطی به اراده ندارد. بعضی وقت‌ها این کار انتخاب شما نیست چون به اندازه کافی از آن لذت نمی‌برید یا بیش از حد از آن ناراحت هستید." ;
        $result[3][1][4] =  "با بررسی که انجام شد متوجه شدید که بعضی وقت‌ها این کار انتخاب شما نیست چون به اندازه کافی از آن لذت نمی‌برید یا بیش از حد از آن ناراحتی. این موضوعی است که باید حل شود.اما چگونه؟<br>اگر مصر به حرکت در این مسیر هستید باید رابطه شما با این فعالیت از درون از چیزی که در حال حاضر هست باز هم بهتر شود. مکالمات ذهنی، بینش‌ها و نوع نگاه شما به ارزش ، اهمیت، فایده و لذت این فعالیت امکان بهبود دارند.توصیه می‌کنم وقت و انرژی خود را همزمان با پیشرفت در مسیر هدف، برروی این تغییر نیز سرمایه گذاری کنید.<br>و در آخر دوباره این نکته مهم را یادآوری می‌کنم که درهر صورت شما برای انجام اینکار مناسب هستید." ;
    }
    elseif($x >= 304 && $x <= 505 && $A < 251) {
        $result[3][1][1] =  "عامل «توانایی حسی» نشان می‌دهد شما چقدر می‌توانید بر این کار اثرگذار باشید. درست برعکس عامل «نیاز حسی» که از اثر گذاری موضوع بر شما سخن می‌گفت.<br>این سومین فاکتور از مجموعه تعیین کننده «هماهنگی حسی» است که درکنار علاقه و نیاز حسی، چهارچوب رابطه شما با موضوع را شکل می‌دهد. خوب البته سه چوب! در نهایت ،این فاکتور است که می‌گوید شما توانایی انجام این کار را دارید یا خیر. آیاحضور شما در این فعالیت خبر خوبی برای این کار محسوب می‌شود یا خیر." ;
        $result[3][1][2] =  "توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است.خبر خوب اینکه شما برای این کارکاملا توانا هستید. می‌توانم بگویم بر این کار اثر مثبت زیادی دارید و اگر اجبارهای بیرونی وجود نداشته باشند بیشتر مواقع چنین فعالیت‌هایی خود به خود انتخاب موجودیت حسی شما هست." ;
        $result[3][1][3] =  "همان طور که گفته شد توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است و شما برای این کارکاملا توانا هستید. <br>مکانیزم تصمیم گیری در شما انجام چنین فعالیتی را انتخاب می‌کند اما نه همیشه و بصورت مداوم. بنابراین گاهی از انجام این کار طفره می‌روید. این طفره رفتن خود را گاهی به‌شکل فراموشی نشان می‌دهد و گاهی به‌شکل به تعویق انداختن.<br>این توانایی اگرچه به خودی خود نکته مثبتی محسوب می‌شود اما در این مورد متاسفانه بیشتر ناشی از استرس است تا لذت بردن از خود فعالیت. دردمندی شما از انجام ندادن آنها عامل اصلی این توانایی است.بنابراین زمان‌هایی خواهد بود که انجام این کار انتخاب موجودیت حسی شما نیست، اما ممکن است این عدم انتخاب را به نداشتن اراده تعبیر کنید که تعبیر درستی نیست. با فشار آوردن بر اراده و افزایش انگیزه‌ها و تاکید بر اهمیت هدف، ناتوانایی به توانایی تبدیل نمی‌شود تنها منجر به افزایش استرس می‌شود. موضوع ربطی به اراده ندارد. بعضی وقت‌ها این کار انتخاب شما نیست چون به اندازه کافی از آن لذت نمی‌برید یا بیش از حد از آن ناراحت هستید." ;
        $result[3][1][4] =  "با بررسی که انجام شد متوجه شدید که بعضی وقت‌ها این کار انتخاب شما نیست چون به اندازه کافی از آن لذت نمی‌برید یا بیش از حد از آن ناراحتی. این موضوعی است که باید حل شود.اما چگونه؟<br> اگر مصر به حرکت در این مسیر هستید باید رابطه شما با این فعالیت از درون بهتر شود. مکالمات ذهنی، بینش‌ها و نوع نگاه شما به ارزش ، اهمیت، فایده و لذت و درد این فعالیت‌ها (و نه هدف) نیاز به بهبودی دارد. توصیه می‌کنم وقت و انرژی خود را همزمان با پیشرفت در مسیر هدف، برروی این تغییر نیز سرمایه گذاری کنید. <br> درهر صورت اگرچه انجام این کار شاید چندان برای شما مناسب نباشد اما شما برای انجام این کار کاملا مناسب هستید. خوش به حال کار!" ;
    }
    elseif($x >= 304 && $x <= 505 && $A > 250) {
        $result[3][1][1] =  "عامل «توانایی حسی» نشان می‌دهد شما چقدر می‌توانید بر این کار اثرگذار باشید. درست برعکس عامل «نیاز حسی» که از اثر گذاری موضوع بر شما سخن می‌گفت.<br>این سومین فاکتور از مجموعه تعیین کننده «هماهنگی حسی» است که درکنار علاقه و نیاز حسی، چهارچوب رابطه شما با موضوع را شکل می‌دهد. خوب البته سه چوب! در نهایت ،این فاکتور است که می‌گوید شما توانایی انجام این کار را دارید یا خیر. آیاحضور شما در این فعالیت خبر خوبی برای این کار محسوب می‌شود یا خیر." ;
        $result[3][1][2] =  "خوشبختانه توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است.این یعنی اینکه شما برای این کارکاملا توانا هستید. می‌توانم بگویم بر این کار اثر مثبت زیادی دارید و اگر اجبارها وضرورت بیرونی وجود نداشته باشند بیشتر مواقع چنین فعالیت‌هایی خود به خود انتخاب موجودیت حسی شما هست." ;
        $result[3][1][3] =  "همان طور که گفته شد توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است و شما برای این کارکاملا توانا هستید.<br>مکانیزم تصمیم گیری در شما انجام چنین فعالیتی را انتخاب می‌کند اما نه همیشه و بصورت مداوم. بنابراین گاهی از انجام این کار طفره می‌روید. این طفره رفتن خود را گاهی به‌شکل فراموشی نشان می‌دهد و گاهی به‌شکل به تعویق انداختن. <br>خوشبختانه بخش مهمی‌ازتوانایی شما بخاطر رابطه خوب حسی است که با انجام کار دارید تا بخاطر استرس نسبت به انجام کار.شما از انجام این کار لذت می‌برید و همین شما را توانا می‌کند. پس از صمیم قلب تبریک می‌گویم.بنابراین زمان‌های کمی‌خواهد بود که انجام این کار انتخاب موجودیت حسی شما نیست.البته بعضی وقت‌ها این کار انتخاب شما نیست چون گاهی به اندازه کافی از آن لذت نمی‌برید یا بیش از حد از آن ناراحت هستید." ;
        $result[3][1][4] =  "مکالمات ذهنی، بینش‌ها و نوع نگاه شما به ارزش ، اهمیت، فایده و لذت و درد این فعالیت (و نه هدف) در مجموع خوب است. توصیه می‌کنم همزمان با پیشرفت در مسیر هدف، این مکالمات را همچنان خوب نگه دارید.<br>درهر صورت انجام این کار هم برای شما مناسب است و هم شما برای انجام این کار کاملا مناسب هستید. خوش به حال خودت و کار!" ;
    }
    elseif($x > 505 && $x <= 805 && $A < 251) {
        $result[3][1][1] =  "عامل «توانایی حسی» نشان می‌دهد شما چقدر می‌توانید بر این کار اثرگذار باشید. درست برعکس عامل «نیاز حسی» که از اثر گذاری موضوع بر شما سخن می‌گفت.<br>این سومین فاکتور از مجموعه تعیین کننده «هماهنگی حسی» است که درکنار علاقه و نیاز حسی، چهارچوب رابطه شما با موضوع را شکل می‌دهد. خوب البته سه چوب! در نهایت ،این فاکتور است که می‌گوید شما توانایی انجام این کار را دارید یا خیر. آیاحضور شما در این فعالیت خبر خوبی برای این کار محسوب می‌شود یا خیر." ;
        $result[3][1][2] =  "توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است.این یعنی اینکه شما برای این کار بسیار توانا هستید. می‌توانم بگویم بر این کار اثر مثبت زیادی دارید وحتی اگر اجبارها وضرورت بیرونی وجود نداشته باشند بیشتر مواقع چنین فعالیت‌هایی خود به خود انتخاب موجودیت حسی شما هست." ;
        $result[3][1][3] =  "همان طور که گفته شد توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است و شما برای این کار بسیار توانا هستید. <br>مکانیزم تصمیم گیری در شما انجام چنین فعالیتی را انتخاب می‌کند اما نه همیشه و بصورت مداوم. بنابراین گاهی از انجام این کار طفره می‌روید. این طفره رفتن خود را گاهی به‌شکل فراموشی نشان می‌دهد و گاهی به‌شکل به تعویق انداختن. <br>این توانایی اگرچه به خودی خود نکته مثبتی محسوب می‌شود اما در این مورد متاسفانه بیشتر از سر استرس است تا لذت بردن از خود فعالیت.دردمندی شدید شما از انجام ندادن آنها عامل اصلی این توانایی است. استرس شما بقدری زیاد است که نمی‌توان انتظار درخشش وموفقیتی متناسب با میزان وقت و انرژی که صرف می‌کنید داشت. بنابراین توانایی شما برای انجام کار به معنی توانایی شما برای به سرانجام رساندن آن نیست.این فقط نشان می‌دهد موجودت حسی شما برای انتخاب این فعالیت و تن دادن به آن مشکلی ندارد.<br> بنابراین زمان‌هایی خواهد بود که انجام این کارانتخاب موجودیت حسی شما نیست، اما ممکن است این عدم انتخاب را به نداشتن اراده تعبیر کنید که تعبیر درستی نیست. با فشار آوردن بر اراده و افزایش انگیزه‌ها و تاکید بر اهمیت هدف ناتوانایی به توانایی تبدیل نمی‌شود تنها منجر به افزایش استرس می‌شود.موضوع ربطی به اراده ندارد. بعضی وقت‌ها این کار انتخاب شما نیست چون به اندازه کافی از آن لذت نمی‌برید یا بیش از حد از آن ناراحت هستید." ;
        $result[3][1][4] =  "با بررسی که انجام شد متوجه شدید که بعضی وقت‌ها این کار انتخاب شما نیست چون به اندازه کافی از آن لذت نمی‌برید یا بیش از حد از آن ناراحتی. این موضوعی است که باید حل شود.اما چگونه؟<br>این موضوعی است که باید حل شود. اگر مصر به حرکت در این مسیر هستید باید رابطه شما با این فعالیت از درون بهتر شود.مکالمات ذهنی، بینش‌ها و نوع نگاه شما به ارزش ، اهمیت، فایده و لذت و درد این فعالیت (و نه هدف) نیاز به بهبود دارند. توصیه می‌کنم همزمان با پیشرفت در مسیر هدف،وقت وانرژی خود راروی این تغییر نیز سرمایه گذاری کنید.<br>درهر صورت اگرچه انجام این کار برای شما مناسب نباشد اما شما برای انجام اینکار مناسب هستید. پس فقط خوش به حال کار!" ;
    }
    elseif($x > 505 && $x <= 805 && $A > 250) {
        $result[3][1][1] =  "عامل «توانایی حسی» نشان می‌دهد شما چقدر می‌توانید بر این کار اثرگذار باشید. درست برعکس عامل «نیاز حسی» که از اثر گذاری موضوع بر شما سخن می‌گفت.<br>این سومین فاکتور از مجموعه تعیین کننده «هماهنگی حسی» است که درکنار علاقه و نیاز حسی، چهارچوب رابطه شما با موضوع را شکل می‌دهد. خوب البته سه چوب! در نهایت ،این فاکتور است که می‌گوید شما توانایی انجام این کار را دارید یا خیر. آیاحضور شما در این فعالیت خبر خوبی برای این کار محسوب می‌شود یا خیر." ;
        $result[3][1][2] =  "خوشبختانه توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است.این یعنی اینکه شما برای این کار بسیار توانا هستید. می‌توانم بگویم بر این کار اثر مثبت زیادی دارید وحتی اگر اجبارها وضرورت بیرونی وجود نداشته باشند بیشتر مواقع چنین فعالیت‌هایی خود به خود انتخاب موجودیت حسی شما هست." ;
        $result[3][1][3] =  "همان طور که گفته شد توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است و شما برای این کار بسیار توانا هستید.<br>مکانیزم تصمیم گیری در شما انجام چنین فعالیتی را انتخاب می‌کند اما نه همیشه و بصورت مداوم. بنابراین گاهی از انجام این کار طفره می‌روید. این طفره رفتن خود را گاهی به‌شکل فراموشی نشان می‌دهد و گاهی به‌شکل به تعویق انداختن.<br>خوشبختانه بخش مهمی‌از توانایی شما بخاطر رابطه خوب حسی است که با انجام کار دارید اگرچه استرس شما برای انجام این کار هم قابل توجه است. بنابراین زمان‌های کمی‌خواهد بود که انجام این کارانتخاب موجودیت حسی شما نیست،البته، بعضی وقت‌ها این کار انتخاب شما نیست چون گاهی به اندازه کافی از آن لذت نمی‌برید یا بیش از حد از آن ناراحت هستید. مکالمات ذهنی، بینش‌ها و نوع نگاه شما به ارزش ، اهمیت، فایده و لذت و درد این فعالیت (و نه هدف) در مجموع عالی است." ;
        $result[3][1][4] =  "توصیه می‌کنم همزمان با پیشرفت در مسیر هدف، مکالمات ذهنی خود را همچنان خوب نگه دارید، (منظور مکالماتی است در ارتباط با مجموعه فعالیت‌هایی که برای رسیدن به هدف لازم است ) و حتما تلاش کنید استرس انجام کار را کاهش دهید.<br>درهر صورت انجام این کار هم برای شما مناسب است و هم شما برای انجام اینکار کاملا مناسب هستید. خوش به حال خودت و کار!" ;
    }
    elseif($x > 805 && $x <= 1210 ) {
        $result[3][1][1] =  "عامل «توانایی حسی» نشان می‌دهد شما چقدر می‌توانید بر این کار اثرگذار باشید. درست برعکس عامل «نیاز حسی» که از اثر گذاری موضوع بر شما سخن می‌گفت. این سومین فاکتور از مجموعه تعیین کننده «هماهنگی حسی» است که درکنار علاقه و نیاز حسی، چهارچوب رابطه شما با موضوع را شکل می‌دهد. خوب البته سه چوب! در نهایت ،این فاکتور است که می‌گوید شما توانایی انجام این کار را دارید یا خیر. آیاحضور شما در این فعالیت خبر خوبی برای این کار محسوب می‌شود یا خیر." ;
        $result[3][1][2] =  "خوشبختانه توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است.این یعنی اینکه شما برای این کار زیادی توانا هستید وحتی اگر اجبارها وضرورت بیرونی وجود نداشته باشند بیشتر مواقع چنین فعالیت‌هایی خود به خود انتخاب موجودیت حسی شما هست." ;
        $result[3][1][3] =  "همان طور که گفته شد توانایی شما برای فعالیت در مسیر این هدف <span dir='ltr'>$percent</span>  درصد است و شما برای این کار زیادی توانا هستید. <br>مکانیزم تصمیم گیری در شما انجام چنین فعالیتی را شدیدا انتخاب می‌کند. اما پیش از اینکه ذوق زده شوید لازم است نکته مهمی‌را یادآور شوم . دقت کنید: این توانایی اگرچه به خودی خود نکته مثبتی محسوب می‌شود اما در این مورد متاسفانه بیشتر ناشی از استرس است تا لذت بردن از خود فعالیت.دردمندی شدید شما از انجام ندادن آنها عامل اصلی این توانایی است. این جا مقدار زیادی مقداری زیادی استرس و نگرانی از انجام نشدن کار وجود دارد.استرس شما بقدری زیاد است که نمی‌توان انتظار درخشش وموفقیتی متناسب با میزان وقت و انرژی که صرف می‌کنید داشت. بنابراین توانایی شما برای انجام کار به معنی توانایی شما برای به سرانجام رساندن آن نیست.این فقط نشان می‌دهد موجودت حسی شما خود را برای انتخاب این فعالیت و تن دادن به آن مجبور می‌بیند.<br>بنابراین زمان‌هایی خواهد بود که انجام این کارانتخاب موجودیت حسی شما نیست، اما ممکن است این عدم انتخاب را به نداشتن اراده تعبیر کنید که تعبیر درستی نیست. با فشار آوردن بر اراده و افزایش انگیزه‌ها و تاکید بر اهمیت هدف، ناتوانایی به توانایی تبدیل نمی‌شود تنها منجر به افزایش استرس می‌شود.موضوع ربطی به اراده ندارد. بعضی وقت‌ها این کار انتخاب شما نیست چون بیش از حد از انجام نشدن آن ناراحت هستید." ;
        $result[3][1][4] =  "با بررسی که انجام شد متوجه شدید که بعضی وقت‌ها این کار انتخاب شما نیست چون بیش از حد از انجام نشدن آن ناراحت هستید. این موضوعی است که باید حل شود.اما چگونه؟<br>اگر مصر به حرکت در این مسیر هستید باید رابطه شما با این فعالیت از درون بهتر شود. مکالمات ذهنی، بینش‌ها و نوع نگاه شما به اهمیت، فایده ، ضرر و درد عدم انجام این فعالیت نیاز به بهبود دارند.<br> توصیه می‌کنم همزمان با پیشرفت در مسیر هدف، وقت وانرژی خود را روی این تغییر نیز سرمایه گذاری کنید. درهر صورت اگرچه انجام این کار برای شما با هزینه درونی قابل توجه همراه است اما شما برای انجام این کار مناسب هستید. پس فقط خوش به حال کار!" ;
    }
//////////////اعتماد به نفس و خودباوری///////////////////
/////////////// (A+D)-(B+C) ///////////////////
    $x = ($A + $D)- $B ;
    $percent = round(($x * 100) / $percentMaxRange, 0);
    if($x >= -605 && $x < 405 ) {
        //$percent =round(((-1*$x)*100)/$percentMaxRange,0);
        $result[3][2][1] = "انجام این فعالیت‌ها اصلا در شما اعتماد به نفس ایجاد نمی‌کند. درواقع باید بگویم بشدت بر اعتماد به‌نفس شما اثر منفی می‌گذارد و باعث می‌شود احساس ناتوانی و ضعف اراده به شما دست دهد. البته همانطور که قبلا هم توضیح داده بودم این برداشت درستی نیست. تنها دلیل ناتوانایی شما بی‌میلی موجودیت حسی شما است و عدم انتخاب‌هایی که اصولا خارج از اراده شما قرار دارد. اما خوب شما به هرحال اراده خود را قضاوت خواهید کرد و این قضاوت در این مورد واقعا ناجوانمردانه بد خواهد بود." ;
    }
    elseif($x >= -405 && $x < 0 ) {
        //$percent =round(((-1*$x)*100)/$percentMaxRange,0);
        $result[3][2][1] = "انجام این فعالیت‌ها اصلا در شما اعتماد به نفس ایجاد نمی‌کند. درواقع باید بگویم بر اعتماد به‌نفس شما اثر منفی هم می‌گذارد و باعث می‌شود احساس ناتوانی و ضعیف بودن اراده به شما دست دهد.البته همانطور که قبلا هم توضیح داده بودم این برداشت درستی نیست. تنها دلیل ناتوانایی شما بی میلی موجودیت حسی شما است و عدم انتخاب‌هایی که اصولا خارج از اراده شما قرار دارد. اما خوب شما به هرحال اراده خود را قضاوت خواهید کرد و این قضاوت در این مورد بد خواهد بود." ;
    }
    elseif($x >= 0  && $x < 101 ) {
        $result[3][2][1] = "انجام این فعالیت‌ها در شما اعتماد به نفس بسیار کمی‌را ایجاد می‌کند. همانطور که برای انجام آن اعتماد به‌نفس ناچیزی خواهید داشت. این باعث می‌شود اراده خود را چندان جدی نگیرید. البته همانطور که قبلا هم توضیح داده بودم این برداشت درستی نیست. تنها دلیل کم توانایی شما بی میلی موجودیت حسی شما است و عدم انتخاب‌هایی که اصولا خارج از اراده شما قرار دارد. اما خوب شما به هرحال اراده خود را قضاوت خواهید کرد و این قضاوت در این مورد واقعا زیاد خوب نخواهد بود." ;
    }
    elseif($x >= 101  && $x < 203 ) {
        $result[3][2][1] = "انجام این فعالیت‌ها در شما اعتماد به نفس ایجاد می‌کند البته نه خیلی زیاد. همانطور که برای انجام آن اعتماد به نفس نسبی هم خواهید داشت. این کمک اندکی می‌کند اراده خود را باور کنید." ;
    }
    elseif($x >= 203  && $x < 304 ) {
        $result[3][2][1] = "انجام این فعالیت‌ها در شما اعتماد به نفس نسبتا خوبی ایجاد می‌کند.البته نه خیلی زیاد. همانطور که برای انجام آن اعتماد به نفس تقریبا خوبی هم خواهید داشت. این تاحدی کمک می‌کند اراده خود را باور کنید." ;
    }
    elseif($x >= 304  && $x <= 405 ) {
        $result[3][2][1] = "انجام این فعالیت‌ها در شما اعتماد به نفس خوبی ایجاد می‌کند حتی می‌توان گفت تقریبا زیاد. همانطور که برای انجام آن اعتماد به نفس خوبی هم خواهید داشت. این کمک می‌کند اراده خود را باور کنید." ;
    }
    elseif($x > 405  && $x <= 505 ) {
        $result[3][2][1] = "انجام این فعالیت‌ها در شما اعتماد به نفس بسیار خوبی ایجاد می‌کند. همانطور که برای انجام آن اعتماد اعتماد به نفس بسیار خوبی هم خواهید داشت. این کمک خوبی می‌کند اراده خود را باورکنید." ;
    }
    elseif($x > 505  && $x <= 850 ) {
        $result[3][2][1] = "انجام این فعالیت‌ها در شما اعتماد به نفس عالی ایجاد می‌کند. همانطور که برای انجام آن اعتماد به نفس بسیار زیادی هم خواهید داشت. اگرچه این مساله کمک خوبی می‌کند تا اراده خود را باور کنید اما لازم است توجه داشته باشید که بخش نه چندان زیادی از احساس اعتماد به نفس شما، ممکن است واقعی نباشد. اگرچه بخش بیشتر آن واقعی است." ;
    }
    elseif($x > 850  && $x <= 1210 ) {
        $result[3][2][1] = "انجام این فعالیت‌ها در شما اعتماد به نفس زیادی خوبی را ایجاد می‌کند. همانطور که برای انجام آن اعتماد به نفس خیلی زیادی هم خواهید داشت. اگرچه این کمک خوبی می‌کند تا اراده خود را باور کنید اما لازم است توجه داشته باشید که بخشی از احساس اعتماد به نفس شما، کاذب است و ناشی از هیجان زدگی است. اگرچه همچنان بخش مهمی‌از آن واقعی است. تذکر این نکته از این جهت لازم بود که مراقب باشید، ممکن است در این فعالیت تصمیم‌هایی بگیرید و وعده‌ها و تعهد‌هایی را به خود و دیگران بدهید که در واقع فراتر از توان واقعی شماست. فقط هشیار باشید هر توانی را که برای انجام کار حس می‌کنید، توان واقعی شما تا حدی کمتر از آن است." ;
    }
//////////////   پشتکار و پایداری   ///////////////////
/////////////// (A+D)-(B+C) ///////////////////
    $x = ($A + $D)- ($B + $C) ;
    $percent = round(($x * 100) / $percentMaxRange, 0);
    if($x >= -1210 && $x < -850 ) {
        //$percent =round(((-1*$x)*100)/$percentMaxRange,0);
        $result[3][3][1] = "آنچه که از آن به عنوان پشتکار در کار یاد می‌شود چندان هم مربوط به ویژگی‌های شما نیست بلکه مربوط به ویژگی‌های رابطه موجودیت حسی شما با کار است و مکانیزمی‌ غیرارادی روی آن عمل می‌کند.<br>میزان پشتکار نشان می‌دهد که برای تدوام مستمر این فعالیت تاچه حدی می‌توانید روی موجودیت حسی خودت حساب کنید؟<br>در این مورد پشتکار شما <span dir='ltr'>$percent</span>  درصد است که بی رودربایستی یعنی افتضاح.<br>خوب اصلا روی استمرار و پشتکار خود حساب نکنید. هر بار و هر روز برای انجام دادن این فعالیت باید از نیروی اراده خودآگاه استفاده کنید. اگر شرایط بیرونی شما را وادار به انجام این کار نکند از هر بهانه ای برای فرار از آن استفاده خواهید کرد و هر فرصت جایگزینی بشدت مورد تمایل قرار خواهد گرفت. <br>خلاصه اینکه با وضع درونی موجود، بشدت برای پیمودن این مسیر متزلزل و کاملا ناپایدار خواهید بود." ;
    }
    elseif($x >= -850 && $x < 0 ) {
        //$percent =round(((-1*$x)*100)/$percentMaxRange,0);
        $result[3][3][1] = "آنچه که از آن به عنوان پشتکار در کار یاد می‌شود چندان هم مربوط به ویژگی‌های شما نیست بلکه مربوط به ویژگی‌های رابطه موجودیت حسی شما با کار است و مکانیزمی‌ غیرارادی روی آن عمل می‌کند.<br>میزان پشتکار نشان می‌دهد که برای تدوام مستمر این فعالیت تاچه حدی می‌توانید روی موجودیت حسی خودت حساب کنید؟<br>در این مورد پشتکار شما <span dir='ltr'>$percent</span>  درصد است که هیچ خوب نیست. پس اصلا روی استمرار و پشتکار خود حساب نکنید. هر بار و هر روز برای انجام دادن این فعالیت باید از نیروی اراده خودآگاه استفاده کنید. اگر شرایط بیرونی شما را وادار به انجام این کار نکند از هر بهانه ای برای فرار از آن استفاده خواهید کرد و هر فرصت جایگزینی مورد تمایل قرار خواهد گرفت. <br>خلاصه اینکه با وضع درونی موجود، بشدت برای پیمودن این مسیر ناپایدار به نظر خواهید رسید." ;
    }
    elseif($x >= 0  && $x <= 150 ) {
        $result[3][3][1] = "آنچه که از آن به عنوان پشتکار در کار یاد می‌شود چندان هم مربوط به ویژگی‌های شما نیست بلکه مربوط به ویژگی‌های رابطه موجودیت حسی شما با کار است و مکانیزمی‌ غیر غیرارادی روی آن عمل می‌کند.<br>میزان پشتکار نشان می‌دهد که برای تدوام مستمر این فعالیت تاچه حدی می‌توانید روی موجودیت حسی خودت حساب کنید؟<br>در این مورد پشتکار شما <span dir='ltr'>$percent</span>  درصد است که زیاد خوب نیست. پس روی استمرار و پشتکار خود زیاد حساب نکنید. هر بار و هر روز برای انجام دادن این فعالیت باید از نیروی اراده خودآگاه استفاده کنید. اگر شرایط بیرونی شما را وادار به انجام این کار نکند بهانه‌های زیادی برای انجام ندادن پیدا خواهید کرد.<br>خلاصه اینکه با وضع درونی موجود، بشدت برای پیمودن این مسیرکمی‌ناپایدار خواهید بود." ;
    }
    elseif($x > 150  && $x <= 304 ) {
        $result[3][3][1] = "آنچه که از آن به عنوان پشتکار در کار یاد می‌شود چندان هم مربوط به ویژگی‌های شما نیست بلکه مربوط به ویژگی‌های رابطه موجودیت حسی شما با کار است و مکانیزمی‌ غیرارادی روی آن عمل می‌کند.<br>میزان پشتکار نشان می‌دهد که برای تدوام مستمر این فعالیت تاچه حدی می‌توانید روی موجودیت حسی خودت حساب کنید؟<br>در این مورد پشتکار شما <span dir='ltr'>$percent</span>  درصد است که بد نیست. پس می‌توانید روی استمرار و پشتکار خود حساب کنید. اگرچه بعضی وقت‎‌ها برای انجام دادن این فعالیت باید از نیروی اراده خودآگاه استفاده کنید.<br>خلاصه اینکه با وضع درونی موجود، برای پیمودن این مسیر تا حدی پایدار به نظر خواهید رسید." ;
    }
    elseif($x > 304  && $x <= 505 ) {
        $result[3][3][1] = "آنچه که از آن به عنوان پشتکار در کار یاد می‌شود چندان هم مربوط به ویژگی‌های شما نیست بلکه مربوط به ویژگی‌های رابطه موجودیت حسی شما با کار است و مکانیزمی‌ غیرارادی روی آن عمل می‌کند.<br>میزان پشتکار نشان می‌دهد که برای تدوام مستمر این فعالیت تاچه حدی می‌توانید روی موجودیت حسی خودت حساب کنید؟<br>در این مورد پشتکار شما <span dir='ltr'>$percent</span>  درصد است که در‌واقع خوب است. پس می‌توانید روی استمرار و پشتکار خود کاملا حساب کنید. به ندرت ممکن است لازم شود برای انجام دادن این فعالیت از نیروی اراده خودآگاه استفاده کنید.<br>تا زمانی که وضع درونی و مکالمه‌های ذهنی شما اینگونه باشد، برای پیمودن این مسیر، پایداری نشان خواهید داد." ;
    }
    elseif($x > 505  && $x <= 850 ) {
        $result[3][3][1] = "آنچه که از آن به عنوان پشتکار در کار یاد می‌شود چندان هم مربوط به ویژگی‌های شما نیست بلکه مربوط به ویژگی‌های رابطه موجودیت حسی شما با کار است و مکانیزمی‌ غیرارادی روی آن عمل می‌کند.<br>میزان پشتکار نشان می‌دهد که برای تدوام مستمر این فعالیت تاچه حدی می‌توانید روی موجودیت حسی خودت حساب کنید؟<br>در این مورد پشتکار شما <span dir='ltr'>$percent</span>  درصد است که می‌توان گفت عالی است. پس می‌توانید روی استمرار و پشتکار خود به شدت حساب کنید.بسیار به ندرت ممکن است لازم شود برای انجام دادن این فعالیت از نیروی اراده خودآگاه استفاده کنید.<br>تا زمانی که وضع درونی و مکالمه‌های ذهنی شما اینگونه باشد، برای پیمودن این مسیر، شما کاملا پایدار به نظرخواهید آمد." ;
    }
    elseif($x > 850  && $x <= 1210 ) {
        $result[3][3][1] = "آنچه که از آن به عنوان پشتکار در کار یاد می‌شود چندان هم مربوط به ویژگی‌های شما نیست بلکه مربوط به ویژگی‌های رابطه موجودیت حسی شما با کار است و مکانیزمی‌ غیرارادی روی آن عمل می‌کند.<br>میزان پشتکار نشان می‌دهد که برای تدوام مستمر این فعالیت تاچه حدی می‌توانید روی موجودیت حسی خودت حساب کنید؟<br>در این مورد پشتکار شما $percent درصد است که غیرطبیعی زیاد است. پس می‌توانید روی استمرار و پشتکار خود به شدت حساب کنید. بسیار به ندرت ممکن است لازم شود برای انجام دادن این فعالیت از نیروی اراده خودآگاه استفاده کنید.<br>تا زمانی که وضع درونی و مکالمه‌های ذهنی شما اینگونه باشد، برای پیمودن این مسیر، زیادی پایدار خواهید بود. یعنی درحد گیر و اعصاب خرد کن! البته ببخشید‌ها!" ;
    }

}
?>
<style>
    .card-header{
        height: 50px !important;
        margin-right: 0px;
        padding-right: 0px;
    }

    .list-group-item h5 {
        margin-right: 25px;
    }
    .list-group-item h6 {
        margin-right: 5px;
        margin-bottom: 20px;
    }
    .list-group-item p {
        margin-right: 25px;
        margin-left: 5px;
    }
    .card-header h5{
        margin-right: 5px;
        padding-right: 0px;
    }
</style>
<script>
    var categoryLinks = {<?php echo $labels; ?>};
</script>
<main>
    <div id="form_container" style="text-align: center;direction: rtl;">
        <a href="#" class="text-dark text-left pull-left text-white" id="printText" onclick="javascript:window.print()" title="چاپ">
            <i class="fa fa-print fa-2x text-center text-white" style="margin-top: 7px;margin-left: 5px;"></i>
            <span class="text-white print-text">
            چاپ گزارش
            </span>
        </a>
<!--        <br/>-->
        <h4 class="card-header bg-primary radius_border text-white" >
                            <span class="text-right" dir="rtl">
                               <i class="fa fa-edit"></i> <?php echo $topicType ; ?>
                            </span>
                            <span class="text-right" dir="rtl">
                               <i class="fa fa-edit"></i> <?php echo $list['list']['topic']['title'] ;?>
                            </span>
        </h4>



        <div id="wizard_container">

            <div class="row mb-4">

                <div class="col-md-6">

                    <h4 class="header-caption text-center mt-5" ><?php echo $approach1 ; ?></h4>

                    <span class="badge badge-info badge-pill mt-5" style="width: 40px;height: 40px;line-height: 40px ;background-color: rgb(8, 191, 71);"><?php echo $A; ?></span>
                    <span style="font-size:20px;font-weight: bold;">A</span>
                    <div class="mt-5" id="container1" ></div>
                    <script language="JavaScript">
                        Highcharts.chart('container1', {

                            chart: {
                                polar: true
                            },

                            credits: {
                                enabled: false
                            },

                            title: {
                                text: ''
                            },

                            subtitle: {
                                text: ''
                            },

                            pane: {
                                startAngle: -90
                            },

                            xAxis: {
                                tickmarkPlacement: 'on',
                                startOnTick: true,
                                tickInterval: 36,
                                min: 0,
                                max: 360,
                                labels: {
                                    formatter: function() {
                                        return categoryLinks[this.value] ;
                                    },
                                    rotation: 0,
                                    reserveSpace: false,
                                    y: 0,
                                    x: 0,
                                    style: {
                                        align: 'right',
                                        verticalAlign: 'middle',
                                        fontSize: '10pt',
                                        fontWeight: 'bold'
                                    }
                                },
                                offset: 39
                            },
                            yAxis: {
                                min: 0,
                                max: 81
                            },

                            plotOptions: {
                                series: {
                                    pointStart: 0,
                                    pointInterval: 36,
                                    lineWidth: 10,
                                    fillOpacity: 0.1,
                                    dataLabels: {
                                        enabled: true,
                                        verticalAlign:'middle',
                                        align:'center',
                                        inside: false
                                    }
                                },
                                column: {
                                    pointPadding: 0,
                                    groupPadding: 0
                                }
                            },

                            series: [{
                                type: 'column',
                                name: 'Value',
                                data: [<?php echo $data1 ?>],
                                pointPlacement: 'between'
                                ,showInLegend : false
                            }
                            ]
                        });
                    </script>
                    <span class="badge badge-info badge-pill" style="width: 40px;height: 40px;line-height: 40px;background-color: rgba(255, 0, 0, 0.64)"><?php echo $B ?></span>

                    <span style="font-size:20px;font-weight: bold;">B</span>
                </div>

                <div class="col-md-6">
                    <h4 class="header-caption text-center mt-5" ><?php echo $approach2; ?></h4>

                    <span class="badge badge-info badge-pill mt-5" style="width: 40px;height: 40px;line-height: 40px;background-color: rgba(255, 0, 0, 0.64);"><?php echo $C; ?></span>
                    <span style="font-size:20px;font-weight: bold;">C</span>
                    <div class="mt-5" id="container2"></div>
                    <script language="JavaScript">
                        Highcharts.chart('container2', {

                            chart: {
                                polar: true
                            },

                            credits: {
                                enabled: false
                            },

                            title: {
                                text: ''
                            },

                            subtitle: {
                                text: ''
                            },

                            pane: {
                                startAngle: -90
                            },

                            xAxis: {
                                tickmarkPlacement: 'on',
                                startOnTick: true,
                                tickInterval: 36,
                                min: 0,
                                max: 360,
                                labels: {
                                    formatter: function() {
                                        return categoryLinks[this.value] ;
                                    },
                                    rotation: 0,
                                    reserveSpace: false,
                                    y: 5,
                                    x: 0,
                                    style: {
                                        align: 'right',
                                        verticalAlign: 'middle',
                                        fontSize: '10pt',
                                        fontWeight: 'bold'
                                    }
                                },
                                offset: 39
                            },
                            yAxis: {
                                min: 0,
                                max: 81
                            },

                            plotOptions: {
                                series: {
                                    pointStart: 0,
                                    pointInterval: 36,
                                    lineWidth: 10,
                                    fillOpacity: 0.1,
                                    dataLabels: {
                                        enabled: true,
                                        verticalAlign:'middle',
                                        align:'center',
                                        inside: false
                                    }
                                },
                                column: {
                                    pointPadding: 0,
                                    groupPadding: 0
                                }
                            },

                            series: [{
                                type: 'column',
                                name: 'Value',
                                data: [<?php echo $data2 ?>],
                                pointPlacement: 'between'
                                ,showInLegend : false
                            }
                            ]
                        });
                    </script>
                    <span class="badge badge-info badge-pill" style="width: 40px;height: 40px;line-height: 40px;"></span><span class="badge badge-info badge-pill" style="width: 40px;height: 40px;line-height: 40px;background-color: rgb(8, 191, 71)"><?php echo $D ?></span>
                    <span style="font-size:20px;font-weight: bold;">D</span>
                </div>
            </div>

            <div class="row">
                <div class="col-md-12 mt-4 mb-4">
                    <div class="card">
                        <div class="card-header bg-transparent no-border">
                            <h5 class="text-center"><i class="fa fa-edit"></i>  با واگویه های فعلی شما در حال حاضر:</h5>
                        </div>
                    </div>
                </div>
                <div class="col-md-12 mt-4">
                    <div class="card">
                        <div class="card-header text-right bg-info text-white ">
                            <h5 class="text-white"><i class="fa fa-edit"></i> دوست داشتن حسی</h5>
                        </div>
                        <ul class="list-group">
                            <li class="list-group-item list-group-item-success text-right">
                                <h6>
                                    علاقه - شادی و نیروی پیش‌برنده مثبت
                                </h6>
                                <h5>
                                    تحلیل ابتدایی گراف
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['A'][1] ; ?>
                                </p>
                                <h5>
                                    نتیجه فعلی گراف برای شما
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['A'][2] ; ?>
                                </p>
                                <h5>
                                    چرا اینگونه است؟
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['A'][3] ; ?>
                                </p>
                                <h5>
                                    پاسخ ما
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['A'][4] ; ?>
                                </p>
                            </li>
                            <li class="list-group-item list-group-item-danger  text-right">
                                <h6>
                                    خشم - نیروی بازدارنده فعال
                                </h6>
                                <h5>
                                    تحلیل ابتدایی گراف
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['B'][1] ; ?>
                                </p>
                                <h5>
                                    نتیجه فعلی گراف برای شما
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['B'][2] ; ?>
                                </p>
                                <h5>
                                    چرا اینگونه است؟
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['B'][3] ; ?>
                                </p>
                                <h5>
                                    پاسخ ما
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['B'][4] ; ?>
                                </p>
                            </li>

                            <li class="list-group-item list-group-item-warning  text-right">
                                <h6>
                                    غم - نیروی بازدارنده پنهان
                                </h6>
                                <h5>
                                    تحلیل ابتدایی گراف
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['C'][1] ; ?>
                                </p>
                                <h5>
                                    نتیجه فعلی گراف برای شما
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['C'][2] ; ?>
                                </p>
                                <h5>
                                    چرا اینگونه است؟
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['C'][3] ; ?>
                                </p>
                                <h5>
                                    پاسخ ما
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['C'][4] ; ?>
                                </p>
                            </li>
                            <li class="list-group-item list-group-item-info text-right">
                                <h6>
                                    استرس - نیروی پیش برنده منفی
                                </h6>
                                <h5>
                                    تحلیل ابتدایی گراف
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['D'][1] ; ?>
                                </p>
                                <h5>
                                    نتیجه فعلی گراف برای شما
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['D'][2] ; ?>
                                </p>
                                <h5>
                                    چرا اینگونه است؟
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['D'][3] ; ?>
                                </p>
                                <h5>
                                    پاسخ ما
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[1]['D'][4] ; ?>
                                </p>
                            </li>

                        </ul>
                    </div>
                    <!--         Section2           -->
                    <div class="card">
                        <div class="card-header text-right bg-info text-white ">
                            <h5 class="text-white"><i class="fa fa-edit"></i> نیاز حسی</h5>
                        </div>
                        <ul class="list-group">
                            <li class="list-group-item list-group-item-success text-right">
                                <h6>
                                    رضایت - نیاز حسی به حرکت کردن
                                </h6>
                                <h5>
                                    نیاز حسی به حرکت در مسیر هدف و رضایت از آن
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[2][1][1] ; ?>
                                </p>
                                <h5>
                                    نتیجه فعلی گراف برای شما
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[2][1][2] ; ?>
                                </p>
                            </li>
                            <li class="list-group-item list-group-item-danger  text-right">
                                <h6>
نارضایتی - نیاز حسی به حرکت نکردن
                                </h6>
                                <h5>
                                    نیاز حسی به ترک فعالیت وحرکت نکردن به سمت هدف
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[2][2][1] ; ?>
                                </p>
                                <h5>
                                    نتیجه فعلی گراف برای شما
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[2][2][2] ; ?>
                                </p>
                            </li>

                            <li class="list-group-item list-group-item-warning  text-right">
                                <h6>
مقایسه نیازها
                                </h6>
                                <h5>
                                    خوب حالا بیا نیاز‌ها رو با هم مقایسه کنیم
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[2][3][1] ; ?>
                                </p>
                            </li>

                        </ul>
                    </div>
                    <!--         End Section2           -->
                    <!--         Section3           -->
                    <div class="card">
                        <div class="card-header text-right bg-info text-white ">
                            <h5 class="text-white"><i class="fa fa-edit"></i>
                                توانایی حسی
                            </h5>
                        </div>
                        <ul class="list-group">
                            <li class="list-group-item list-group-item-success text-right">
                                <h6>
                                    توانایی حسی - اثرگذاری شما
                                </h6>
                                <h5>
                                    توانایی حسی چیست؟
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[3][1][1] ; ?>
                                </p>
                                <h5>
                                    تحلیل ابتدایی گراف
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[3][1][2] ; ?>
                                </p>
                                <h5>
                                    نتیجه فعلی گراف برای شما
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[3][1][3] ; ?>
                                </p>
                                <h5>
                                    پیشنهاد ما
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[3][1][4] ; ?>
                                </p>
                            </li>
                            <li class="list-group-item list-group-item-danger  text-right">
                                <h6>
                                    اعتماد به نفس
                                </h6>
                                <h5>
خودباوری
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[3][2][1] ; ?>
                                </p>
                            </li>

                            <li class="list-group-item list-group-item-warning  text-right">
                                <h6>
پشتکار
                                </h6>
                                <h5>
پایداری
                                </h5>
                                <p class="text-justify">
                                    <?php echo $result[3][3][1] ; ?>
                                </p>
                            </li>

                        </ul>
                    </div>
                    <!--         End Section2           -->
                </div>
                <!--                --><?php //if($list['list']['topic']['topic_type']==1 || $list['list']['topic']['topic_type']==3 || $list['list']['topic']['topic_type']==4 || $list['list']['topic']['topic_type']==5 || $list['list']['topic']['topic_type']==6){ ?>
                <!--                    <div class="col-md-12 mt-4">-->
                <!--                        <div class="card">-->
                <!--                            <div class="card-header text-right bg-info text-white ">-->
                <!--                                <h5 class="text-white"> <i class="fa fa-edit"></i> نیاز حسی</h5>-->
                <!--                            </div>-->
                <!--                            --><?php
                //                            foreach($result[2] as $k=>$v) {
                //                                echo '
                //                                               <div class="card-body text-right text-justify border-bottom border-light">
                //                                                    ' . $v . '
                //                                                </div>';
                //                            }
                //                            ?>
                <!--                        </div>-->
                <!--                    </div>-->
                <!--                    -->
                <!--                --><?php //}
                //                ?>
            </div>

        </div>
    <!-- /Form_container -->
</main>
<!--<script language="JavaScript">-->
<!--    window.print();-->
<!--</script>-->