<link rel="stylesheet" href="<?php echo RELA_DIR . 'templates/' . CURRENT_SKIN; ?>/assets/css/all.css">
<link rel="stylesheet" href="<?php echo RELA_DIR . 'templates/' . CURRENT_SKIN; ?>/assets/css/brands.css">
<link rel="stylesheet" href="<?php echo RELA_DIR . 'templates/' . CURRENT_SKIN; ?>/assets/css/fontawesome.css">
<link rel="stylesheet" href="<?php echo RELA_DIR . 'templates/' . CURRENT_SKIN; ?>/assets/css/regular.css">
<link rel="stylesheet" href="<?php echo RELA_DIR . 'templates/' . CURRENT_SKIN; ?>/assets/css/svg-with-js.css">
<link rel="stylesheet" href="<?php echo RELA_DIR . 'templates/' . CURRENT_SKIN; ?>/assets/css/v4-shims.css">
<!--<script src='https://kit.fontawesome.com/a076d05399.js'></script>-->

<!--<i class="far fa-angry"></i>-->
<!--<i class="far fa-angry fa-2x"></i>-->
<!--<i class="far fa-angry fa-3x"></i>-->
<!--<i class="far fa-angry fa-4x" style="color:red;"></i>-->

<link href="<?php echo RELA_DIR .'templates/' . CURRENT_SKIN; ?>/assets/css/jQuery-plugin-progressbar.css" rel="stylesheet">
<script src="<?php echo RELA_DIR .'templates/' . CURRENT_SKIN; ?>/assets/js/jQuery-plugin-progressbar.js"></script>

<style>
    .rowcenter{
        border:2px solid #ccc;
        background-color:transparent;
        width: 95%!important;
        float:none;
        margin: 10px auto !important;
        padding: 10px;
    }
    .rowrow{
        border:2px solid #ccc;
        background-color:transparent;
        width:47%!important;
        margin-left: 24px;
        float:left
    }
    @media only screen and (max-width:767px) {
        .rowrow{
            border:2px solid #ccc;
            background-color:transparent;
            width: 95%!important;
            float:none;
            margin: 10px auto !important;
            padding: 10px;
        }
    }
    .modal-title{
        line-height:0 !important;
        margin-bottom:23px !important;
        height:0 !important;
        border-radius:0 !important;
        text-align:center !important;
        width: 100%;
        font-size: small;
    }
    .modal-header{
        border-radius:0 !important;
    }
    .btn{
        border-radius: 24px;
        font-size: small;
    }
    a.disabled {
        pointer-events: none;
        cursor: default;
    }
</style>
<?php
//echo '<pre>'; print_r($list['list']);
$arrayAnalyze = "";
//$arrayAnalyze .= "var objAnalyze = {
//    'row1' : {
//        'key1' : 'input',
//        'key2' : 'input',
//        'key3' : 'input',
//        'key4' : 'input'
//    }
//};";
$arrayAnalyze .= "var analyze = [[0,1,2,3],[0,1,2,3],[0,1,2,3],[0,1,2,3],[0,1,2,3],[0,1,2,3],[0,1,2,3]]; ";
$label1 = 'رضایت' ;
$label2 = 'خشم' ;
$label3 = 'غم' ;
$label4 = 'استرس' ;
$bgColor2 = 'rgba(255, 0, 0,0.4)' ;
$bgColor1 = 'rgba(14, 255, 0,0.4)' ;
if($list['list']['topic']['topic_type']==1){
    $topicType = 'فعالیت روزانه و رفتار در رابطه با ' ;
    $approach1 = 'انجام دادن' ;
    $approach2 = 'انجان ندادن' ;
}elseif($list['list']['topic']['topic_type']==3){
    $topicType = 'نتیجه نهایی(هدف) در رابطه با ' ;
    $approach1 = 'انجام دادن' ;
    $approach2 = 'انجان ندادن' ;
}elseif($list['list']['topic']['topic_type']==2){
    $topicType = 'رابطه کلی من با ' ;
    $approach1 = 'حس من درباره او' ;
    $approach2 = 'فکر من درباره حس او به من' ;
    $label1 = 'محبت' ;
    $label2 = 'خشم' ;
    $label3 = 'محبت' ;
    $label4 = 'استرس' ;
}
$degree = array(0,36,72,108,144,180,216,252,288,324) ;
$labels = '' ;
$data1 = '' ;
$data2 = '' ;
//echo'<pre>'; print_r($list['list']['score']);
$A = 0 ;
$B = 0 ;
$C = 0 ;
$D = 0 ;
foreach($list['list']['sensor'] as $k=>$v){
    $labels .= ','.$degree[$k].":'".$v['title']."'" ;
    if($v['sensor_type']==1) {
        if (isset($list['list']['score'][1][$v['id']])) {
            $data1 .= ',{ name:'."'".$v['title']."',color:'$bgColor1',y:". pow($list['list']['score'][1][$v['id']],2).'}';
            $A += pow($list['list']['score'][1][$v['id']],2) ;
        }
        if (isset($list['list']['score'][2][$v['id']])) {
            $data2 .= ',{ name:'."'".$v['title']."',color:'".($list['list']['topic']['topic_type']!=2?$bgColor2:$bgColor1)."',y:". pow($list['list']['score'][2][$v['id']],2).'}';
            $C += pow($list['list']['score'][2][$v['id']],2) ;
        }
    }
    if($v['sensor_type']==2){
        if (isset($list['list']['score'][1][$v['id']])) {
            $data1 .= ',{ name:'."'".$v['title']."',color:'$bgColor2',y:". pow($list['list']['score'][1][$v['id']],2).'}';
            $B += pow($list['list']['score'][1][$v['id']],2);
        }
        if(isset($list['list']['score'][2][$v['id']])) {
            $data2 .= ',{ name:'."'".$v['title']."',color:'".($list['list']['topic']['topic_type']!=2?$bgColor1:$bgColor2)."',y:". pow($list['list']['score'][2][$v['id']],2).'}';
            $D += pow($list['list']['score'][2][$v['id']],2);
        }
    }
}
$labels = substr($labels,1,strlen($labels)) ;
$data1 = substr($data1,1,strlen($data1)) ;
$data2 = substr($data2,1,strlen($data2)) ;
//echo $labels ;
//echo '$data1='.$data1 ;
//echo "A=$A,B=$B,C=$C,D=$D" ;
/////////////////////////// ANALYS //////////////////////////////////////
$range_one_hundred = array(1=>array('min'=>0,'max'=>101),2=>array('min'=>101,'max'=>203),3=>array('min'=>203,'max'=>304),4=>array('min'=>304,'max'=>405),5=>array('min'=>405,'max'=>505),6=>array('min'=>505,'max'=>605)) ;
$range_two_hundred = array(1=>array('min'=>10,'max'=>210),2=>array('min'=>210,'max'=>410),3=>array('min'=>410,'max'=>610),4=>array('min'=>610,'max'=>810),5=>array('min'=>810,'max'=>1210)) ;
$percentMaxRange = 405 ;
//$percentMaxRange = 605 ;

$r = 0 ;
$result = array(1=>array(),2=>array(),3=>array(),4=>array()) ;

$percentArray = array();
if($list['list']['topic']['topic_type']==1 || $list['list']['topic']['topic_type']==3 || $list['list']['topic']['topic_type']==4 || $list['list']['topic']['topic_type']==5 || $list['list']['topic']['topic_type']==6){
    //////////////// دوست داشتن حسی/////////////////////////////
    /////////////// A ///////////////////
    $percent =round(($A*100)/$percentMaxRange,0);
    $percentArray['A'] = $percent ;
    if($A >= 0 && $A < 101) {
        $arrayAnalyze .= " analyze[0][0] = 'علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف، $percent در صد می باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange  واحد می‌باشد و این عدد برای وضعیت فعلی شما $A واحد است، که واقعا بسیار کم و ناکافی می‌باشد. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید. <br>در واقع انرژیی که در این ناحیه از گراف حسی می بینی، مهمترین و کا‌رآمدترین منبع انرژی برای فعالیت‌کردن و رسیدن به هدف می‌باشد. این انرژی بیان‌گرعلاقه و محبت شما به موضوع هم هست.' ;
                           analyze[0][1] = 'علاقه شما به حرکت در مسیر رسیدن به هدف $percent درصد می‌باشد که در واقع بسیار کم است. البته این جدا از علاقه تو به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه تو به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br>از خودت بپرس: «چقدر علاقه‌مند به حرکت در این مسیر و انجام فعالیت‌های لازم مربوط به آن هستی؟» این میزان علاقه خیلی مهم‌تر از علاقه تو به خود هدف می‌باشد و در مورد شما این مقدار واقعا کافی نیست. با این ذهنیت، حرکت در این مسیر، شادی بسیار کمی در شما ایجاد می‌کند و فراموش نکن که اصلا فایده ندارد هدف را دوست داشته باشی اما مسیر رسیدن به آن را نه.' ;
                           analyze[0][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت‌کنی. به واژه‌هایی که به کار میبری فکر کن  و  حس‌وحالت رو به یاد بیاور.<br> تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، تقریبا هیچ توجهی ندارید و شاید حتی هیچ نکته مثبتی را درآن  نمی‌بینید. ممکن است بگویی که من اصلا درباره این فعالیت‌ها حرفی نمی‌زنم. دقت کن : شادی ناشی از انجام این دسته از فعالیت‌ها باعث تولید انرژی برای پیش‌رفتن در مسیر می‌شود و شما با مدل واگویه‌ها و یا حتی نداشتن هیچ واگویه ای در این زمینه، خود را از این یگانه منبع تولید انرژی پیش یرنده محروم کرده‌اید.' ;
                           analyze[0][3] = 'اگر می‌خواهی واقعا به سمت هدف حرکت کنی لازم است مسیر رسیدن به آن را نیز دوست داشته باشی. بهت پیشنهاد میکنم:<ul><li>به نکات مثبتی که در این مسیر وجود دارد، بیشتر توجه‌کنی و سعی‌کنی این فعالیت‌ها رو برای خودت جالب‌تر و جذاب‌ترکنی. </li><li>با خود و دیگران درباره این‌که چقدر انجام این فعالیت‌ها خوب و انرژی‌بخش است، بیشتر و بیشترحرف بزن. </li></ul>' ;
        " ;
    }
    elseif($A >=  101 && $A < 203) {
        $arrayAnalyze .= " analyze[0][0] = 'علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف، $percent در صد می باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange  واحد می‌باشد و این عدد برای وضعیت فعلی شما $A واحد است، که در واقع کم است. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید. <br>در واقع انرژیی که در این ناحیه از گراف حسی می بینی، مهمترین و کار‌آمدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می‌باشد. این انرژی بیان‌گر علاقه و محبت شما به موضوع هم هست.' ;
                           analyze[0][1] = 'علاقه شما به حرکت در مسیر رسیدن به هدف $percent درصد می باشد که در واقع کم است. البته این جدا از علاقه تو به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه تو به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br>از خودت بپرس: «چقدر علاقه‌مند به حرکت در این مسیر و انجام فعالیت‌های لازم مربوط به آن هستی؟ » این میزان علاقه خیلی مهمتر از علاقه تو به خود هدف می‌باشد و در مورد شما این مقدارکافی نیست. با این ذهنیت، حرکت در این مسیر، شادی چندانی در شما ایجاد نمی‌کند و فراموش نکن که اصلا فایده ندارد هدف را دوست داشته باشی اما مسیر رسیدن به آن را نه.' ;
                           analyze[0][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار میبری فکرکن و حس‌وحالت رو به یاد بیار.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، تقریبا بی‌توجه هستید.دقت کن: شادی ناشی از انجام این دسته از فعالیت ها باعث تولید انرژی برای پیش رفتن در مسیر می‌شود و این مدل از واگویه ها انرژی خیلی کمی تولید می‌کند.' ;
                           analyze[0][3] = 'اگر می‌خواهی واقعا به سمت هدف حرکت کنی لازم است مسیر رسیدن به آن را نیز دوست داشته باشی. بهت پیشنهاد میکنم:</br>به نکات مثبتی که در این مسیر وجود دارد، بیشتر توجه‌کنی و سعی‌کنی این فعالیت‌ها رو برای خودت جالب‌تر و جذاب‌تر کنی با خود و دیگران درباره اینکه چقدر انجام این فعالیت‌ها خوب و انرژی بخش هست، بیشتر و بیشتر حرف بزن.' ;
        " ;
    }
    elseif($A >= 203 && $A <= 250) {
        $arrayAnalyze .= " analyze[0][0] = 'علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف،$percent  درصد می‌باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange  واحد می‌باشد و این عدد برای وضعیت فعلی شما $A  واحد است، که می‌توان گفت بد نیست. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید.<br> در واقع انرژیی که در این ناحیه از گراف حسی می‌بینی، مهمترین و کارامدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می باشد. این انرژی بیان‌گر علاقه و محبت شما به موضوع هم هست.' ;
                           analyze[0][1] = 'علاقه شما به حرکت در مسیر رسیدن به هدف $percent درصد می باشد که بد نیست. البته این جدا از علاقه تو به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه تو به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br>از خودت بپرس:«چقدر علاقه‌مند به حرکت در این مسیر و انجام فعالیت‌های لازم مربوط به آن هستی؟ » این میزان علاقه خیلی مهمتر از علاقه تو به خود هدف می‌باشد و در مورد شما و با این ذهنیت، حرکت در این مسیر، حداقل انرژی مثبت را در اختیارت می‌گذارد. این مقدارانرژی زیاد نیست اما کم هم نیست. برای رسیدن به هدف بهتر است که این مقدار بیشتر شود.' ;
                           analyze[0][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار می‌بری فکر کن وحس وحالت  را به یاد بیاور.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، تا حدی توجه داری.دقت کن: شادی ناشی از انجام این دسته از فعالیت ها باعث تولید انرژی برای پیش رفتن در مسیر می‌شود و این مدل واگویه‌های شما باعث تولید انرژی می‌شود که البته مقدار آن زیاد نیست.' ;
                           analyze[0][3] = 'اگر می‌خواهی واقعا به سمت هدف حرکت کنی لازم است:<ul><li>به نکات مثبتی که در این مسیر وجود دارد، توجه کنی و سعی کنی این فعالیت‌ها رو برای خودت جالب‌تر کنی.</li><li>با خود و دیگران درباره این‌که چقدر انجام این فعالیت‌ها خوب و انرژی بخش است، بیشتر حرف بزن.</li></ul>' ;
        " ;
    }
    elseif($A >= 251 && $A <= 304) {
        $arrayAnalyze .= " analyze[0][0] = 'علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف،$percent  درصد می‌باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange واحد می‌باشد و این عدد برای وضعیت فعلی شما $A واحد است، که می‌توان گفت خوب است. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید.<br> در واقع انرژیی که در این ناحیه از گراف حسی می بینی، مهمترین و کارآمدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می باشد. این انرژی بیان‌گرعلاقه و محبت شما به موضوع هم هست.' ;
                           analyze[0][1] = 'علاقه شما به حرکت در مسیر رسیدن به هدف $percent  درصد می‌باشد که می‌توان گفت خوب است و می‌تواند بهتر‌هم بشود. البته این جدا از علاقه تو به خود هدف و رسیدن به آن است.<br> اینجا، صحبت از علاقه شما به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است که خیلی مهمتر از علاقه شما به خود هدف است و در مورد شما این مقدار خوب است. با این ذهنیت، حرکت در این مسیر، انرژی مثبت لازم را در اختیار شما قرار می‌دهد.' ;
                           analyze[0][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار می بری فکرکن و حس‌وحالت را به یاد بیاور.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، توجه نسبتا خوبی دارید. دقت کن: شادی ناشی از انجام این دسته از فعالیت ها باعث تولید انرژی برای پیش‌رفتن در مسیر می شود و این مدل واگویه‌های شما، باعث تولید انرژی می‌شود و البته می‌تواند بیشتر هم باشد.' ;
                           analyze[0][3] = 'اگر می‌خواهی واقعا به سمت هدف حرکت کنی لازم است:<ul><li>به نکات مثبتی که در این مسیر وجود دارد، بیشتر توجه کنی و سعی کنی این فعالیت‌ها رو برای خودت جذاب‌ترکنی.</li><li>با خود و دیگران درباره این‌که چقدر انجام این فعالیت‌ها خوب و انرژی‌بخش است، بیشتر حرف بزن.</li></ul>' ;
        " ;
    }
    elseif($A >= 305 && $A <= 360) {
        $arrayAnalyze .= " analyze[0][0] = 'علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف،$percent  درصد می‌باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange واحد می‌باشد و این عدد برای وضعیت فعلی شما $A  واحد است، که واقعا خوب است. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید. <br>در واقع انرژیی که در این ناحیه از گراف حسی می‌بینی، مهمترین و کارآمدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می باشد. این انرژی بیان‌گر علاقه و محبت شما به موضوع هم هست.' ;
                           analyze[0][1] = 'علاقه شما به حرکت در مسیر رسیدن به هدف $percent درصد می‌باشد که می‌توان گفت واقعا خوب است. البته این جدا از علاقه تو به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه تو به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br>از خودت بپرس: «چقدرعلاقه‌مند به حرکت در این مسیر وانجام فعالیت‌های لازم مربوط به آن هستی؟ » این میزان علاقه خیلی مهمتراز علاقه تو به خود هدف می‌باشد و در مورد شما این مقدارخیلی خوب است. با این ذهنیت، حرکت در این مسیر، انرژی مثبت خیلی خوبی  در اختیار شما قرارمی‌دهد. شما واقعا ازانجام این فعالیت‌ها لذت می‌برید و چنین کارهایی به زندگی شما هیجان مثبت می دهد. انجام چنین فعالیت‌هایی برای موجودیت حسی شما نسبتا عالی است، البته برای تحلیل جامع تر لازم است نواحی دیگر گراف هم بررسی شود.' ;
                           analyze[0][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار می‌بری فکرکن و حس‌وحالت را به یاد بیاور.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، توجه نسبتا خوبی دارید. دقت کن: شادی ناشی از انجام این دسته از فعالیت‌ها باعث تولید انرژی برای پیش رفتن در مسیر می‌شود و مدل واگویه‌های شما، باعث تولید این انرژی  می‌شود و می‌تواند بیشتر هم باشد.' ;
                           analyze[0][3] = ' اگر می‌خواهی واقعا به سمت هدف حرکت کنی لازم است در نظر داشته باشی:</br>توجه نسبتا خوب شما به نکات مثبت فعالیت‌هایی که لازم است در راه رسیدن به هدف انجام بدهی، مهمترین و بهترین قابلیت در این مسیرمحسوب می شود. این توجه مثبت را کم نکن. در این راه واگویه‌های خوب شما مشکلی ندارند و لازم است به قسمت‌های دیگر هم توجه کنی. ' ;
        " ;
    }
    elseif($A >= 361 && $A <= 454) {
        $arrayAnalyze .= " analyze[0][0] = 'علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف،$percent  درصد می‌باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange واحد می‌باشد و این عدد برای وضعیت فعلی شما $A واحد است، که واقعا عالی است. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید.<br>در واقع انرژیی که در این ناحیه از گراف حسی می‌‌بینی، مهمترین و کارآمدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می‌باشد. این انرژی بیان‌گرعلاقه و محبت شما به موضوع هم هست.' ;
                           analyze[0][1] = 'علاقه شما به حرکت در مسیر رسیدن به هدف $percent درصد می باشد که می‌توان گفت : «هی رفیق ! این واقعا عالیه» البته این جدا از علاقه تو به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه تو به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br> از خودت بپرس: «چقدر علاقه‌مند به حرکت در این مسیر و انجام فعالیت‌های لازم مربوط به آن هستی؟» این میزان علاقه خیلی مهمتر از علاقه تو به خود هدف می باشد، و در مورد شما این مقدار واقعا عالی است. شما از انجام این فعالیت‌ها لذت می برید و آنها برای موجودیت حسی شما عالی است و به زندگی شما هیجان مثبت می‌دهد. با این ذهنیت، حرکت در این مسیر، انرژی مثبت لازم را در اختیار شما قرار می‌دهد که البته بی‌نظیر می‌باشد. برای تحلیل جامع تر لازم است نواحی دیگر گراف هم بررسی شود.' ;
                           analyze[0][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار می بری فکرکن و حس‌وحالت را به یاد بیاور.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، توجه خوبی دارید. دقت کن: شادی ناشی از انجام این دسته از فعالیت ها باعث تولید انرژی برای پیش رفتن در مسیر می‌شود و این مدل واگویه‌های شما، باعث تولید این انرژی می‌شود.' ;
                           analyze[0][3] = ' اگر می‌خواهی واقعا به سمت هدف حرکت کنی لازم است در نظر داشته باشی:</br>توجه نسبتا خوب شما به نکات مثبت فعالیت‌هایی که لازم است در راه رسیدن به هدف انجام بدهی، مهم‌ترین و بهترین قابلیت در این مسیرمحسوب می شود.این توجه مثبت را همواره حفظ کن و اجازه نده که از مقدارش کم شود.در این راه واگویه‌های خوب مشکلی ندارند و لازم هست به قسمتهای دیگر هم توجه کنی.' ;
        " ;
    }
    elseif($A >= 455 && $A <= 504) {
        $arrayAnalyze .= " analyze[0][0] = 'علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف،$percent  درصد می‌باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange واحد می‌باشد و این عدد برای وضعیت فعلی شما $A واحد است، که بیشتر از حد نرمال است. شما می‌توانید میزان آن را در ناحیه A  گراف ببینید.<br>در واقع انرژیی که دراین ناحیه از گراف حسی می بینی، مهمترین و کارآمدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می‌باشد. این انرژی بیان‌گرعلاقه و محبت شما به موضوع هم هست.' ;
                           analyze[0][1] = 'علاقه شما به حرکت در مسیر رسیدن به هدف $percent  درصد می‌باشد که می‌توان گفت که زیادی خوب است. به عبارتی دیگر خوب است اما طبیعی نیست. شما از انجام این کار خیلی زیاد لذت می‌برید و احتمال اینکه به لذتش وابسته شوید بسیار بالاست. البته این جدا از علاقه شما به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه شما به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br>از خودت بپرس:« چقدر علاقه‌مند به حرکت در این مسیر و انجام فعالیت‌های لازم مربوط به آن هستی؟» این میزان علاقه خیلی مهمتر از علاقه تو به خود هدف می‌باشد. درحال حاضربا این ذهنیت، حرکت در این مسیر، انرژی مثبت زیادی را در اختیار شما قرار می دهد که بیشتر از حد نرمال است.' ;
                           analyze[0][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار می‌بری فکر کن و حس‌وحالت را به یاد بیاور.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، توجه بسیارخوبی دارید اما درباره خوبی‌های این کارکمی اغراق می‌کنید و تا حدود زیادی هیجان‌زده هستید و التهاب دارید. در نهایت، تمام این عوامل می‌تواند منجر به وابستگی شما شود. ' ;
                           analyze[0][3] = 'اگر می خواهید به حرکت به سمت هدف ادامه دهید، پیشنهاد می‌کنم:</br> گفتگوهای خوبت را درباره مسیر رسیدن به هدف و فعالیت‌های مربوط به آن حفظ کنی اما آنها را بیش از حد هیجانی نکنی. بهتر است تعادل در لذت بردن برقرار شود.' ;
        " ;
    }
    elseif($A >= 505 && $A <= 605) {
        $arrayAnalyze .= " analyze[0][0] = 'علاقه شما به حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف،$percent  درصد می‌باشد. حد استاندارد نیروی پیش‌برنده مثبت‌ای که ما شناسایی کرده‌ایم $percentMaxRange واحد می‌باشد و این عدد برای وضعیت فعلی شما $A  واحد است،که به شکل غیرطبیعی خوب است. شما می‌توانید میزان آن را در ناحیهA  گراف ببینید.<br>در واقع انرژیی که در این ناحیه از گراف حسی می‌بینی، مهمترین و کارآمدترین منبع انرژی برای فعالیت کردن و رسیدن به هدف می‌باشد. این انرژی بیان‌گرعلاقه و محبت شما به موضوع هم هست.' ;
                           analyze[0][1] = 'علاقه شما به حرکت در مسیر رسیدن به هدف $percent درصد می‌باشد که می‌توان گفت که بیشتر از حد نرمال هست، به عبارتی دیگر خوب است اما طبیعی نیست. شما از انجام این کار بیش از حد لذت می‌برید. البته لذت بردن از مسیر لازم است اما شما خیلی بیش از حد هیجان‌زده هستید.دقت کن:این جدا از علاقه تو به خود هدف و رسیدن به آن است. اینجا، صحبت از علاقه تو به مسیر و انجام فعالیت‌های لازم برای رسیدن به هدف است.<br>از خودت بپرس: «چقدر علاقه‌مند به حرکت در این مسیر و انجام فعالیت‌های لازم مربوط به آن هستی؟ » این میزان علاقه خیلی مهمتر از علاقه تو به خود هدف می‌باشد. درحال حاضر با این ذهنیت، حرکت در این مسیر، انرژی مثبت فوق‌العاده زیادی را در اختیار شما قرار می‌دهد که واضح است خیلی بیشتر از حد نرمال می‌باشد. این بسیار عالیست اما طبیعی نیست.' ;
                           analyze[0][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه‌هایی که به کار می‌بری فکر کن و حس‌و‌حالت را به یاد بیاور.<br>تمام داستان این است: شما به نکات مثبت فعالیت‌های مورد نیاز، توجه بسیارخوبی دارید و این انرژی خوبی برای شما فراهم کرده است  اما  درباره خوبی‌های این کار تا کمی اغراق می‌کنید و بسیارهیجان‌زده هستید که می‌تواند منجر به وابستگی شما شود. واگویه‌های شما تا حدی خیال پردازانه شده است و درباره خوبی‌های این فعالیت‌ها التهاب دارید. ' ;
                           analyze[0][3] = ' اگر می‌خواهید به حرکت به سمت هدف ادامه دهید، پیشنهاد می‌کنم:</br> گفتگوهای خوبت را درباره مسیر رسیدن به هدف و فعالیت‌های مربوط به آن حفظ کنی اما آنها را بیش از حد هیجانی نکنی. بهتر است تعادل در لذت بردن برقرار شود.' ;
        " ;
    }
    /////////////// B ///////////////////
    $percent =round(($B*100)/$percentMaxRange,0);
    $percentArray['B'] = $percent ;
    if($B >= 0  && $B <= 25 ) {
        $arrayAnalyze .= " analyze[1][0] = 'تلاش برای رسیدن به هدف در شما $percentدرصد خشم ایجاد می‌کند که می توان آن را نادیده گرفت چرا که هیچ نقش بازدارنده‌ای در حرکت به سمت هدف ندارد. این حالت برای حرکت به سمت هدف ایده‌آل می باشد. شما می توانید میزان آن را در ناحیه B گراف ببینید.' ;
                           analyze[1][1] = 'تلاش برای رسیدن به هدف در شما خشمی ایجاد نمی‌کند. به عبارت دیگر شما نسبت به انجام دادن کارهای لازم برای رسیدن به هدف اصلا احساس بدی ندارید. به این ترتیب در مسیر حرکت شما، انرژی بازدارنده‌ای وجود ندارد.' ;
                           analyze[1][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می‌بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضر هیچ توجهی به نکات منفی و سختی‌های مسیر ندارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران گفتگو نمی‌کنید.' ;
                           analyze[1][3] = 'این‌که شما در حال حاضر هیچ توجهی به نکات منفی و سختی‌های مسیر ندارید و درباره آنها با خود و دیگران گفتگو نمی‌کنید، واقعا جای تبریک دارد و بسیار امیدوارکننده است.<br>پیشنهاد می کنم که نسبت به اهمیت این مساله هشیار باشید و به شکلی آگاهانه این وضعیت را حفظ کنید.' ;
        " ;
    }
    elseif($B >= 26 && $B <= 101 ) {
        $arrayAnalyze .= " analyze[1][0] = 'تلاش برای رسیدن به هدف در شما  $percentدرصد خشم ایجاد می‌کند که می توان گفت این مقدار، خیلی کم است. این حالت برای حرکت به سمت هدف عالی می‌باشد. شما می توانید میزان آن را در ناحیه B   گراف ببینید.' ;
                           analyze[1][1] = 'تلاش برای رسیدن به هدف در شما درصد خیلی کمی خشم ایجاد می‌کند. به عبارت دیگر شما نسبت به انجام دادن کارهای لازم برای رسیدن به هدف احساس بدی ندارید. به این ترتیب در مسیر حرکت شما،انرژی بازدارنده‌‌ی خیلی کمی وجود دارد که درحد نرمال است.' ;
                           analyze[1][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضرتوجه چندانی به نکات منفی و سختی های مسیر ندارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران خیلی کم گفتگو می‌کنید.' ;
                           analyze[1][3] = 'اینکه شما در حال حاضرتوجه چندانی به نکات منفی مسیر ندارید و درباره آنها با خود و دیگران گفتگو نمی کنید، جای تبریک دارد و امیدوارکننده هست.<br>پیشنهاد می‌کنم اگر می ‌خواهید در مسیر هدف حرکت کنید، نسبت به اهمیت این مساله هشیار باشید و به شکل آگاهانه‌ای این وضعیت را حفظ کنید.' ;
        " ;
    }
    elseif($B >= 102  && $B <= 203 ) {
        $arrayAnalyze .= " analyze[1][0] = 'تلاش برای رسیدن به هدف در شما$percent  خشم ایجاد می‌کند که کمی زیاد است. این حالت برای حرکت به سمت هدف زیاد خوب نیست. شما می‌توانید میزان آن را در ناحیه B   گراف ببینید.' ;
                           analyze[1][1] = 'تلاش برای رسیدن به هدف در شما میزان خشم نسبتا زیادی تولید می‌کند که بیشترازحد نرمال است. به عبارت دیگر شما نسبت به انجام دادن کارهای لازم برای رسیدن به هدف، کمی احساس بد دارید. به این ترتیب در مسیر حرکت شما، انرژی بازدارنده‌‌ وجود دارد که بخشی از نیروی خودت را علیه خودت بکار ‌می‌گیرد و مقدار آن در مقایسه با حد استاندارد $percentMaxRange واحدی،  $B  واحد می‌باشد.' ;
                           analyze[1][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضربه نکات منفی و سختی های مسیرتوجه دارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران گفتگو می کنید.' ;
                           analyze[1][3] = 'اگر می ‌خواهید در مسیر هدف حرکت کنید پیشنهاد می کنم:<br>درباره بدی‌های فعالیت‌هایی که لازم است در مسیر رسیدن به هدف انجام بدهی، کمتر با خود و دیگران حرف بزن. <br>لازم نیست تا این حد به وجوه منفی و حس‌های منفی توجه داشته ‌‌باشی.' ;
        " ;
    }
    elseif($B >= 204  && $B <= 304 ) {
        $arrayAnalyze .= " analyze[1][0] = 'تلاش برای رسیدن به هدف در شما$percent  درصد خشم ایجاد می‌کند که زیاد است. این حالت برای حرکت به سمت هدف اصلا خوب نیست. شما می‌توانید میزان آن را در ناحیه B   گراف ببینید.' ;
                           analyze[1][1] = 'تلاش برای رسیدن به هدف در شما میزان خشم زیادی تولید می‌کند که حسابی بیشتراز حد نرمالی است که ما برای انجام فعالیت‌ها شناسایی کرده‌ایم. به عبارت دیگر شما نسبت به انجام دادن کارهای لازم برای رسیدن به هدف، احساس بدی دارید هرچند که ممکن است از خود هدف خوشت بیاید یا رسیدن به آن برایت مهم باشد. به این ترتیب در مسیر حرکت شما، انرژی بازدارنده‌‌ قابل توجهی وجود دارد که بخش نه چندان کمی از نیروی خودت را علیه خودت بکار‌می گیرد ومقدار آن در مقایسه با حد استاندارد $percentMaxRange واحدی،   $B واحد می‌باشد. حتی اگر با وجود این حجم از خشم و نیروی بازدارنده فعال، شما باز‌هم موفق شوید که به هدفتان برسید (در تحلیل های پیش رو این حالت را نیز بررسی خواهیم کرد)، در اینصورت نیز این خشم در شما به تدریج تجمیع شده که به هیچ وجه برای شما خوب نیست.' ;
                           analyze[1][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضربه نکات منفی و سختی های مسیرتوجه نسبتا زیادی دارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران زیاد حرف می زنید و نکته مهم این‌که جنس این گفتگو و‌ حرفها از نوع بدی می‌باشد.' ;
                           analyze[1][3] = 'با این شکل گراف و این میزان از خشم هزینه زیادی پرداخت خواهید کرد و ما می‌خواهیم هزینه حرکت به سمت هدف برای شما به حداقل برسد.<br>اگر می ‌خواهید در مسیر هدف حرکت کنید و این فعالیت‌ها تنها راه رسیدن به هدف می باشد، پیشنهاد می‌کنم:<ul><li>درباره بدی‌های فعالیت‌هایی که لازم است در مسیر رسیدن به هدف انجام بدهی، کمتر با خود و دیگران حرف بزن.</li><li>لازم نیست تا این حد به وجوه منفی و حس‌های منفی توجه داشته ‌‌باشی و با خود مرتب آنها را واگویه کنید. </li><li>حواست باشد که برای رسیدن به هدف باید در این مسیر حرکت کنی، مگر اینکه راه دیگری هم وجود داشته باشد که در این صورت بهتر است آن را انتخاب کنی. </li></ul>' ;
        " ;
    }
    elseif($B >= 305  && $B <= 405 ) {
        $arrayAnalyze .= " analyze[1][0] = 'تلاش برای رسیدن به هدف در شما$percent  درصد خشم ایجاد می‌کند که واقعا زیاداست، یعنی خیلی بیشتر از حدی که ما برای انجام فعالیت نرمال می دانیم. این وضعیت برای حرکت به سمت هدف اصلا خوب نیست. شما می‌ توانید میزان آن را در ناحیه B گراف ببینید.' ;
                           analyze[1][1] = 'تلاش برای رسیدن به هدف در شما میزان خشم زیادی تولید می‌کند که حسابی بیشترازحد نرمالی است که ما برای انجام فعالیت‌ها شناسایی کرده‌ایم. به عبارت دیگر شما نسبت به انجام دادن کارهای لازم برای رسیدن به هدف، واقعا احساس بدی دارید هرچند که ممکن است از خود هدف خوشتان بیاید یا رسیدن به آن برایتان مهم باشد. به این ترتیب در مسیر حرکت شما، انرژی بازدارنده‌‌ قابل توجهی وجود دارد که بخش زیادی از نیروی خودت را علیه خودت بکار‌ می‌گیرد، ومقدار آن در مقایسه با حد استاندارد $percentMaxRange واحدی،  $B واحد می‌باشد.حتی اگر با وجود این حجم از خشم و نیروی بازدارنده فعال، شما باز‌هم موفق شوید که به هدفتان برسید (در تحلیل های پیش رو این حالت را نیز بررسی خواهیم کرد)، در اینصورت نیز این خشم در شما به تدریج تجمیع شده که به هیچ وجه برای شما خوب نیست.<br>این مقدار خشم می تواند به شما و اطرافیانتان آسیب برساند. منظور این نیست که این حالت شما را پرخاشگر می‌کند چراکه این تنها یک دسته از فعالیت های شماست و شما خوشبختانه فعالیت های زیاد دیگری نیز دارید. اما اگر دیگر فعالیت‌های شما نیزمانند این دسته باشند و در شما خشم تولید کنند، در این حالت حتما پرخاشگر خواهید شد.' ;
                           analyze[1][2] = 'دلیلش ساده است . تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضربه نکات منفی و سختی های مسیرتوجه نسبتا زیادی دارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران زیاد حرف می زنید و نکته مهم اینکه جنس این گفتگو و‌ حرفها از نوع  بدی می باشد.' ;
                           analyze[1][3] = 'بااین شکل گراف و این میزان از خشم هزینه زیادی پرداخت خواهید کرد و ما می‌خواهیم هزینه حرکت به سمت هدف برای شما به حداقل برسد.<br>اگر می ‌خواهید در مسیر هدف حرکت کنید و این فعالیت‌ها تنها راه رسیدن به هدف می باشد، پیشنهاد می‌کنم:<ul><li>درباره بدی‌های فعالیت‌هایی که لازم است در مسیر رسیدن به هدف انجام بدهی، کمتر با خود و دیگران حرف بزن. </li><li>لازم نیست تا این حد به وجوه منفی و حس‌های منفی توجه داشته ‌‌باشی و با خود مرتب آنها را واگویه کنید. </li><li>حواست باشد که برای رسیدن به هدف باید در این مسیر حرکت کنی، مگر اینکه راه دیگری هم وجود داشته باشد که در این صورت بهتر است آن را انتخاب کنی. </li></ul>' ;
        " ;
    }
    elseif($B >= 406 && $B <= 505 ) {
        $arrayAnalyze .= " analyze[1][0] = 'تلاش برای رسیدن به هدف در شما$percent  درصد خشم ایجاد می‌کند که از زیاد هم زیادتر است.این حالت برای حرکت به سمت هدف واقعا بد است. شما می توانید میزان آن را در ناحیه B گراف ببینید.' ;
                           analyze[1][1] = 'تلاش برای رسیدن به هدف در شما میزان خشم خیلی زیادی تولید می‌کند. رفیق تو واقعا از حرکت در مسیر رسیدن به هدفت بدت می‌آید حتی می توان گفت نفرت داری ، هرچند که ممکن است از خود هدف خوشت بیاید یا رسیدن به آن برایت مهم باشد. به این ترتیب در مسیر حرکت شما، انرژی بازدارنده‌‌ بزرگی وجود دارد که بخش مهمی از نیروی خودت را علیه خودت بکار ‌می‌گیرد ومقدار آن در مقایسه با حد استاندارد $percentMaxRange واحدی،  $B واحد می‌باشد! حتی اگر با وجود این حجم از خشم و نیروی بازدارنده فعال، شما باز‌هم موفق شوید که به هدفتان برسید (که البته خیلی سخت خواهد بود و در تحلیل های پیش رو این حالت را نیز بررسی خواهیم کرد)، در اینصورت نیز این خشم در شما کم کم تجمیع شده که به هیچ وجه برای شما خوب نیست.<br>این مقدار خشم می تواند به شما و اطرافیانتان آسیب برساند.منظور این نیست که این حالت شما را پرخاشگر می‌کند چراکه این تنها یک دسته از فعالیت‌های شماست و شما خوشبختانه فعالیت‌های زیاد دیگری نیز دارید. اما اگر دیگر فعالیت‌های شما نیزمانند این دسته باشند و در شما خشم تولید کنند، در این حالت حتما پرخاشگر خواهید شد.' ;
                           analyze[1][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضربه نکات منفی و سختی های مسیر بیش از حد توجه دارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران خیلی زیاد و حتی در حد اغراق حرف می زنید.' ;
                           analyze[1][3] = 'با این شکل گراف و این میزان از خشم هزینه زیادی پرداخت خواهید کرد و ما می خواهیم هزینه حرکت به سمت هدف برای شما به حداقل برسد.<br>اگر می ‌خواهید در مسیر هدف حرکت کنید و این فعالیت‌ها تنها راه رسیدن به هدف می باشد، پیشنهاد می کنم:<ul><li>درباره بدی‌های فعالیت‌هایی که لازم است در مسیر رسیدن به هدف انجام بدهی، کمتر با خود و دیگران حرف بزن. </li><li>لازم نیست تا این حد به وجوه منفی و حس‌های منفی توجه داشته ‌‌باشی و با خود مرتب آنها را واگویه کنید. </li><li>حواست باشد که برای رسیدن به هدف باید در این مسیر حرکت کنی، مگر اینکه راه دیگری هم وجود داشته باشد که در این صورت بهتر است آن را انتخاب کنی. </li></ul>' ;
        " ;
    }
    elseif($B >= 506 && $B <= 605 ) {
        $arrayAnalyze .= " analyze[1][0] = 'تلاش برای رسیدن به هدف در شما$percent  درصد خشم ایجاد می‌کند از زیاد هم زیادتر است حتی می شود گفت که«آخرشه». این حالت برای حرکت به سمت هدف خیلی بد است. شما می توانید میزان آن را در ناحیه B گراف ببینید.' ;
                           analyze[1][1] = 'تلاش برای رسیدن به هدف در شما میزان خشم خیلی زیادی تولید می‌کند. رفیق تو واقعا از حرکت در مسیر رسیدن به هدفت بدت می‌آید حتی می توان گفت  نفرت داری. هرچند که ممکن است از خود هدف خوشت بیاید یا رسیدن به آن برایت مهم باشد.به این ترتیب در مسیر حرکت شما، انرژی بازدارنده‌‌ بزرگی وجود دارد که بخش مهمی از نیروی خودت را علیه خودت بکار‌می گیرد ومقدار آن در مقایسه با حد استاندارد $percentMaxRange واحدی،  $B واحد می‌باشد!<br>حتی اگربا وجود این حجم از خشم و نیروی بازدارنده فعال، شما باز‌ هم موفق شوید که به هدفتان برسید (که البته خیلی سخت خواهد بود و در تحلیل های پیش رو این حالت را نیز بررسی خواهیم کرد)، در اینصورت نیزاین خشم در شما کم‌کم تجمیع شده که به هیچ وجه برای شما خوب نیست.<br>این مقدار خشم می تواند به شما و اطرافیانتان واقعا آسیب می‌زند. منظور این نیست که این حالت شما را پرخاشگر می‌کند چراکه این تنها یک دسته از فعالیت‌های شماست و شما خوشبختانه فعالیت‌های زیاد دیگری نیز دارید. اما اگر بیشتر فعالیت‌های دیگر شما مانند این دسته باشند و در شما خشم تولید کنند، در این حالت حتما پرخاشگر خواهید شد.' ;
                           analyze[1][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما در حال حاضر به نکات منفی و سختی های مسیر بیش از حد توجه دارید و درباره وجه منفی این فعالیت‌ها با خود و دیگران خیلی زیاد والبته خیلی بد حرف می زنید. حتی می‌توان گفت که واقعا اغراق می‌کنی. واقعا موضوع تا این حد بد است؟' ;
                           analyze[1][3] = 'با این شکل گراف و این میزان از خشم هزینه زیادی پرداخت خواهید کرد و ما می خواهیم هزینه حرکت به سمت هدف برای شما به حداقل برسد.<br>اگر می ‌خواهید در مسیر هدف حرکت کنید و این فعالیت‌ها تنها راه رسیدن به هدف می‌باشد، پیشنهاد می‌کنم:<ul><li>درباره بدی‌های فعالیت‌هایی که لازم است در مسیر رسیدن به هدف انجام بدهی، کمتر با خود و دیگران حرف بزن. </li><li>لازم نیست تا این حد به وجوه منفی و حس‌های منفی توجه داشته ‌‌باشی و با خود مرتب آنها را واگویه کنید. به این همه بدگویی نیازی نیست. </li><li>حواست باشد که برای رسیدن به هدف باید در این مسیر حرکت کنی، مگر اینکه راه دیگری هم وجود داشته باشد که در این صورت بهتر است آن را انتخاب کنی.</li></ul>' ;
        " ;
    }
    /////////////// C ///////////////////
    $percent =round(($C*100)/$percentMaxRange,0);
    $percentArray['C'] = $percent ;
    if($C >= 0  && $C <= 25 ) {
        $arrayAnalyze .= " analyze[2][0] = 'حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف، غمی در شما ایجاد نمی‌کند. شما می توانید میزان این انرژی را در ناحیه C گراف ببینید.' ;
                           analyze[2][1] = 'حرکت در مسیر این هدف برای شما غمی تولید نمی کند  واین برای حرکت به سمت هدف واقعا خوب است و البته این بخش از ماجرا، جای خوشوقتی و تبریک دارد. شما علاقه ای به انجام ندادن این کار ندارید. این یعنی انرژی بازدارنده پنهانی هم وجود ندارد، انرژی پنهانی که فقط بعضی مواقع ظاهر می‌شود و روی کیفیت تلاش، گاه‌‌و بیگاه اثر منفی می‌گذارد که  خوشبختانه در مورد شما این انرژی وجود ندارد.' ;
                           analyze[2][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه هایی که به کار می برید فکر کنید و حس و حالتان را به یاد بیاورید. تمام داستان این است: شما درباره انجام ندان فعالیت ها و رها کردن آنها یا رفتن به سمت هدف دیگری، حرف های خوب نمی زنید. یعنی با حسرت حرف نمی زنید واین بسیار  خوب است.' ;
                           analyze[2][3] = 'این مدل رویکرد برای کسی که می خواهد به هدفش برسد درست است. بر آن هشیار باشید و حفظش کنید.' ;
        " ;
    }
    elseif($C >= 26 && $C <= 101 ) {
        $arrayAnalyze .= " analyze[2][0] = 'حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف، درحدود $percent درصد غم به همراه دارد.این مقدار غم نرمال است. شما می توانید میزان آن را در ناحیه C گراف ببینید.' ;
                           analyze[2][1] = 'حرکت در مسیر این هدف برای شما مقدار غمی تولید می‌کند که نرمال است ومشکلی برای حرکت به سمت هدف ایجاد نمی‌کند.شما علاقه‌ی خیلی کمی نسبت به انجام ندادن این فعالیت‌ها دارید و این به این معناست که دراین مسیر، انرژی بازدارنده بسیار کمی وجود دارد که واقعا جای تبریک دارد. این انرژی پنهان است و گاهی ظاهر میشود و بر کیفیت تلاش، گاه‌ و بیگاه اثر منفی می‌گذارد که خوشبختانه در مورد شما قابل توجه نیست.<br>مثلا اگر هنوز فعالیت‌های مربوط به مسیر هدف را آغاز نکرده‌اید، هر موقع که می‌خواهید شروع کنید، این انرژی پنهان به‌صورت انرژی مخالف ظاهر می‌شود و شروع کار را برای شما سخت‌تر از آنی که هست جلوه می‌دهد. اما به محض برداشتن اولین قدم، این انرژی عقب زده می شود و شما حس می‌کنید که انجام کار به دشواریی که به نظر می‌آمد نیست. بدین خاطر یه این انرژی، اینرسی یا مقاومت در برابر تغییر هم می‌گوییم.' ;
                           analyze[2][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما درباره انجام ندادن این فعالیت‌ها و رها کردنشان و یا رفتن به سمت هدفی دیگر چندان با حسرت حرف نمی‌زنید.' ;
                           analyze[2][3] = 'این مدل رویکرد برای کسی که می خواهد به هدفش برسد درست است و شما می توانید حتی آن را بهتر کنید. برای این کار لازم است:<br>درباره احساسات و شرایط خوب ناشی از انجام ندادن این فعالیت ها کمتر حرف بزنید یا با احساس کمتری حرف بزنید.' ;
        " ;
    }
    elseif($C >= 102  && $C <= 203 ) {
        $arrayAnalyze .= " analyze[2][0] = 'حرکت در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، درحدود $percent درصد غم به همراه دارد. این مقدار غم در‌‌بازه نرمال نیست و یک مقدار زیاد است. شما می توانید میزان آن را در ناحیه C گراف ببینید.' ;
                           analyze[2][1] = 'حرکت در مسیر این هدف برای شما مقدار غمی تولید می‌کند که یک مقدار زیاد است اما واقعا مشکلی برای حرکت به سمت هدف ایجاد نمی‌کند. با این وجود، این میزان غم، هزینه حسی و روانی محسوب می شود. شما علاقه‌ی کمی نسبت به انجام ندادن این فعالیت ها دارید و این به این معناست که دراین مسیر، انرژی بازدارنده کمی وجود دارد.این انرژی پنهان است و گاهی ظاهر می‌شود. هر زمان که به حرکت نکردن در این مسیر فکر می‌کنی و با خود یا دیگران درباره‌ی آن حرف می‌زنی ، به طرز عجیبی فعال می‌شود و با ظاهر شدنش اثر منفی برکیفیت تلاش ها و فعالیت ها می‌گذارد که خوشبختانه در مورد شما هنوز زیاد نیست اما محسوس است.' ;
                           analyze[2][2] = 'دلیلش ساده است . تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما درباره انجام ندادن این فعالیت‌ها و رها کردنشان و یا رفتن به سمت هدفی دیگر تا‌حدی با حسرت و آرزو حرف می زنید.' ;
                           analyze[2][3] = 'این مدل رویکرد برای کسی که می خواهد به هدفش برسد خوب نیست و شما می توانید آن را بهتر کنید. برای این کار لازم است:<br>درباره احساسات و شرایط خوب ناشی از انجام ندادن این فعالیت ها کمتر حرف بزنید یا با احساس کمتری حرف بزنید.' ;
        " ;
    }
    elseif($C >= 204  && $C <= 304 ) {
        $arrayAnalyze .= " analyze[2][0] = 'حرکت در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف، درحدود $percent درصد غم به همراه دارد. این مقدار غم بیشتر از حد استاندارد است. هرچند بطور‌کامل غم، در حرکت به سمت هدف مشکلی مستمرایجاد نمی‌کند اما به هر حال هزینه حسی و روانی محسوب می شود. و شما می توانید میزان این انرژی را در ناحیهC  گراف ببینید.' ;
                           analyze[2][1] = 'شما دوست دارید که در این مسیر حرکت نکنید و این به این معناست که انرژی بازدارنده‌ی وجود دارد. این انرژی پنهان است و گاهی ظاهر میشود. هر زمان که به حرکت نکردن در این مسیر فکر می‌کنید و با خود یا دیگران درباره‌ی آن حرف می‌زنید ، به طرز عجیبی فعال می‌شود و با ظاهر شدنش اثر منفی برکیفیت تلاش ها و فعالیت ها می گذارد. بیشترین اثر منفی این انرژی برروی پشتکار و پایداری شما در طی کردن مسیر به سمت هدف می‌باشد. حتما تجربه کرده‌اید ؛ هنگامی‌که خسته یا عصبی هستید این نیرو ظاهر می شود و تمایل شما را برای ادامه دادن مسیر کم می‌کند.' ;
                           analyze[2][2] = 'دلیلش ساده است . تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما درباره انجام ندادن این فعالیت‌ها و رها کردنشان و یا رفتن به سمت هدفی دیگر تا‌حدی با حسرت و آرزو حرف می زنید.' ;
                           analyze[2][3] = 'این مدل رویکرد برای کسی که می‌خواهد به هدفش برسد خوب نیست ولازم است که آن را بهتر کنید. برای این کار پیشنهاد می کنم:<br>درباره احساسات و شرایط خوب ناشی از انجام ندادن این فعالیت ها کمتر حرف بزنید یا با احساس کمتری حرف بزنید. ' ;
        " ;
    }
    elseif($C >= 305  && $C <= 405 ) {
        $arrayAnalyze .= " analyze[2][0] = 'حرکت در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، درحدود $percent درصد غم به همراه دارد.این مقدار غم کاملا بیشتر از حد استاندارد است. هرچند بطور‌کامل غم، در حرکت به سمت هدف مشکلی مستمرایجاد نمی‌کند اما به هر حال هزینه حسی و روانی محسوب می شود. و شما می توانید میزان این انرژی را در ناحیه C گراف ببینید.' ;
                           analyze[2][1] = ' شما واقعا دوست دارید که در این مسیر حرکت نکنید و این به این معناست که انرژی بازدارنده‌ی قابل توجهی وجود دارد. این انرژی پنهان است و گاهی ظاهر میشود. هر زمان که به حرکت نکردن در این مسیر فکر می‌کنید و با خود یا دیگران درباره‌ی آن حرف می‌زنید ، به طرز عجیبی فعال می‌شود و با ظاهر شدنش اثر منفی برکیفیت تلاش ها و فعالیت‌ها می‌گذارد. بیشترین اثر منفی این انرژی برروی پشتکار و پایداری شما در طی کردن مسیر به سمت هدف می باشد. حتما تجربه کرده‌اید؛ هنگامی‌که خسته یا عصبی هستید این نیرو ظاهر می شود و تمایل شما را برای ادامه دادن مسیر کم می‌کند.' ;
                           analyze[2][2] = 'دلیلش ساده است . تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما درباره انجام ندادن این فعالیت‌ها و رها کردنشان و یا رفتن به سمت هدفی دیگر تا‌حدی با حسرت و آرزو حرف می زنید.' ;
                           analyze[2][3] = 'یک  لحظه فکر کن .«آیا واقعا انجام ندادن این کارها و فعالیت ها تا این حد میتواند خوب باشد؟» پاسخ هر چه باشد لازم است به این نکته توجه کنید که این رویکرد برای کسی که میخواهد به هدفی برسد به هیچ‌وجه خوب نیست و حرکت به سمت این هدف با این وضعیت از واگویه هامی تواند تبدیل به یکی از منابع جدی اندوه شود.<br>اما چه باید کرد؟<br>تنها کاری که باید انجام دهید این است : «درباره شرایط و احساسات خوب ناشی از حرکت نکردن در این مسیر و انجام ندادن فعالیت های آن کمتر حرف بزنید و یا حداقل با احساس و حسرت کمتری با خود و دیگری در این رابطه گفتگو کنید.»<br>پس به طور کلی پیشنهاد می کنم : <ul><li>یا از حرکت در این مسیر صرف‌نظر کنید و بی خیال این هدف شوید.</li><li>یا اگر برایتان امکان پذیر نیست که  هدف را تغییر بدهید، مسیر بهتری برای رسیدن به آن پیدا کنید.</li><li>و یا اگر نمی‌توانید و یا نمی‌خواهید هدف و مسیر رسیدن به آن را عوض کنید، به طور جدی بر روی خنثی کردن و کم اهمیت کردن واگویه‌های فعلی خویش کار کنید.</li></ul>' ;
        " ;
    }
    elseif($C >= 406 && $C <= 505 ) {
        $arrayAnalyze .= " analyze[2][0] = 'حرکت در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، درحدود$percent  درصد غم به همراه دارد. این مقدار غم خیلی بیشتر از حد استاندارد است(ما حد استاندارد را 25درصد در‌نظر گرفته‌ایم). هرچند بطور‌کامل غم، در حرکت به سمت هدف مشکلی مستمرایجاد نمی‌کند اما به هر حال هزینه حسی و روانی محسوب می شود و شما می‌توانید میزان این انرژی را در ناحیه C گراف ببینید.' ;
                           analyze[2][1] = ' شما به طور جدی دوست دارید که در این مسیر حرکت نکنید و این به این معناست که انرژی بازدارنده ی قابل توجهی وجود داردکه در مورد شما به حد التهاب حسی رسیده است. این انرژی پنهان است و گاهی ظاهر میشود.هر زمان که به حرکت نکردن در این مسیر فکر میکنید و با خود یا دیگران درباره ی آن حرف میزنید ، به طرز عجیبی فعال می‌شود و با ظاهر شدنش اثر منفی برکیفیت تلاش ها و فعالیت ها می گذارد. بیشترین اثر منفی این انرژی برروی پشتکار و پایداری شما در طی کردن مسیر به سمت هدف می باشد. حتما تجربه کرده‌اید؛ هنگامی‌که خسته یا عصبی هستید این نیرو ظاهر می شود و تمایل شما را برای ادامه دادن مسیر کم می‌کند.' ;
                           analyze[2][2] = 'دلیلش ساده است . تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما درباره انجام ندادن این فعالیت‌ها و رها کردنشان و یا رفتن به سمت هدفی دیگر با حسرت و آرزوی زیاد و حتی درحد اغراق حرف می زنید. در صورت اصلاح نکردن این مدل از واگویه ها، حرکت در این مسیر به منظور رسیدن به هدف ، برای تو به یک منبع بزرگ از غم و اندوه تبدیل خواهد شد که بی شک این حجم از غم مخرب خواهد بود.' ;
                           analyze[2][3] = 'یک لحظه فکر کن .«آیا واقعا انجام ندادن این کارها و فعالیت ها تا این حد میتواند خوب باشد؟» من که بعید می دانم انجام ندادن این کارها تا این حد خوب باشد.<br>به هر حال پاسخ هر چه باشد لازم است به این نکته توجه کنید که این رویکرد برای کسی که میخواهد به هدفی برسد به هیچ وجه خوب نیست و حرکت به سمت این هدف با این وضعیت از واگویه هامی تواند تبدیل به یکی از منابع جدی اندوه شود و بسیار حالگیر است.<br>اما چه باید کرد؟<br>تنها کاری که باید انجام دهید این است: «درباره شرایط و احساسات خوب ناشی از حرکت نکردن در این مسیر و انجام ندادن فعالیت های آن کمتر حرف بزنید و یا حداقل با احساس و حسرت کمتری با خود و دیگری در این رابطه گفتگو کنید.»<br> پس به طور کلی پیشنهاد می کنم:<ul><li>یا از حرکت در این مسیر صرف‌نظر کنید و بی‌خیال این هدف شوید.</li><li>یا اگر برایتان امکان پذیر نیست که  هدف را تغییر بدهید، مسیر بهتری برای رسیدن به آن پیدا کنید.</li><li>و یا اگر نمی توانید و یا نمی خواهید هدف و مسیر رسیدن به آن را عوض کنید، به طور جدی بر روی خنثی کردن و کم اهمیت کردن واگویه های فعلی خویش کار کنید.</li></ul>' ;
        " ;
    }
    elseif($C >= 506 && $C <= 605 ) {
        $arrayAnalyze .= " analyze[2][0] = 'حرکت در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف ، درحدود $percent درصد غم به همراه دارد. این مقدار غم به شکل غیر طبیعی بیشتر از حد استاندارد است(ما حد استاندارد را 25درصد در‌نظر گرفته ایم). هرچند بطور‌کامل غم، در حرکت به سمت هدف مشکلی مستمرایجاد نمی‌کند اما به هر حال هزینه حسی و روانی محسوب می شود. و شما می توانید میزان این انرژی را در ناحیه C گراف ببینید.' ;
                           analyze[2][1] = 'شما به طورکاملا جدی دوست دارید که در این مسیر حرکت نکنید و این به این معناست که انرژی بازدارنده ی قابل توجهی وجود داردکه در مورد شما به انتهای حد التهاب حسی رسیده است. این انرژی پنهان است و گاهی ظاهر میشود.هر زمان که به حرکت نکردن در این مسیر فکر میکنید و با خود یا دیگران درباره ی آن حرف میزنید، به طرز عجیبی فعال میشود و با ظاهر شدنش اثر منفی برکیفیت تلاش ها و فعالیت ها می گذارد. بیشترین اثر منفی این انرژی برروی پشتکار و پایداری شما در طی کردن مسیر به سمت هدف می باشد. حتما تجربه کرده‌اید؛ هنگامیکه خسته یا عصبی هستید این نیرو ظاهر می شود و تمایل شما را برای ادامه دادن مسیر کم می‌کند.' ;
                           analyze[2][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنی. به واژه هایی که به کار می بری فکر کن و حس‌وحالت را به یاد بیاور. تمام داستان این است: شما درباره انجام ندادن این فعالیت‌ها و رها کردنشان و یا رفتن به سمت هدفی دیگر با حسرت و آرزوی زیاد و حتی درحد اغراق حرف می زنید،اغراق آمیز و غیر‌طبیعی.در صورت اصلاح نکردن این مدل از واگویه ها ، حرکت در این مسیر به منظور رسیدن به هدف ، برای تو به یک منبع بزرگ از غم و اندوه تبدیل خواهد شد که بی شک این حجم از غم مخرب خواهد بود.' ;
                           analyze[2][3] = 'یک لحظه فکر کن. «آیا واقعا انجام ندادن این کارها و فعالیت ها تا این حد میتواند خوب باشد؟» من که بعید می دانم انجام ندادن این کارها تا این حد خوب باشد.<br>با من هم عقیده باشید یا نه، لازم است به این نکته توجه کنید که این رویکرد برای کسی که میخواهد به هدفی برسد به هیچ وجه خوب نیست و حرکت به سمت این هدف با این وضعیت از واگویه هامی تواند تبدیل به یکی از منابع جدی اندوه شود و بسیار حالگیر است.<br>اما چه باید کرد؟<br>تنها کاری که باید انجام دهید این است: «درباره شرایط و احساسات خوب ناشی از حرکت نکردن در این مسیر و انجام ندادن فعالیت های آن کمتر حرف بزنید و یا حداقل با احساس و حسرت کمتری با خود و دیگری در این رابطه گفتگو کنید.»<br>پس به طور کلی پیشنهاد می کنم:<ul><li>یا از حرکت در این مسیر صرف‌نظر کنید و بی‌خیال این هدف شوید.</li><li>یا اگر برایتان امکان پذیر نیست که  هدف را تغییر بدهید، مسیر بهتری برای رسیدن به آن پیدا کنید.</li><li>و یا اگر نمی توانید و یا نمی خواهید هدف و مسیر رسیدن به آن را عوض کنید، به طور جدی بر روی خنثی کردن و کم اهمیت کردن واگویه های فعلی خویش کار کنید.</li></ul>' ;
        " ;
    }
    /////////////// D ///////////////////
    $percent =round(($D*100)/$percentMaxRange,0);
    $percentArray['D'] = $percent ;
    if($D >= 0  && $D <= 25 ) {
        $arrayAnalyze .= " analyze[3][0] = 'شما در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، خوشبختانه استرسی ندارید و این عالی است. نگاهی به  ناحیه D گراف بیاندازید.' ;
                           analyze[3][1] = 'انرژی که درناحیه D گراف دیده می‌شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. خوشبختانه، شما برای حرکت در مسیر هدف استرسی ندارید.' ;
                           analyze[3][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه هایی که به کار می برید فکر کنید و حس و حالتان را به یاد بیاورید. تمام داستان این است: شما درباره اینکه انجام ندادن این فعالیت‌ها ویا نرسیدن به هدف چقدر بد، خطرناک و مضر است هیچ واگویه‌ای ندارید.' ;
                           analyze[3][3] = 'این حالت بهترین قابلیت برای طی کردن درست وبدون استرس مسیر می باشد. نسبت به آن هشیار باشید و آن را حفظ کنید.' ;
        " ;
    }
    elseif($D >= 26 && $D <= 101 ) {
        $arrayAnalyze .= " analyze[3][0] = 'شما در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، خوشبختانه استرس کمی دارید یعنی در محدوده‌ای که ما آن راعادی می‌دانیم واین عالی است. نگاهی به  ناحیه  D گراف بیاندازید.' ;
                           analyze[3][1] = 'انرژی که درناحیه D گراف دیده می شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. انرژی استرس کارایی چندانی ندارد و میزان بهروری آن بسیار کم است. یعنی باعث می شود که در عمل، به اندازه زمان و انرژی که برای انجام کار هزینه می کنیم، نتیجه نگیریم. فکر می کنم لازم نیست که اثرات ویرانگر استرس بر بدن و روان را توضیح بدهم.<br>اما خبر خوب این است که، شما برای حرکت در مسیر هدف استرس کمی دارید، یعنی در محدوده‌ای که ما آن را عادی می دانیم. اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید این حدود $percent درصداز حداکثر مقدار خودش می باشد و این عالیست.' ;
                           analyze[3][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه‌هایی که به کار می‌برید فکر کنید و حس‌و‌حالتان را به یاد بیاورید. تمام داستان این است: شما درباره اینکه انجام ندادن این فعالیت‌ها ویا نرسیدن به هدف چقدر بد، خطرناک و مضر است تقریبا واگویه ی ندارید اما لازم است بیشتر حواستان باشد.' ;
                           analyze[3][3] = 'کافیست مراقب باشید که استرس تقویت نشود. واقعیت این است که این اتفاق خیلی آسان تر ازآنچه بنظر میاد، ممکن میشود. واگویه های منفی درباره اینکه انجام نشدن این کارها یا نرسیدن به هدف چقدر بد و خطرناک یا مضر است منجر به تقویت این ناحیه می شود. اگر چه بنظر می آید که این نوع مکالمات ذهنی باعث می‌شود به کار بیشتر اهمیت بدهید، اما باور کنید به مشکلاتی که ایجاد می‌کند نمی ارزد و سطح خلاقیت و هوشمندی در کار را هم کاهش می دهد.' ;
        " ;
    }
    elseif($D >= 102  && $D <= 203 ) {
        $arrayAnalyze .= " analyze[3][0] = 'شما در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، استرس کمی دارید در واقع کمی بیشتر از مقداری که می توان آن را عادی در‌نظر گرفت.  نگاهی به  ناحیه D گراف بیاندازید.' ;
                           analyze[3][1] = 'انرژی که درناحیه D گراف دیده می شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. انرژی استرس کارایی چندانی ندارد و میزان بهروری آن بسیار کم است. یعنی باعث می شود که در عمل به اندازه زمان و انرژی که برای انجام کار هزینه می کنیم، نتیجه نگیریم. فکر می کنم لازم نیست که اثرات ویرانگر استرس بر بدن و روان را توضیح بدهم.<br>شما برای حرکت در مسیر هدف استرس کمی دارید. اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید این حدود $percent درصد از حداکثر مقدار خودش می باشد. قبول دارم مقدار زیادی نیست اما هیچی هم نیست. همین مقدارهم، سطح خلاقیت و هوشمندی در کار را کاهش می دهد. پس لازم است که به آن توجه کنید چراکه می تواند خیلی سریع و زیرپوستی رشد کند و اوضاع را بدتر کند.' ;
                           analyze[3][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه‌هایی که به کار می برید فکر کنید و حس‌و‌حالتان را به یاد بیاورید. تمام داستان این است: شما واگویه های منفی درباره اینکه انجام نشدن این کارها یا نرسیدن به هدف چقدر بد و خطرناک یا مضر است، دارید ودرمورد آن با خود یا دیگران  حرف می زنید.اگر چه به‌نظر می‌آید این نوع مکالمات ذهنی باعث می‌شود به کاراهمیت بیشتری بدهید اما باور کنید به مشکلاتی که ایجاد می‌کند نمی ارزد و سطح خلاقیت و هوشمندی در کار را هم کاهش می دهد.' ;
                           analyze[3][3] = 'شمابرای حرکت در مسیر هدف به این واگویه‌ها و گفتگو‌ها نیاز ندارید. آنها هیچ کمکی نمی‌کنند. بهتر ‌است راجع به این‌که چقدر انجام این فعالیت ها بامزه و دوست داشتنی هستند، حرف بزنید ومراقب باشید که استرس تقویت نشود.' ;
        " ;
    }
    elseif($D >= 204  && $D <= 304 ) {
        $arrayAnalyze .= " analyze[3][0] = 'شما در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، استرس دارید که در واقع این مقدار کم نیست. در ‌نظر داشته باشید که استرس تا 25 درصد، تقریبا عادی‌‌است اما همان‌طور که می بینید درصد شما بیشتر از این میزان است. شما می‌توانید میزان آن را در ناحیه D گراف ببینید.' ;
                           analyze[3][1] = 'انرژی که درناحیه D گراف دیده می شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. انرژی استرس کارایی چندانی ندارد و میزان بهره‌وری آن بسیار کم است. یعنی باعث می شود که در عمل به اندازه زمان و انرژی که برای انجام کار هزینه می کنیم، نتیجه نگیریم. فکر می‌کنم لازم نیست که اثرات ویرانگر استرس بر بدن و روان را توضیح بدهم.<br>شما برای حرکت در مسیر هدف استرس دارید و مقدارش کم هم نیست. اکنون و با ذهنیتی که در حال حاضر درباره فعالیت‌ها دارید این حدود $percent درصد از حداکثر مقدار خودش می باشد. این مقدار سطح خلاقیت و هوشمندی در کار را کاهش می‌دهد.' ;
                           analyze[3][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه هایی که به کار می برید فکر کنید و حس‌و‌حالتان را به یاد بیاورید. تمام داستان این است: شما واگویه های منفی درباره اینکه انجام نشدن این کارها یا نرسیدن به هدف چقدر بد و خطرناک یا مضر است، دارید ودرمورد آن با خود یا دیگران  حرف می زنید.اگر چه به‌نظر می‌آید این نوع مکالمات ذهنی باعث می‌شود به کاراهمیت بیشتری بدهید اما باور کنید به مشکلاتی که ایجاد می‌کند نمی‌ارزد و سطح خلاقیت و هوشمندی در کار را هم کاهش می‌دهد.' ;
                           analyze[3][3] = 'شما برای حرکت در مسیر هدف به این واگویه‌ها و گفتگو‌ها نیاز ندارید. آنها واقعا کمکی نمی کنند. بدون این گفتگوها، می توانید مطمئن باشید با صرف وقت کمتر نتیجه بهتری خواهید گرفت. به حرفم اعتماد کنید، بهتر ‌است راجع به این که چقدر انجام این فعالیت‌ها بامزه و دوست داشتنی هستند، حرف بزنید.' ;
        " ;
    }
    elseif($D >= 305  && $D <= 405 ) {
        $arrayAnalyze .= " analyze[3][0] = 'شما در این مسیر و انجام فعالیت های لازم جهت رسیدن به هدف، استرس زیادی دارید یا به ‌عبارتی خیلی زیاد. در ‌نظر داشته باشید که استرس تا 25 درصد، تقریبا عادی‌‌است اما همان‌طور که می بینید درصد شما بیشتر از این میزان است. شما می توانید میزان آن را در ناحیه D گراف ببینید.' ;
                           analyze[3][1] = 'انرژی که درناحیه D گراف دیده می شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. انرژی استرس کارایی چندانی ندارد و میزان بهروری آن بسیار کم است. یعنی باعث می شود که در عمل به اندازه زمان و انرژی که برای انجام کار هزینه می کنیم، نتیجه نگیریم. فکر می کنم لازم نیست که اثرات ویرانگر استرس بر بدن و روان را توضیح بدهم.<br>شما برای حرکت در مسیر هدف استرس زیادی دارید. اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید این حدود $percent درصد از حداکثر مقدار خودش می باشد. این مقدار سطح خلاقیت و هوشمندی در کار را کاهش می‌دهد. شما ممکن است وقت یا توجه زیادی به موضوع اختصاص بدهید اما این کار به این معنی نیست که نتیجه متناسبی هم ازآن خواهید گرفت.' ;
                           analyze[3][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه هایی که به کار می برید فکر کنید و حس و حالتان را به یاد بیاورید. تمام داستان این است: شما واگویه‌های منفی زیادی درباره اینکه انجام نشدن این کارها یا نرسیدن به هدف چقدر بد و خطرناک یا مضر است، دارید ودرمورد آن با خود یا دیگران زیاد حرف می زنید.اگر چه بنظر می‌آید این نوع مکالمات ذهنی باعث می‌شود به کار اهمیت بیشتری بدهید اما باور کنید به مشکلاتی که ایجاد می‌کند نمی‌ارزد و سطح خلاقیت و هوشمندی در کار را هم کاهش می دهد. این واگویه ها شما را تشویق خواهند کرد که وقت یا توجه زیادی به موضوع اختصاص بدهید اما این به این معنی نیست که نتیجه متناسبی هم ازآن خواهید گرفت.<br>راستش، این مقدار استرس آنقدر زیاد است که من احتمال می‌دهم هنگام پر کردن گراف دچار اشتباه شده باشید. یعنی به‌جای اینکه به این فکر کنید که چقدر انجام ندادن کارهای لازم در مسیر هدف بد است به این فکر کرده باشید که چقدر نرسیدن به هدف بد است. اگر اینطوراست، پیشنهاد می کنم دوباره گراف را با دقت بیشتری پر کنید. اما اگر درست پر کرده‌اید و به فعالیت در مسیر هدف فکر کرده‌اید و نه خود هدف، پس باید بگویم شما واقعا از انجام ندادن این فعالیت ها بدتان می آید.اما سوال مهم این است که این میزان بد‌آمدن چقدر به پیشرفت در مسیر کمک می‌کند؟' ;
                           analyze[3][3] = 'شما برای حرکت در مسیر هدف به این واگویه ها و گفتگو ها نیاز ندارید. آنها واقعا کمکی نمی کنند. بدون این گفتگوها، می توانید مطمئن باشید با گذاشتن وقت کمتر نتیجه بهتری خواهید گرفت. به حرفم اعتماد کنید. بهتر ‌است راجع به این که چقدر انجام این فعالیت ها بامزه و دوست داشتنی هستند، حرف بزنید.' ;
        " ;
    }
    elseif($D >= 406 && $D <= 505 ) {
        $arrayAnalyze .= " analyze[3][0] = 'شما در این مسیر و انجام فعالیت‌های لازم جهت رسیدن به هدف، استرس خیلی زیادی را تجربه می‌کنید که می‌توان گفت حتی غیر‌طبیعی‌است. در ‌نظر داشته باشید که استرس تا 25 درصد، تقریبا عادی‌‌است اما همان‌طور که می بینید درصد شما بیشتر از این میزان است. شما می توانید میزان آن را در ناحیه D گراف ببینید.' ;
                           analyze[3][1] = 'انرژی که درناحیه D گراف دیده می شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. انرژی استرس کارایی چندانی ندارد و میزان بهروری آن بسیار کم است. یعنی باعث می شود که در عمل به اندازه زمان و انرژی که برای انجام کار هزینه می کنیم، نتیجه نگیریم. فکر می کنم لازم نیست که اثرات ویرانگر استرس بر بدن و روان را توضیح بدهم.<br>شما برای حرکت در مسیر هدف استرس خیلی زیادی دارید. اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید این حدود $percent درصد از حداکثر مقدار خودش می باشد. این مقدار سطح خلاقیت و هوشمندی در کار را کاهش میدهد. این یک استرس ملتهب است که حداکثر مقدار خودش را هم رد کرده است. این حالت در دراز مدت هم به روحیه و هم به بدن شما آسیب می رساند. هی رفیق با این کار یه منبع واقعی استرس برای خودت دست و پا می کنی.' ;
                           analyze[3][2] = 'دلیلش ساده است . تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه هایی که به کار می برید فکر کنید و حس و حالتان را به یاد بیاورید. دلیل این مقدار استرس این است که بیش از‌‌حد واگویه های منفی درباره اینکه انجام نشدن این کارها یا نرسیدن به هدف چقدر بد و خطرناک یا مضر است، دارید ودرمورد آن با خود یا دیگران خیلی زیاد حرف می زنید. اگر چه بنظر می آید این نوع مکالمات ذهنی باعث میشود به کاراهمیت بیشتری بدهید اما باور کنید به مشکلاتی که ایجاد می‌کند نمی ارزد و سطح خلاقیت و هوشمندی در کار را هم کاهش می دهد. این واگویه ها شما را تشویق خواهند کرد که وقت یا توجه زیادی به موضوع اختصاص بدهید اما این به این معنی نیست که نتیجه متناسبی هم ازآن خواهید گرفت.<br>راستش، این مقدار استرس آنقدرغیرطبیعی زیاد است که من احتمال می دهم هنگام پر کردن گراف دچار اشتباه شده باشید. یعنی بجای اینکه به این فکر کنید که چقدر انجام ندادن کارهای لازم در مسیر هدف بد است به این فکر کرده باشید که چقدر نرسیدن به هدف بد است. اگر اینطور است، پیشنهاد می‌کنم دوباره گراف را بادقت بیشتری پر کنید. اما اگر درست پر کرده‌اید و به فعالیت در مسیر هدف فکر کرده‌اید و نه خود هدف، پس باید بگویم شما حسابی از انجام ندادن این فعالیت ها بدتان می آید.اما سوال مهم این است که این میزان بد‌آمدن چقدر به پیشرفت در مسیر کمک می‌کند؟' ;
                           analyze[3][3] = 'شما برای حرکت در مسیر هدف به این همه واگویه و گفتگو نگران کننده نیاز ندارید. آنها واقعا کمکی نمی کنند. به کمتر از آن هم نیازی نیست.بدون این گفتگوها، می توانید مطمئن باشید با گذاشتن وقت کمتر نتیجه بهتری خواهید گرفت. به حرفم اعتماد کنید. بهتر ‌است راجع به این که چقدر انجام این فعالیت ها بامزه و دوست داشتنی هستند، حرف بزنید.' ;
        " ;
    }
    elseif($D >= 506 && $D <= 605 ) {
        $arrayAnalyze .= " analyze[3][0] = 'شما در این مسیر و انجام فعالیت های لازم  جهت رسیدن به هدف ، استرس عجیبی دارید یا شاید بهتر بگم بشکلی غیر طبیعی زیاد. در ‌نظر داشته باشید که استرس تا 25 درصد، تقریبا عادی‌‌است اما همان‌طور که می بینید درصد شما بیشتر از این میزان است. شما می توانید میزان آن را در ناحیه  D گراف ببینید.' ;
                           analyze[3][1] = 'انرژی که درناحیه D گراف دیده می شود انرژی بسیار مهمی است. این انرژی، ما را برای انجام فعالیت در مسیر رسیدن به هدف تحریک و تشویق می‌کند اما اثری خوبی برروی روحیه ندارد برای همین آن را انرژی پیش برنده منفی می دانیم. این انرژی، ناشی از احساسات و افکار بدی است که نسبت به انجام ندادن کارها داریم و آن را بصورت استرس تجربه می کنیم. انرژی استرس کارایی چندانی ندارد و میزان بهره‌وری آن بسیار کم است. یعنی باعث می شود که در عمل به اندازه زمان و انرژی که برای انجام کار هزینه می‌کنیم، نتیجه نگیریم. فکر می‌کنم لازم نیست که اثرات ویرانگر استرس بر بدن و روان را توضیح بدهم.<br>شما برای حرکت در مسیر هدف استرس خیلی زیادی دارید. اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید این حدود $percent درصد از حداکثر مقدار خودش می باشد. این مقدار سطح خلاقیت و هوشمندی در کار را کاهش می‌دهد. این یک استرس کاملا ملتهب است که حداکثر مقدار خودش را هم رد کرده است. این حالت در دراز مدت هم به روحیه و هم به بدن شما آسیب می رساند. هی رفیق با این کار یه منبع واقعی استرس برای خودت دست و پا می کنی.' ;
                           analyze[3][2] = 'دلیلش ساده است. تنها لازم است به نوع مکالمات خود، چه درونی و چه بیرونی دقت کنید. به واژه هایی که به کار می برید فکر کنید و حس و حالتان را به یاد بیاورید. دلیل این مقدار استرس این است که بیش از‌‌حد واگویه های منفی درباره اینکه انجام نشدن این کارها یا نرسیدن به هدف چقدر بد و خطرناک یا مضر است، دارید ودرمورد آن با خود یا دیگران خیلی زیاد حرف می زنید. اگر چه بنظر می آید این نوع مکالمات ذهنی باعث میشود به کاراهمیت بیشتری بدهید اما باور کنید به مشکلاتی که ایجاد می‌کند نمی ارزد و سطح خلاقیت و هوشمندی در کار را هم کاهش می دهد. این واگویه ها شما را تشویق خواهند کرد که وقت یا توجه زیادی به موضوع اختصاص بدهید اما این به این معنی نیست که نتیجه متناسبی هم ازآن خواهید گرفت.<br>راستش، این مقدار استرس آنقدرغیرطبیعی زیاد است که من احتمال می‌دهم هنگام پر کردن گراف دچار اشتباه شده باشید. یعنی بجای اینکه به این فکر کنید که چقدر انجام ندادن کارهای لازم در مسیر هدف بد است به این فکر کرده باشید که چقدر نرسیدن به هدف بد است. اگر اینطوراست، پیشنهاد می‌کنم دوباره گراف را با دقت بیشتری پر کنید. اما اگر درست پر کرده‌اید و به فعالیت در مسیر هدف فکر کرده‌اید و نه خود هدف، پس باید بگویم شما حسابی از انجام ندادن این فعالیت ها بدتان می آید و نفرت دارید. اما سوال مهم این است که این میزان بد‌آمدن چقدر به پیشرفت در مسیر کمک می‌کند؟' ;
                           analyze[3][3] = 'شما برای حرکت در مسیر هدف به این همه واگویه و گفتگو نگران کننده نیاز ندارید. آنها واقعا کمکی نمی‌کنند. به کمتر از آن هم نیازی نیست.بدون این گفتگوها، می توانید مطمئن باشید با گذاشتن وقت کمتر نتیجه بهتری خواهید گرفت. به حرفم اعتماد کنید. بهتر ‌است راجع به این که چقدر انجام این فعالیت ها بامزه و دوست داشتنی هستند، حرف بزنید.' ;
        " ;
    }
    //echo '<pre>';print_r($percentArray);
    ////////////////    نیاز حسی    /////////////////////
    /////////////// A-B ///////////////////
    $x = $A - $B ;
    $percent = round(($x * 100) / $percentMaxRange, 0);
    $percentArray['A-B'] = $percent ;
    if($x <= -25 ) {
        $percent =round(((-1*$x)*100)/$percentMaxRange,0);
        $percentArray['A-B'] = $percent ;
        $arrayAnalyze .= " analyze[4][0] = 'نیاز حسی به حرکت در مسیر هدف و رضایت از آن' ;
                           analyze[4][1] = 'نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی ،سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی، رضایت است یعنی نشان می‌دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می‌گذارد. <br>مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می‌کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست.' ;
                           analyze[4][2] = 'نتیجه فعلی گراف برای شما' ;
                           analyze[4][3] = 'اکنون و با ذهنیتی که در حال حاضر درباره فعالیت‌ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  $percent درصد است. <br>اوه !! این عدد منفی است. یعنی با این برنامه ای که در سر دارید، حرکت به سمت هدف، نه تنها قادر به ارضای نیازهای درونی شما نیست که برعکس حال شما را بدتر نیز خواهد کرد. حرکت در این مسیر باعث می‌شود که در مجموع احساس عدم‌رضایت کنید و این حالت به هیچ‌وجه برای رسیدن به هدف خوب نیست.<br>برای افزایش سطح رضایت از انجام دادن  کارهایی که لازم است برای رسیدن به هدف  انجام بدهید به شما پیشنهاد می‌کنم:<br> واگویه‌های مثبت نسبت به انجام دادن کارهای لازم برای رسیدن به هدف را افزایش دهید و واگویه‌های منفی، بازهم نسبت به انجام دادن آن کارها را کاهش دهید.<br> توجه داشته باشید که این دو به هیچ‌وجه با یکدیگر یکی نیستند. احساسات منفی شما نسبت به فعالیت‌ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می‌باشد.لازم است که واگویه‌های منفی را به نحوی خنثی کنید.<br>شاید برای این کار به مشاوره دقیق تری نیاز داشته باشید.' ;
        " ;
    }
    elseif($x > -25 && $x <= 25 ) {
        if($x<0){
            $percent =round(((-1*$x)*100)/$percentMaxRange,0);
            $percentArray['A-B'] = $percent ;
        }
        $arrayAnalyze .= " analyze[4][0] = 'نیاز حسی به حرکت در مسیر هدف و رضایت از آن' ;
                           analyze[4][1] = 'نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی، سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی، رضایت است یعنی نشان می دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می‌گذارد. مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست.' ;
                           analyze[4][2] = 'نتیجه فعلی گراف برای شما' ;
                           analyze[4][3] = 'اکنون و با ذهنیتی که در حال حاضر درباره فعالیت‌ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  $percent درصد است. <br>اوه! این مقدار یعنی هیچی. پس با این برنامه ای که در سر دارید، حرکت به سمت هدف، نمی تواند به ارضای نیازهای درونی شما کمکی بکند. حرکت در این مسیر باعث نمی‌شود که در مجموع احساس رضایت کنید البته خوشبختانه باعث ایجاد حس عدم رضایت هم نمی‌شود. به عبارت دیگر انجام دادن و یا ندادن این فعالیت‌ها برای شما علی‌السویه است که  این حالت چندان جالب نیست.<br>برای افزایش سطح رضایت از انجام دادن  کارهایی که لازم است برای رسیدن به هدف  انجام بدهید به شما پیشنهاد می‌کنم:<br> واگویه‌های مثبت نسبت به انجام دادن کارهای لازم برای رسیدن به هدف را افزایش دهید و واگویه‌های منفی، بازهم نسبت به انجام دادن آن کارها را کاهش دهید.<br> توجه داشته باشید که این دو به هیچ‌وجه با یکدیگر یکی نیستند. احساسات منفی شما نسبت به فعالیت ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می‌باشد.لازم است که واگویه‌های منفی را به نحوی خنثی کنید. شاید برای این کار به مشاوره دقیق‌تری نیاز داشته باشید.' ;
        " ;
    }
    elseif($x >= 26  && $x <= 100 ) {
        $arrayAnalyze .= " analyze[4][0] = 'نیاز حسی به حرکت در مسیر هدف و رضایت از آن' ;
                           analyze[4][1] = 'نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی ،سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی رضایت است یعنی نشان می‌دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می‌گذارد. مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می‌کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست.' ;
                           analyze[4][2] = 'نتیجه فعلی گراف برای شما' ;
                           analyze[4][3] = 'اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  $percent درصد است. <br>خب این میزان خیلی کم است. یعنی با این برنامه ای که در سر دارید، حرکت به سمت هدف، می تواند کمک خیلی کمی به ارضای نیازهای درونی شما  کند. درمجموع حرکت در این مسیر باعث نمی شود که  احساس رضایت کنید اما خوشبختانه  باعث ایجاد حس عدم رضایت هم نمی‌شود. دوست من این وضعیت برای رسیدن به هدف خیلی جالب نیست.<br>برای افزایش سطح رضایت از انجام دادن  کارهایی که لازم است برای رسیدن به هدف  انجام بدهید به شما پیشنهاد می کنم:<br> واگویه‌های مثبت نسبت به انجام دادن کارهای لازم برای رسیدن به هدف را افزایش دهید و واگویه های منفی، بازهم نسبت به انجام دادن آن کارها را کاهش دهید.<br> توجه داشته باشید که این دو به هیچ وجه با یکدیگر یکی نیستند. احساسات منفی شما نسبت به فعالیت ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می باشد.لازم است که واگویه‌های منفی را به نحوی خنثی کنید. شاید برای این‌کار به مشاوره دقیق‌تری نیاز داشته باشید.' ;
        " ;
    }
    elseif($x >= 101  && $x < 203 ) {
        $arrayAnalyze .= " analyze[4][0] = 'نیاز حسی به حرکت در مسیر هدف و رضایت از آن' ;
                           analyze[4][1] = 'نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی ،سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی رضایت است یعنی نشان می دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می‌گذارد. مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست.' ;
                           analyze[4][2] = 'نتیجه فعلی گراف برای شما' ;
                           analyze[4][3] = 'اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  $percent درصد است. <br>خب این میزان بدک نیست. یعنی با این برنامه ای که در سر دارید، حرکت به سمت هدف، می تواند به ارضای نیازهای درونی شما کمک کند. حرکت در این مسیر باعث می‌شود که در مجموع احساس رضایت کنید البته نه چندان زیاد اما باز هم خوب است. ما ترجیح می‌دهیم که اوضاع بگونه ای باشد که فعالیت های روزانه منبع حس رضایت و ارضا درونی هم باشد. در حال حاضر شما در این وضعیت نیستید اما می توان آن را بهتر هم کرد.<br>برای افزایش سطح رضایت از انجام دادن کارهایی که لازم است برای رسیدن به هدف  انجام بدهید به شما پیشنهاد می کنم:<br> واگویه‌های مثبت نسبت به انجام دادن کارهای لازم برای رسیدن به هدف را افزایش دهید و واگویه های منفی، بازهم نسبت به انجام دادن آن کارها را کاهش دهید.<br> توجه داشته باشید که این دو به هیچ وجه با یکدیگر یکی نیستند. احساسات منفی شما نسبت به فعالیت‌ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می باشد.لازم است که واگویه های منفی را به نحوی خنثی کنید. شاید برای این کار به مشاوره دقیق تری نیاز داشته باشید.' ;
        " ;
    }
    elseif($x >= 203  && $x < 304 ) {
        $arrayAnalyze .= " analyze[4][0] = 'نیاز حسی به حرکت در مسیر هدف و رضایت از آن' ;
                           analyze[4][1] = 'نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی ،سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی رضایت است یعنی نشان می دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می‌گذارد. مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می‌کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست.' ;
                           analyze[4][2] = 'نتیجه فعلی گراف برای شما' ;
                           analyze[4][3] = 'اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  $percent درصد است. <br>خب این مقدارخوب است. یعنی با این برنامه ای که در سر دارید، حرکت به سمت هدف، می تواند به ارضای نیازهای درونی شما کمک محسوسی کند. حرکت در این مسیر باعث می شود که در مجموع احساس رضایت خوبی داشته باشید و این جای تبریک دارد. ما ترجیح می‌دهیم که اوضاع بگونه ای باشد که فعالیت های روزانه منبع حس رضایت و ارضا درونی هم باشد. شما در حال حاضردر وضعیت خوبی هستید اما می توانید آن را بهتر کنید.<br>من نمی‌دانم که از نظر بیرونی چقدر به این فعالیت‌ها نیاز دارید ( فعالیت را می گویم و نه هدف را) اما می‌دانم که از نظر حسی به آن نیاز دارید. این وضع نتیجه ی وجود واگویه های مثبت نسبت به انجام دادن کارهای لازم و اندک بودن واگویه های منفی بازهم نسبت به همان کارهاست.توجه داشته باشید که این دو به هیچ وجه با یکدیگر یکی نیستند.<br>احساسات منفی شما نسبت به فعالیت ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می باشد.' ;
        " ;
    }
    elseif($x >= 304 && $x <= 455 ) {
        $arrayAnalyze .= " analyze[4][0] = 'نیاز حسی به حرکت در مسیر هدف و رضایت از آن' ;
                           analyze[4][1] = 'نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی ،سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی رضایت است یعنی نشان می دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می گذارد. مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست.' ;
                           analyze[4][2] = 'نتیجه فعلی گراف برای شما' ;
                           analyze[4][3] = 'اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  $percent درصد است. <br>خب این مقدارعالیست. یعنی با این برنامه ای‌که در سر دارید، حرکت به سمت هدف، می تواند به ارضای نیازهای درونی شما کمک درست و حسابی کند. حرکت در این مسیر باعث می شود که در مجموع احساس رضایت بسیارخوبی داشته باشید و این واقعا جای تبریک دارد چرا که ما ترجیح می‌دهیم که اوضاع بگونه ای باشد که فعالیت های روزانه منبع حس رضایت و ارضا درونی هم باشد که در مورد شما دقیقا به همین شکل است.<br>من نمی دانم که از نظر بیرونی چقدر به این فعالیت‌ها نیاز دارید ( فعالیت را می‌گویم و نه هدف را) اما می‌دانم که از نظر حسی به آن واقعا نیاز دارید. این وضع نتیجه‌ی وجود واگویه های مثبت نسبت به انجام دادن کارهای لازم و اندک بودن واگویه های منفی بازهم نسبت به همان کارهاست.توجه داشته باشید که این دو به هیچ وجه با یکدیگر یکی نیستند.احساسات منفی شما نسبت به فعالیت ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می باشد.' ;
        " ;
    }
    elseif($x > 455 && $x <= 605 ) {
        $arrayAnalyze .= " analyze[4][0] = 'نیاز حسی به حرکت در مسیر هدف و رضایت از آن' ;
                           analyze[4][1] = 'نیاز حسی به حرکت در مسیر هدف‌ به این معناست که انجام دادن کارهایی که برای رسیدن به هدف لازم است، چقدر در راستای ارضای نیازهای درونی و روحی شما است. نیاز حسی در کنار دو فاکتور علاقه و توانایی ،سومین فاکتور اصلی برای هماهنگی حسی می باشد. به عبارت دیگر، این نیاز، تعیین کننده فاکتور بسیار کلیدی رضایت است یعنی نشان می دهد که چقدر از انجام این کار می توانید رضایت‌خاطر داشته باشید.<br>بطور کلی نیاز حسی اشاره به این نکته مهم دارد که رابطه شما با موضوع چه اثری بر موجودیت حسی شما می‌گذارد. مثبت بودن این اثر به این معناست که شما به آن نیاز دارید و این کار شما را ارضا می‌کند اما اگر این اثر منفی باشد، یعنی به آن نیازی ندارید و این کار در جهت ارضای نیازهای شما نیست.' ;
                           analyze[4][2] = 'نتیجه فعلی گراف برای شما' ;
                           analyze[4][3] = 'اکنون و با ذهنیتی که در حال حاضر درباره فعالیت ها دارید، نیاز حسی شما به حرکت در مسیر هدف مدنظرتان  $percent درصد است.<br>خب این مقدار بیشتر از خوب است. یعنی با این برنامه ای که در سر دارید، حرکت به سمت هدف، می تواند کاملا به ارضای نیازهای درونی شما کمک کند. <br>حرکت در این مسیر باعث می‌شود که در مجموع احساس رضایت بیش از حدی داشته باشید . این وضعیت از یک نظر جای تبریک دارد چرا که ما ترجیح می‌دهیم که اوضاع بگونه‌ای باشد که فعالیت های روزانه منبع حس رضایت و ارضا درونی هم باشد که در مورد شما دقیقا به همین شکل است. اما ما شاهد التهاب هم هستیم. یعنی در مقایسه با حالت متعادل،این مقدار خارج از حد تعادل است واین نشان می‌دهد که هیجان‌زدگی غیر طبیعی وجود دارد. <br>توصیه ما همیشه حفظ تعادل در عالی‌ترین سطح می باشد. وجود التهاب در اینجا هشداریست مبنی بر اینکه  به این فعالیت آنقدر هم که فکر می‌کنید نیاز ندارید. منظورم این است که به آن نیاز دارید ولی نه تا این حد. فقط آگاه باشید که  بخشی از نیازی که حس می‌کنید واقعی نیست. (همان مقدار که از صددرصد بیشتر است)<br>این وضع نتیجه ی وجود واگویه های زیادی مثبت نسبت به انجام دادن کارهای لازم و اندک بودن واگویه های منفی بازهم نسبت به همان کارها می باشد. توجه داشته باشید که این دو به هیچ وجه با یکدیگر یکی نیستند.احساسات منفی شما نسبت به فعالیت‌ها ماهیتا مستقل از احساسات مثبت شما نسبت به آنها می‌باشد.' ;
        " ;
    }
    /////////////// C-D ///////////////////
    $x = $C - $D ;
    $percent = round(($x * 100) / $percentMaxRange, 0);
    $percentArray['C-D'] = $percent ;
    if($x <= -100 ) {
        $percent =round(((-1*$x)*100)/$percentMaxRange,0);
        $percentArray['C-D'] = $percent ;
        $arrayAnalyze .= " analyze[5][0] = 'نیاز حسی به ترک فعالیت وحرکت نکردن به سمت هدف' ;
                           analyze[5][1] = ' نیاز حسی به ترک فعالیت و حرکت نکردن به سمت هدف یعنی اینکه شما چقدر نیاز دارید که این کار را انجام ندهید یا به بیان بهتر چقدر ترک کردن مسیر و بی خیال شدن آن به ارضای نیازهای درونی شما کمک می‌کند. و در این مورد خاص بر اساس چیزهایی که به من گفتید،این مقدار  $percent  درصد است.<br> این بدین معناست که ترک کردن مسیر و انجام ندادن این فعالیت ها نه تنها کمکی به ارضای نیازهای درونی شما نمی کند ( باعث حس رضایت نمی‌شود) که حتی باعث ایجاد عدم رضایت می شود.' ;
                           analyze[5][2] = 'نتیجه فعلی گراف برای شما' ;
                           analyze[5][3] = 'طبق آنچه گفته شد می توان نتیجه گرفت که  موجودیت حسی شما واقعا نمی خواهد که این مسیر را بیخیال شود حتی اگر خود شما بخواهید. شاید تصور شما این است که  ترک مسیر منجر به  ایجاد نارضایتی درونی می‌شودکه برای موفقیتت می‌تواند خوب باشد.اما من نمی توانم بگویم خوب است. شخصا به عنوان دانش گراف حسی،( اگه قبول کنی به من بگی شخص!)ترجیح می دهم که این عدد نزدیک صفر باشد یعنی ترک کردن این فعالیت‌ها نه حال شما  را خراب کند و نه حال شما را خوب کند. <br>بله این واقعا بهتراست.' ;
        " ;
    }
    elseif($x > -100 && $x <= 100 ) {
        if($x<0){
            $percent =round(((-1*$x)*100)/$percentMaxRange,0);
            $percentArray['C-D'] = $percent ;
        }
        $arrayAnalyze .= " analyze[5][0] = 'نیاز حسی به ترک فعالیت وحرکت نکردن به سمت هدف' ;
                           analyze[5][1] = 'نیاز حسی به ترک فعالیت و حرکت نکردن به سمت هدف یعنی اینکه شما چقدر نیاز دارید که این کار را انجام ندهید یا به بیان بهتر چقدر ترک کردن مسیر و بی‌خیال شدن آن به ارضای نیاز‌های درونی شما کمک می کند. و در این مورد خاص بر اساس چیزهایی که به من گفتید، این مقدار  $percent  درصد است.<br> این بدین معناست که ترک کردن مسیر و انجام ندادن این فعالیت‌ها باعث  احساس رضایت چندانی  نمی‌شود و البته باعث عدم رضایت هم نمی‌شود.' ;
                           analyze[5][2] = 'نتیجه فعلی گراف برای شما' ;
                           analyze[5][3] = 'طبق آنچه گفته شد می توان نتیجه گرفت که  موجودیت حسی شما واقعا نمی‌خواهد که این مسیر را بی‌خیال شود حتی اگر خود شما بخواهید. شاید تصور شما این است که  ترک مسیر منجر به  ایجاد نارضایتی درونی می‌شودکه برای موفقیتت می تواند خوب باشد.اما من نمی توانم بگویم خوب است. شخصا به عنوان دانش گراف حسی،( اگه قبول کنی به من بگی شخص!)ترجیح می دهم که این عدد نزدیک صفر باشد یعنی ترک کردن این فعالیت ها نه حال شما  را خراب کند و  نه حال شما را  خوب کند. <br>بله این واقعا بهتراست. جای تبریک دارد چراکه شما در چنین وضعیتی قرار دارید. <br>پس تبریک من را بپذیرید.' ;
        " ;
    }
    elseif($x > 100  && $x <= 405 ) {
        $arrayAnalyze .= " analyze[5][0] = 'نیاز حسی به ترک فعالیت وحرکت نکردن به سمت هدف' ;
                           analyze[5][1] = ' نیاز حسی به ترک فعالیت و حرکت نکردن به سمت هدف یعنی اینکه شما چقدر نیاز دارید که این کار را انجام ندهید یا به بیان بهتر چقدر ترک کردن مسیر و بی خیال شدن آن به ارضای نیاز های درونی شما کمک می کند. و در این مورد خاص بر اساس چیزهایی که به من گفتید، این مقدار  $percent  درصد است. این بدین معناست که ترک کردن مسیر و انجام ندادن این فعالیت ها باعث میشود احساس رضایت کنید.' ;
                           analyze[5][2] = 'نتیجه فعلی گراف برای شما' ;
                           analyze[5][3] = 'اینکه ترک این فعالیت‌ها در راستای ارضای نیاز های درونی شما باشد خبر خوبی برای حرکت در مسیر هدف محسوب نمی‌شود اما به خودی خود هم نگران کننده نیست. چون چیزی که بیشتر اهمیت دارد این است که چقدر به انجام این فعالیت ها احساس نیاز دارید.<br> شخصا به عنوان دانش گراف حسی،( اگه قبول کنی به من بگی شخص!)ترجیح می دهم که این عدد نزدیک صفر باشد یعنی ترک کردن این فعالیت ها نه حال شما  را خراب کند و  نه حال شما را  خوب کند.این واقعا بهترین حالت است. <br>اما الان وضعیت شما به این شکل نیست. چون حجم واگویه هایی از جنس «چقدر دوست دارم این کار رو انجام ندم» خیلی بیشتر از واگویه هایی است که می گویند «چقدر ترک کردن این کار می تواد بد باشه».' ;
        " ;
    }
    elseif($x > 405  && $x <= 605 ) {
        $arrayAnalyze .= " analyze[5][0] = 'نیاز حسی به ترک فعالیت وحرکت نکردن به سمت هدف' ;
                           analyze[5][1] = ' نیاز حسی به ترک فعالیت و حرکت نکردن به سمت هدف یعنی اینکه شما چقدر نیاز دارید که این کار را انجام ندهید یا به بیان بهتر چقدر ترک کردن مسیر و بی‌خیال شدن آن به ارضای نیاز های درونی شما کمک می‌کند. و در این مورد خاص بر اساس چیزهایی که به من گفتید، این مقدار  $percent  درصد است.<br> این بدین معناست که ترک کردن مسیر و انجام ندادن این فعالیت ها باعث می‌شود به شکل غیر طبیعی  احساس رضایت کنید.' ;
                           analyze[5][2] = 'نتیجه فعلی گراف برای شما' ;
                           analyze[5][3] = 'اینکه ترک این فعالیت ها در راستای ارضای نیاز های درونی شما باشد خبر خوبی برای حرکت در مسیر هدف محسوب نمی‌شود .<br> شخصا به عنوان دانش گراف حسی،( اگه قبول کنی به من بگی شخص!)ترجیح می‌دهم که این عدد نزدیک صفر باشد یعنی ترک کردن این فعالیت ها نه حال شما  را خراب کند و  نه حال شما را  خوب کند.این واقعا بهترین حالت است. <br>اما الان اصلا اینجوری نیست. چون حجم واگویه‌هایی که با خود دارید که می گویند«چقدر دوست دارم این کار رو انجام ندم» خیلی بیشتر از واگویه‌هایی است که می‌گویند«چقدر ترک کردن این کار می تواند بد باشه».' ;
        " ;
    }/////////////// A-B و C-D ///////////////////
    $x1 = $A - $B ;
    $x2 = $C - $D ;
    if($x1 < -25  && $x2 <= -100 ) {
        $arrayAnalyze .= " analyze[6][0] = 'خوب حالا بیا نیاز‌ها رو با هم مقایسه کنیم' ;
                           analyze[6][1] = 'همینطورکه پیداست اینجا وضعیت خاصی وجود دارد. وضعیتی که نشان می‌دهد هم حرکت کردن به سمت هدف برخلاف نیازهای درونی شماست و هم ترک کردن این مسیر! نه انجام دادن این کار به بهبود حسی شما کمکی می‌کند و نه ترک کردن آن، پس الان هیچ تصمیمی همراستا با نیازهای درونی شما نیست. <br>دوست من این وضعیت سختی است. معنی آن این است که در این حالت هیچ انتخابی در دنیای بیرون، شما را راضی نخواهد کرد. <br>پس ابتدا نیاز دارید قبل از هر اقدام عملی گراف خود را تغییر بدهید. کاری که با تغییر واگویه ها و مکالمات ذهنی امکان پذیر است.<br>اگه می خواهید که این کار را ادامه دهید لازم است حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر را آرام کنید.<br>ولی اگه می خواهید این مسیر را ترک کنید لازم است که حرف های منفی نسبت به هدف را تقویت کنی و بقیه ناحیه ها را آرام کنید.<br>البته بهتراست که قبل از تصمیم گیری، به تحلیل من درباره توانایی حسی هم گوش کنی.' ;
        " ;
    }
    elseif($x1 < -25 && ($x2 > -100 && $x2 <=100 )) {
        $arrayAnalyze .= " analyze[6][0] = 'خوب حالا بیا نیاز‌ها رو با هم مقایسه کنیم' ;
                           analyze[6][1] = 'ما در اینجا با این وضعیت مواجه هستیم که حرکت در این مسیر برخلاف نیازهای درونی شماست در حالی که ترک کردن این مسیر نه به نفع این نیازها است و نه برخلاف آنها. پس در حال حاضر نیازهای حسی شما به گونه‌ای هستند که اوضاع اندکی به نفع ترک فعالیت است.<br>اگر می‌خواهید که این کار را ادامه بدهید لازم است که حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر را آرام کنید. یعنی گفتگوهای منفی درباره انجام دادن، گفتگوهای مثبت درباره انجام ندادن وگفتگوهای منفی نسبت به انجام ندادن همگی کاهش پیدا کنند.<br>ولی اگر می‌خواهید این مسیر را ترک کنید لازم است که حرف های منفی نسبت به هدف را تقویت کنید و بقیه ناحیه ها را آرام کنید. <br>البته بهتر است که قبل از تصمیم گیری به تحلیل من درباره توانایی حسی هم گوش کنید.' ;
        " ;
    }
    elseif($x1 < -25 && $x2 > 100 ) {
        $arrayAnalyze .= " analyze[6][0] = 'خوب حالا بیا نیاز‌ها رو با هم مقایسه کنیم' ;
                           analyze[6][1] = 'حرکت در این مسیر برخلاف نیازهای درونی شماست  و از سوی دیگر ترک کردن این مسیر در جهت ارضای این نیازها است. پس در حال حاضر از نظر نیازهای حسی اوضاع به نفع ترک فعالیت است.<br>اگر می‌خواهید که این کار را ادامه بدهید لازم است که حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر  را آرام کنید. یعنی گفتگوهای منفی درباره انجام دادن، گفتگوهای مثبت درباره انجام ندادن و گفتگوهای منفی نسبت به انجام ندادن همگی کاهش پیدا کنند.<br>ولی اگر می خواهید این مسیر را ترک کنید لازم است که حرف‌های منفی نسبت به هدف را تقویت کنید و بقیه ناحیه ها را آرام کنید. <br>البته بهتر است که قبل از تصمیم گیری، به تحلیل من درباره توانایی حسی خود هم گوش کنید.' ;
        " ;
    }
    elseif(($x1 >= -25 && $x1 <= 25) && $x2 <= -100 ) {
        $arrayAnalyze .= " analyze[6][0] = 'خوب حالا بیا نیاز‌ها رو با هم مقایسه کنیم' ;
                           analyze[6][1] = 'از یک سو حرکت در این مسیر برای نیازهای درونی شماعلی السویه است واز سوی دیگر حرکت نکردن در این مسیر، در جهت خلاف ارضای این نیازها است. پس در حال حاضر از نظر نیازهای حسی اوضاع کمی به نفع انجام فعالیت است.<br>اگر می‌خواهید که این کار را ادامه بدهید لازم است که حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر  را آرام کنید. یعنی گفتگوهای منفی درباره انجام دادن، گفتگوهای مثبت درباره انجام ندادن و گفتگوهای منفی نسبت به انجام ندادن همگی کاهش پیدا کنند.<br>ولی اگه می خواهید این مسیر را ترک کنید لازم است که حرف های منفی نسبت به هدف را تقویت کنید و بقیه ناحیه ها را آرام کنید. <br>البته بهتر است که قبل از تصمیم گیری، به تحلیل من درباره توانایی حسی خود هم گوش کنید.' ;
        " ;
    }
    elseif(($x1 >= -25 && $x1 <= 25) && ($x2 > -100 && $x2 <= 100 )) {
        $arrayAnalyze .= " analyze[6][0] = 'خوب حالا بیا نیاز‌ها رو با هم مقایسه کنیم' ;
                           analyze[6][1] = 'هم حرکت کردن و هم حرکت نکردن در این مسیر، هردو برای نیازهای درونی شماعلی السویه است. شما هدف و فعالیتی را انتخاب کرده‌اید که بود و نبودش تاثیر معنی داری بر موجودیت حس شما نمی‌گذارد. این بی تفاوتی چندان جالب نیست.حالت بهتر این است که حرکت در مسیر روی موجودیت حسی اثر ارضا کننده بگذارد.<br>اگر می‌خواهید که این کار را ادامه بدهید لازم است که حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر  را آرام کنید. یعنی گفتگوهای منفی درباره انجام دادن، گفتگوهای مثبت درباره انجام ندادن و گفتگوهای منفی نسبت به انجام ندادن همگی کاهش پیدا کنند.<br>ولی اگر می خواهید این مسیر را ترک کنید لازم است که حرف های منفی نسبت به هدف را تقویت کنید و بقیه ناحیه ها را آرام کنید.<br>البته بهتر است که قبل از تصمیم گیری، به تحلیل من درباره توانایی حسی خود هم گوش کنید.' ;
        " ;
    }
    elseif(($x1 >= -25 && $x1 <= 25) && $x2 > 100 ) {
        $arrayAnalyze .= " analyze[6][0] = 'خوب حالا بیا نیاز‌ها رو با هم مقایسه کنیم' ;
                           analyze[6][1] = 'حرکت در این مسیر برای نیازهای درونی شماعلی السویه است ولی از سوی دیگر حرکت نکردن در این مسیر در جهت ارضای این نیازها است. پس در حال حاضر از نظر نیازهای حسی،اوضاع به نفع انجام ندادن فعالیت است.<br>اگر می‌خواهید که این کار را ادامه بدهید لازم است که حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر  را آرام کنید. یعنی گفتگوهای منفی درباره انجام دادن، گفتگوهای مثبت درباره انجام ندادن و گفتگوهای منفی نسبت به انجام ندادن همگی کاهش پیدا کنند.<br>ولی اگر می‌خواهید این مسیر را ترک کنید لازم است که حرف‌های منفی نسبت به هدف را تقویت کنید و بقیه ناحیه‌ها را آرام کنید.<br>البته بهتر است که قبل از تصمیم گیری، به تحلیل من درباره توانایی حسی خود هم گوش کنید.' ;
        " ;
    }
    elseif($x1 > 25  && $x2 <= -100 ) {
        $arrayAnalyze .= " analyze[6][0] = 'خوب حالا بیا نیاز‌ها رو با هم مقایسه کنیم' ;
                           analyze[6][1] = 'از یک سو حرکت در این مسیر برای نیازهای درونی خوب است و از سوی دیگر حرکت نکردن در این مسیر در خلاف جهت ارضای این نیازها است. پس در حال حاضر از نظر نیازهای حسی، اوضاع کاملا به نفع انجام دادن فعالیت است.' ;
        " ;
    }
    elseif($x1 > 25 && ($x2 > -100 && $x2 <= 100 )) {
        $arrayAnalyze .= " analyze[6][0] = 'خوب حالا بیا نیاز‌ها رو با هم مقایسه کنیم' ;
                           analyze[6][1] = 'از یک سو حرکت در این مسیر برای نیازهای درونی شما خوب است و از سوی دیگر حرکت نکردن در این مسیر برای نیازهای موجودیت حسی شما نه بد است و نه خوب. پس در حال حاضر از نظر نیازهای حسی، اوضاع به نفع انجام دادن فعالیت است.' ;
        " ;
    }
    elseif($x1 > 25  && $x2 > 100 ) {
        $arrayAnalyze .= " analyze[6][0] = 'خوب حالا بیا نیاز‌ها رو با هم مقایسه کنیم' ;
                           analyze[6][1] = 'از یک سو هم حرکت در این مسیر برای نیازهای درونی شما خوب است و از سوی دیگر حرکت نکردن  هم در این مسیر برای نیازهای موجودیت حسی شما خوب است. یعنی، چه در مسیر هدف، فعالیت روزانه انجام بدهی و چه انجام ندهی، در هرحال موجودیت حسی شما حال خوبی دارد و به اصطلاح  حال می‌کند. این وضع جالبی‌است که به شما این امکان را می‌دهد که بدون استرس انتخاب کنید.<br>اگر می‌خواهید که این کار را ادامه بدهید لازم است که حرف های مثبت نسبت به انجام دادن را تقویت کنید و ناحیه های دیگر  را آرام کنید. یعنی گفتگوهای منفی درباره انجام دادن، گفتگوهای مثبت درباره انجام ندادن و گفتگوهای منفی نسبت به انجام ندادن همگی کاهش پیدا کنند.<br>ولی اگر می‌خواهید این مسیر را ترک کنید لازم است که حرف‌های منفی نسبت به هدف را تقویت کنید و بقیه ناحیه‌ها را آرام کنید.<br>البته بهتر است که قبل از تصمیم گیری، به تحلیل من درباره توانایی حسی خود هم گوش کنید.' ;
        " ;
    }
    /////////////// (A-D)-(B+C) ///////////////////
//    $x = ($A-$D)-($B+$C) ;
//    $percentMaxRange2 = 810 ;
//    $percent = round(((-1*$x) * 100) / $percentMaxRange2, 0);
//    $percent = round(($x * 100) / $percentMaxRange, 0);
//    if($x <= -25 ) {
//        $percent =round(((-1*$x)*100)/$percentMaxRange,0);
//        $arrayAnalyze .= " analyze[6][0] = '' ;
//                           analyze[6][1] = '' ;
//                           analyze[6][2] = '' ;
//                           analyze[6][3] = '' ;
//        " ;
//    }
//    elseif($x > -25 && $x <= 25 ) {
//        if($x<0){
//            $percent =round(((-1*$x)*100)/$percentMaxRange,0);
//        }
//        $arrayAnalyze .= " analyze[6][0] = '' ;
//                           analyze[6][1] = '' ;
//                           analyze[6][2] = '' ;
//                           analyze[6][3] = '' ;
//        " ;
//    }
//    elseif($x >= 26  && $x <= 100 ) {
//        $arrayAnalyze .= " analyze[6][0] = '' ;
//                           analyze[6][1] = '' ;
//                           analyze[6][2] = '' ;
//                           analyze[6][3] = '' ;
//        " ;
//    }
//    elseif($x >= 101  && $x < 203 ) {
//        $arrayAnalyze .= " analyze[6][0] = '' ;
//                           analyze[6][1] = '' ;
//                           analyze[6][2] = '' ;
//                           analyze[6][3] = '' ;
//        " ;
//    }
//    elseif($x >= 203  && $x < 304 ) {
//        $arrayAnalyze .= " analyze[6][0] = '' ;
//                           analyze[6][1] = '' ;
//                           analyze[6][2] = '' ;
//                           analyze[6][3] = '' ;
//        " ;
//    }
//    elseif($x >= 304 && $x <= 455 ) {
//        $arrayAnalyze .= " analyze[6][0] = '' ;
//                           analyze[6][1] = '' ;
//                           analyze[6][2] = '' ;
//                           analyze[6][3] = '' ;
//        " ;
//    }
//    elseif($x > 455 && $x <= 605 ) {
//        $arrayAnalyze .= " analyze[6][0] = '' ;
//                           analyze[6][1] = '' ;
//                           analyze[6][2] = '' ;
//                           analyze[6][3] = '' ;
//        " ;
//    }
    ////////////////  انرژی حسی/////////////////////
    /////////////// A+B+C+D ///////////////////
//    $x = $A+$B+$C+$D ;
//    $percentMaxRange2 = 1620 ;
//    if ($x >= 200  && $x <=700 ) {
//        $percent = round(($x * 100) / $percentMaxRange2, 0);
//        $result[5][$r++] = "میزان انرژی ذهنی شما برای انجام این کار $percent درصد است و این یعنی انجام این کار برای شما انرژی نرمالی به همراه دارد.";
//    }elseif ($x < 200 ) {
//        $percent = round(($x * 100) / $percentMaxRange2, 0);
//        $result[5][$r++] = "میزان انرژی ذهنی شما برای انجام این کار $percent درصد است که این یعنی انجام این کار برای شما انرژی ای به همراه ندارد.";
//    }elseif ($x > 700 ) {
//        $percent = round(($x * 100) / $percentMaxRange2, 0);
//        $result[5][$r++] = "میزان انرژی ذهنی شما برای انجام این کار $percent درصد است و این یعنی از انجام این کار به شکل ملتهبانه ای انرژی به دست میارید که به شکل غیر سازنده ای براتون عمل می کند.";
//    }
//}elseif($list['list']['topic']['topic_type']==2){
//    /////////////// A ///////////////////
//    if($A >=  $range_one_hundred[1]['min'] && $A < $range_one_hundred[1]['max']) {
//        $percent =round(($A*100)/$percentMaxRange,0);
//        $result[1][$r++] = "محبت درونی شما $A واحد از $percentMaxRange است که این «بسیار اندک» می باشد و این یعنی شما به میزان $percent درصد دوست اش داری و با وجود اینکه این میزان محبت درونی چندان شما را سر شوق نمی آورد ولی نشان می دهد این رابطه هنوز زنده است." ;
//    }
//    elseif($A >=  $range_one_hundred[2]['min'] && $A < $range_one_hundred[2]['max']) {
//        $percent =round(($A*100)/$percentMaxRange,0);
//        $result[1][$r++] = "محبت درونی شما $A واحد از $percentMaxRange است که این «به میزان متوسط» می باشد و این یعنی شما به میزان $percent درصد دوست اش داری که نشان می دهد این رابطه هنوز امیدوار کننده است." ;
//    }
//    elseif($A >=  $range_one_hundred[3]['min'] && $A < $range_one_hundred[3]['max']) {
//        $percent =round(($A*100)/$percentMaxRange,0);
//        $result[1][$r++] = "محبت درونی شما $A واحد از $percentMaxRange است و این یعنی شما به میزان $percent درصد دوست اش داری که این «تا حد خوبی» می باشد." ;
//    }
//    elseif($A >=  $range_one_hundred[4]['min'] && $A < $range_one_hundred[4]['max']) {
//        $percent =round(($A*100)/$percentMaxRange,0);
//        $result[1][$r++] = "محبت درونی شما $A واحد از $percentMaxRange است و این یعنی شما به میزان $percent درصد دوست اش داری که این «عالی» می باشد." ;
//    }
//    elseif($A >=  $range_one_hundred[5]['min'] && $A < $range_one_hundred[5]['max']) {
//        $percent =round(($A*100)/$percentMaxRange,0);
//        $result[1][$r++] = "محبت درونی شما $A واحد از $percentMaxRange است که این یعنی شما به میزان $percent درصد دوست اش داری که «بیش از حد نرمال» است." ;
//    }
//    elseif($A >=  $range_one_hundred[6]['min'] && $A < $range_one_hundred[6]['max']) {
//        $percent =round(($A*100)/$percentMaxRange,0);
//        $result[1][$r++] = "محبت درونی شما $A واحد از $percentMaxRange است که این یعنی شما به میزان $percent درصد دوست اش داری که «به شکل غیر طبیعی زیاد» است." ;
//    }
//    /////////////// B ///////////////////
//    if($B >=  $range_one_hundred[1]['min'] && $B < $range_one_hundred[1]['max']) {
//        $percent =round(($B*100)/$percentMaxRange,0);
//        $result[1][$r++] = "خشم درونی شما $B واحد از $percentMaxRange است که «چندان مهم» نمی باشد و این یعنی شما به میزان $percent درصد ازش بدتون میاد که این مقدار «چندان آزار دهنده» نمی باشد." ;
//    }
//    elseif($B >=  $range_one_hundred[2]['min'] && $B < $range_one_hundred[2]['max']) {
//        $percent =round(($B*100)/$percentMaxRange,0);
//        $result[1][$r++] = "خشم درونی شما $B واحد از $percentMaxRange است که «کمی از حد نرمال بیشتر» می باشد و این یعنی شما به میزان $percent درصد ازش بدتون میاد که با وجود اینکه «چندان زیاد» نیست ولی باید مورد توجه قرار گیرد." ;
//    }
//    elseif($B >=  $range_one_hundred[3]['min'] && $B < $range_one_hundred[3]['max']) {
//        $percent =round(($B*100)/$percentMaxRange,0);
//        $result[1][$r++] = "خشم درونی شما $B واحد از $percentMaxRange است که «می تواند به شما تقریبا آسیب برساند» و این یعنی شما به میزان $percent درصد ازش بدتون میاد که این مقدار «نسبتا زیاد» می باشد و اگر می خواهید به این رابطه ادامه دهید برای مکالمات ذهنی خود چاره ای بیاندیشید." ;
//    }
//    elseif($B >=  $range_one_hundred[4]['min'] && $B < $range_one_hundred[4]['max']) {
//        $percent =round(($B*100)/$percentMaxRange,0);
//        $result[1][$r++] = "خشم درونی شما $B واحد از $percentMaxRange است که «می تواند به شما آسیب جدی برساند» و این یعنی شما به میزان $percent درصد ازش بدتون میاد که که این مقدار «زیاد» می باشد و اگر می خواهید به این رابطه ادامه دهید برای مکالمات ذهنی خود چاره ای بیاندیشید." ;
//    }
//    elseif($B >=  $range_one_hundred[5]['min'] && $B < $range_one_hundred[5]['max']) {
//        $percent =round(($B*100)/$percentMaxRange,0);
//        $result[1][$r++] = "خشم درونی شما $B واحد از $percentMaxRange است که این یعنی شما به میزان $percent درصد ازش بدتون میاد که «بیش از حد نرمال» می باشد." ;
//    }
//    elseif($B >=  $range_one_hundred[6]['min'] && $B < $range_one_hundred[6]['max']) {
//        $percent =round(($B*100)/$percentMaxRange,0);
//        $result[1][$r++] = "خشم درونی شما $B واحد از $percentMaxRange است که این یعنی شما به میزان $percent درصد ازش بدتون میاد که «به شکل غیر طبیعی زیاد» است." ;
//    }
//    /////////////// C ///////////////////
//    if($C >=  $range_one_hundred[1]['min'] && $C < $range_one_hundred[1]['max']) {
//        $percent =round(($C*100)/$percentMaxRange,0);
//        $result[1][$r++] = "محبت او به شما $C واحد از $percentMaxRange است که این «بسیار اندک» می باشد و این یعنی او به میزان $percent درصد دوستت داره و با وجود اینکه میزان کمی است ولی نشان می دهد این رابطه هنوز زنده است." ;
//    }
//    elseif($C >=  $range_one_hundred[2]['min'] && $C < $range_one_hundred[2]['max']) {
//        $percent =round(($C*100)/$percentMaxRange,0);
//        $result[1][$r++] = "محبت او به شما $C واحد از $percentMaxRange است که این «به میزان متوسط» می باشد و این یعنی او به میزان $percent درصد دوستت داره که این نشان می دهد این رابطه هنوز امیدوار کننده است." ;
//    }
//    elseif($C >=  $range_one_hundred[3]['min'] && $C < $range_one_hundred[3]['max']) {
//        $percent =round(($C*100)/$percentMaxRange,0);
//        $result[1][$r++] = "محبت او به شما $C واحد از $percentMaxRange است و این یعنی او به میزان $percent درصد دوستت داره که این «تا حد خوبی» می باشد." ;
//    }
//    elseif($C >=  $range_one_hundred[4]['min'] && $C < $range_one_hundred[4]['max']) {
//        $percent =round(($C*100)/$percentMaxRange,0);
//        $result[1][$r++] = "محبت او به شما $C واحد از $percentMaxRange است و این یعنی او به میزان $percent درصد دوستت داره که این «عالی» می باشد." ;
//    }
//    elseif($C >=  $range_one_hundred[5]['min'] && $C < $range_one_hundred[5]['max']) {
//        $percent =round(($C*100)/$percentMaxRange,0);
//        $result[1][$r++] = "محبت او به شما $C واحد از $percentMaxRange است که این یعنی او به میزان $percent درصد دوستت داره که «بیش از حد نرمال» است." ;
//    }
//    elseif($C >=  $range_one_hundred[6]['min'] && $C < $range_one_hundred[6]['max']) {
//        $percent =round(($C*100)/$percentMaxRange,0);
//        $result[1][$r++] = "محبت او به شما $C واحد از $percentMaxRange است که این یعنی او به میزان $percent درصد دوستت داره که «به شکل غیر طبیعی زیاد» است." ;
//    }
//    /////////////// D ///////////////////
//    if($D >=  $range_one_hundred[1]['min'] && $D < $range_one_hundred[1]['max']) {
//        $percent =round(($D*100)/$percentMaxRange,0);
//        $result[1][$r++] = "استرس این رابطه در شما $D واحد از $percentMaxRange است که «نرمال» است و این یعنی شما فکر می کنی او به میزان $percent درصد از شما بدش میاد که «چندان ناراحت کننده» نمی باشد." ;
//    }
//    elseif($D >=  $range_one_hundred[2]['min'] && $D < $range_one_hundred[2]['max']) {
//        $percent =round(($D*100)/$percentMaxRange,0);
//        $result[1][$r++] = "استرس این رابطه در شما $D واحد از $percentMaxRange است که «اندکی از حد نرمال بیشتر» است و این یعنی شما فکر می کنی او به میزان $percent درصد از شما بدش میاد که «اندکی نگران کننده» می باشد." ;
//    }
//    elseif($D >=  $range_one_hundred[3]['min'] && $D < $range_one_hundred[3]['max']) {
//        $percent =round(($D*100)/$percentMaxRange,0);
//        $result[1][$r++] = "استرس این رابطه در شما $D واحد از $percentMaxRange است که «از حد نرمال بیشتر» است و این یعنی شما فکر می کنی او به میزان $percent درصد از شما بدش میاد که «باید مورد توجه» قرار بگیرد." ;
//    }
//    elseif($D >=  $range_one_hundred[4]['min'] && $D < $range_one_hundred[4]['max']) {
//        $percent =round(($D*100)/$percentMaxRange,0);
//        $result[1][$r++] = "استرس این رابطه در شما $D واحد از $percentMaxRange است که «به میزان قابل توجهی از حد نرمال بیشتر» است و این یعنی شما فکر می کنی او به میزان $percent درصد از شما بدش میاد که «نگران کننده» می باشد." ;
//    }
//    elseif($D >=  $range_one_hundred[5]['min'] && $D < $range_one_hundred[5]['max']) {
//        $percent =round(($D*100)/$percentMaxRange,0);
//        $result[1][$r++] = "استرس این رابطه در شما $D واحد از $percentMaxRange است که «خیلی از حد نرمال بیشتر» است و این یعنی شما فکر می کنی او به میزان $percent درصد از شما بدش میاد که «باید به طور جدی مورد توجه» قرار بگیرد." ;
//    }
//    elseif($D >=  $range_one_hundred[6]['min'] && $D < $range_one_hundred[6]['max']) {
//        $percent =round(($D*100)/$percentMaxRange,0);
//        $result[1][$r++] = "استرس این رابطه در شما $D واحد از $percentMaxRange است که « به شکل غیر طبیعی زیاد» است و این یعنی شما فکر می کنی او به میزان $percent درصد از شما بدش میاد که نیاز به درمان دارد." ;
//    }
}
?>
<style>
    .card-header{
        height: 50px !important;

    }
    .card-header>h4{
        line-height: 20px !important;
    }
</style>
<script>
    var categoryLinks = {<?php echo $labels; ?>};
</script>
<main>

    <div id="form_container" style="text-align: center;direction: rtl;">
        <div class="row" style="width: 100%;margin: 0 auto;padding: 0;float: none">
            <div class="col-md-8"></div>
            <div class="col-md-4 float-left">
                <div class="btn-group mt-2 float-left" dir="ltr">
                    <button type="button" class="btn btn-secondary disabled "title="تعیین وقت مشاوره">وقت مشاوره</button>
                    <button type="button" class="btn btn-secondary disabled" title="دریافت گزارش مخصوص مشاور">گزارش مشاور</button>
                    <a  href="/chart2/?topicId=<?php echo $list['list']['topic']['id'] ?>" class="btn btn-primary active"  title="چاپ گزارش جاری" >
                        صفحه چاپ
                    </a>
                </div>
            </div>
        </div>
        <!--        <a href="#" class="text-dark text-left pull-left" id="printText" onclick="javascript:window.print()" title="چاپ">-->
        <!--            <i class="fa fa-print fa-2x text-center"></i>-->
        <!--        </a>-->
        <!--        <br/>-->
        <div class="row" style="width: 100%;margin: 0 auto;padding: 0;float: none">
            <div class="col-md-12">
                <h4 class="card-header bg-primary text-white" >
                            <span class="text-center " dir="rtl">
                               <i class="fa fa-edit"></i> <?php echo $topicType.$list['list']['topic']['title']?>
                            </span>
                </h4>
            </div>

        </div>

        <div id="wizard_container">

            <div class="row mb-4">

                <div class="col-md-6">

                    <h4 class="header-caption text-center mt-5" ><?php echo $approach1 ; ?></h4>

                    <span class="badge badge-info badge-pill mt-5" style="width: 40px;height: 40px;line-height: 40px ;background-color: rgb(8, 191, 71);"><?php echo $A; ?></span>
                    <span style="font-size:20px;font-weight: bold;">A</span>
                    <div class="mt-5" id="container1" ></div>
                    <script language="JavaScript">
                        Highcharts.chart('container1', {

                            chart: {
                                polar: true
                            },

                            credits: {
                                enabled: false
                            },

                            title: {
                                text: ''
                            },

                            subtitle: {
                                text: ''
                            },

                            pane: {
                                startAngle: -90
                            },

                            xAxis: {
                                tickmarkPlacement: 'on',
                                startOnTick: true,
                                tickInterval: 36,
                                min: 0,
                                max: 360,
                                labels: {
                                    formatter: function() {
                                        return categoryLinks[this.value] ;
                                    },
                                    rotation: 0,
                                    reserveSpace: false,
                                    y: 0,
                                    x: 0,
                                    style: {
                                        align: 'right',
                                        verticalAlign: 'middle',
                                        fontSize: '10pt',
                                        fontWeight: 'bold'
                                    }
                                },
                                offset: 39
                            },
                            yAxis: {
                                min: 0,
                                max: 81
                            },

                            plotOptions: {
                                series: {
                                    pointStart: 0,
                                    pointInterval: 36,
                                    lineWidth: 10,
                                    fillOpacity: 0.1,
                                    dataLabels: {
                                        enabled: true,
                                        verticalAlign:'middle',
                                        align:'center',
                                        inside: false
                                    }
                                },
                                column: {
                                    pointPadding: 0,
                                    groupPadding: 0
                                }
                            },

                            series: [{
                                type: 'column',
                                name: 'Value',
                                data: [<?php echo $data1 ?>],
                                pointPlacement: 'between'
                                ,showInLegend : false
                            }
                            ]
                        });
                    </script>
                    <span class="badge badge-info badge-pill" style="width: 40px;height: 40px;line-height: 40px;background-color: rgba(255, 0, 0, 0.64)"><?php echo $B ?></span>

                    <span style="font-size:20px;font-weight: bold;">B</span>
                </div>

                <div class="col-md-6">
                    <h4 class="header-caption text-center mt-5" ><?php echo $approach2; ?></h4>

                    <span class="badge badge-info badge-pill mt-5" style="width: 40px;height: 40px;line-height: 40px;background-color: rgba(255, 0, 0, 0.64);"><?php echo $C; ?></span>
                    <span style="font-size:20px;font-weight: bold;">C</span>
                    <div class="mt-5" id="container2"></div>
                    <script language="JavaScript">
                        Highcharts.chart('container2', {

                            chart: {
                                polar: true
                            },

                            credits: {
                                enabled: false
                            },

                            title: {
                                text: ''
                            },

                            subtitle: {
                                text: ''
                            },

                            pane: {
                                startAngle: -90
                            },

                            xAxis: {
                                tickmarkPlacement: 'on',
                                startOnTick: true,
                                tickInterval: 36,
                                min: 0,
                                max: 360,
                                labels: {
                                    formatter: function() {
                                        return categoryLinks[this.value] ;
                                    },
                                    rotation: 0,
                                    reserveSpace: false,
                                    y: 5,
                                    x: 0,
                                    style: {
                                        align: 'right',
                                        verticalAlign: 'middle',
                                        fontSize: '10pt',
                                        fontWeight: 'bold'
                                    }
                                },
                                offset: 39
                            },
                            yAxis: {
                                min: 0,
                                max: 81
                            },

                            plotOptions: {
                                series: {
                                    pointStart: 0,
                                    pointInterval: 36,
                                    lineWidth: 10,
                                    fillOpacity: 0.1,
                                    dataLabels: {
                                        enabled: true,
                                        verticalAlign:'middle',
                                        align:'center',
                                        inside: false
                                    }
                                },
                                column: {
                                    pointPadding: 0,
                                    groupPadding: 0
                                }
                            },

                            series: [{
                                type: 'column',
                                name: 'Value',
                                data: [<?php echo $data2 ?>],
                                pointPlacement: 'between'
                                ,showInLegend : false
                            }
                            ]
                        });
                    </script>

                    <span class="badge badge-info badge-pill" style="width: 40px;height: 40px;line-height: 40px;"></span><span class="badge badge-info badge-pill" style="width: 40px;height: 40px;line-height: 40px;background-color: rgb(8, 191, 71)"><?php echo $D ?></span>
                    <span style="font-size:20px;font-weight: bold;">D</span>
                </div>
            </div>
            <!--section 1-->
            <div class="row rowcenter" >
                <div class="col-md-12 mb-2">
                    <div>
                        <div class="card-header "  style="padding:5px;border-bottom: none !important;">
                            <!--                            <h5 class="text-center text-danger"><i class="fa fa-users"></i>  با واگویه های فعلی شما در حال حاضر:</h5>-->
                            <h5  class="text-center text-dark" style="line-height: 20px;padding-right: 5px;margin-bottom: 25px;" >
                                دوست داشتن حسی
                            </h5>
                        </div>
                    </div>
                </div>
                <div class="col-md-3 mb-1 ">
                    <div class="card"  >
                        <!-- <center><img style="width: 32px;height: 32px;" src="<?php echo RELA_DIR . 'templates/' . CURRENT_SKIN; ?>/assets/img/love.png" class="card-img-top" alt="..."></center>-->
                        <div class="card-header">
                            <i class="fa fa-heart-o fa-2x"></i>

                        </div>
                        <div class="card-body">
                            <h5 class="card-title"><i class="fa fa-edit"></i>
                                علاقه
                            </h5>
                            <p class="card-text">
                                نیروی پیش‌برنده مثبت
                            </p>
                            <div class="progress-bar" data-percent="<?php echo $percentArray['A'] ; ?>" data-duration="1000" data-color="#ccc,#67eb34"></div>

                        </div>
                        <div class="card-footer">
                            <a href="#"  class="btn btn-success btn-block openBtn" data-id="0" data-toggle="modal" data-target="#myModal"><i class="fa fa-question-circle"></i> مشاهده تحلیل </a>

                        </div>
                    </div>
                </div>
                <!--section2-->
                <div class="col-md-3 mb-1 ">
                    <div class="card" >
                        <div class="card-header">
                            <i class="far fa-angry fa-2x"></i>
                        </div>
                        <div class="card-body">
                            <h5 class="card-title"><i class="fa fa-edit"></i>
                                خشم
                            </h5>
                            <p class="card-text">
                                نیروی بازدارنده فعال
                            </p>
                            <div class="progress-bar" data-percent="<?php echo $percentArray['B'] ; ?>" data-duration="1000" data-color="#ccc,red"></div>
                        </div>
                        <div class="card-footer">
                            <a href="#" class="btn btn-success btn-block openBtn" data-id="1" data-toggle="modal" data-target="#myModal"><i class="fa fa-question-circle"></i> مشاهده تحلیل </a>

                        </div>
                    </div>
                </div>
                <!--section 3-->
                <div class="col-md-3 mb-1">
                    <div class="card" >
                        <div class="card-header">
                            <i class="far fa-frown fa-2x"></i>

                        </div>
                        <div class="card-body">
                            <h5 class="card-title"><i class="fa fa-edit"></i>
                                غم
                            </h5>
                            <p class="card-text" data-toggle="modal" data-target="#myModal">
                                نیروی بازدارنده پنهان
                            </p>
                            <div class="progress-bar" data-percent="<?php echo $percentArray['C'] ; ?>" data-duration="1000" data-color="#ccc,yellow"></div>
                        </div>
                        <div class="card-footer">
                            <a href="#" class="btn btn-success btn-block openBtn" data-id="2" data-toggle="modal" data-target="#myModal"><i class="fa fa-question-circle"></i> مشاهده تحلیل </a>
                        </div>
                    </div>
                </div>
                <!--section 4-->
                <div class="col-md-3 mb-1">
                    <div class="card" >
                        <div class="card-header">
                            <i class="far fa-meh fa-2x"></i>

                        </div>
                        <div class="card-body">
                            <h5 class="card-title"><i class="fa fa-edit"></i>
                                استرس
                            </h5>
                            <p class="card-text">
                                نیروی پیش برنده منفی
                            </p>
                            <div class="progress-bar" data-percent="<?php echo $percentArray['D'] ; ?>" data-duration="1000" data-color="#ccc,blue"></div>
                        </div>
                        <div class="card-footer">
                            <a href="#" class="btn btn-success btn-block openBtn" data-id="3" data-toggle="modal" data-target="#myModal"><i class="fa fa-question-circle"></i> مشاهده تحلیل </a>

                        </div>
                    </div>
                </div>
            </div>
            <!--section 2-->
            <div class="row rowcenter">
                <div class="col-md-12 mb-2">
                    <div>
                        <div class="card-header "  style="padding:5px;border-bottom: none !important;">
                            <!--                            <h5 class="text-center text-danger"><i class="fa fa-users"></i>  با واگویه های فعلی شما در حال حاضر:</h5>-->
                            <h5  class="text-center text-dark" style="line-height: 20px;padding-right: 5px;margin-bottom: 25px;" >
                                نیاز حسی
                            </h5>
                        </div>
                    </div>
                </div>
                <div class="col-md-4 mb-1 ">
                    <div class="card"  >
                        <!-- <center><img style="width: 32px;height: 32px;" src="<?php echo RELA_DIR . 'templates/' . CURRENT_SKIN; ?>/assets/img/love.png" class="card-img-top" alt="..."></center>-->
                        <div class="card-header">
                            <h5 class="card-title"><i class="fa fa-edit"></i>
                                رضایت
                            </h5>
                        </div>
                        <div class="card-body">

                            <p class="card-text">
                                نیاز حسی به حرکت کردن
                            </p>
                            <div class="progress-bar" data-percent="<?php echo $percentArray['A-B'] ; ?>" data-duration="1000" data-color="#ccc,#67eb34"></div>

                        </div>
                        <div class="card-footer">
                            <a href="#" class="btn btn-success btn-block openBtn" data-id="4" data-toggle="modal" data-target="#myModal_s2"><i class="fa fa-question-circle"></i> مشاهده تحلیل </a>

                        </div>
                    </div>
                </div>
                <!--section2-->
                <div class="col-md-4 mb-1 ">
                    <div class="card" >
                        <div class="card-header">
                            <h5 class="card-title"><i class="fa fa-edit"></i>
                                نارضایتی
                            </h5>
                        </div>
                        <div class="card-body">

                            <p class="card-text">
                                نیاز حسی به حرکت نکردن
                            </p>
                            <div class="progress-bar" data-percent="<?php echo $percentArray['C-D'] ; ?>" data-duration="1000" data-color="#ccc,red"></div>
                        </div>
                        <div class="card-footer">
                            <a href="#" class="btn btn-success btn-block openBtn" data-id="5" data-toggle="modal" data-target="#myModal_s2"><i class="fa fa-question-circle"></i> مشاهده تحلیل </a>

                        </div>
                    </div>
                </div>
                <!--section 3-->
                <div class="col-md-4 mb-1">
                    <div class="card" >
                        <div class="card-header">
                            <h5 class="card-title"><i class="fa fa-edit"></i>
                                مقایسه نیازها
                            </h5>
                        </div>
                        <div class="card-body">

                            <!--                            <p class="card-text" style="line-height: 139px; height: 100%" data-toggle="modal" data-target="#myModal">-->
                            <p class="card-text">
                                نتیجه گیری نیازها
                            </p>
                            <!--                            <div class="progress-bar" data-percent="--><?php //echo $percentArray['C'] ; ?><!--" data-duration="1000" data-color="#ccc,yellow"></div>-->
                            <div><img  src="<?php   echo RELA_DIR . 'templates/' . CURRENT_SKIN; ?>/assets/img/compare.jpeg" alt="..." style="widht:90px;height:90px;border-radius: 50px;border:3px solid #ccc;"></div>

                        </div>
                        <div class="card-footer">
                            <a href="#" class="btn btn-success btn-block openBtn" data-id="6" data-toggle="modal" data-target="#myModal_s2_3"><i class="fa fa-question-circle"></i> مشاهده تحلیل </a>
                        </div>
                    </div>
                </div>
            </div>
            <!--section 3-->
            <div class="row rowrow" >
                <div class="col-md-12 mb-2">
                    <div>
                        <div class="card-header "  style="padding:5px;border-bottom: none !important;">
                            <!--                            <h5 class="text-center text-danger"><i class="fa fa-users"></i>  با واگویه های فعلی شما در حال حاضر:</h5>-->
                            <h5  class="text-center text-dark" style="line-height: 20px;padding-right: 5px;margin-bottom: 25px;" >
                                توانایی حسی
                            </h5>
                        </div>
                    </div>
                </div>
                <div class="col-md-6 mb-1">
                    <div class="card"  >
                        <!-- <center><img style="width: 32px;height: 32px;" src="<?php   echo RELA_DIR . 'templates/' . CURRENT_SKIN; ?>/assets/img/love.png" class="card-img-top" alt="..."></center>-->
                        <div class="card-header">
                            <h5 class="card-title"><i class="fa fa-edit"></i>
                                توانایی حسی
                            </h5>
                        </div>
                        <div class="card-body">

                            <p class="card-text" style="font-size: 14.8px;">
                                اثرگذاری و اعتماد به نفس
                            </p>
                            <!--                            <div class="progress-bar" data-percent="--><?php //echo $percentArray['A'] ; ?><!--" data-duration="1000" data-color="#ccc,#67eb34"></div>-->

                        </div>
                        <div class="card-footer">
                            <a href="#" class="btn btn-secondary btn-block openBtn disabled" data-id="2" data-toggle="modal" data-target="#myModal"><i class="fa fa-question-circle"></i> مشاهده تحلیل </a>

                        </div>
                    </div>
                </div>
                <!--section2-->
                <div class="col-md-6 mb-1 ">
                    <div class="card" >
                        <div class="card-header">
                            <h5 class="card-title"><i class="fa fa-edit"></i>
                                پشتکار
                            </h5>
                        </div>
                        <div class="card-body">

                            <p class="card-text">
                                نیروی درونی پایداری
                            </p>
                            <!--                            <div class="progress-bar" data-percent="--><?php //echo $percentArray['B'] ; ?><!--" data-duration="1000" data-color="#ccc,red"></div>-->
                        </div>
                        <div class="card-footer">
                            <a href="#" class="btn btn-secondary btn-block openBtn disabled" data-id="2" data-toggle="modal" data-target="#myModal"><i class="fa fa-question-circle"></i> مشاهده تحلیل </a>

                        </div>
                    </div>
                </div>

            </div>
            <!--section 4-->
            <div class="row rowrow">
                <div class="col-md-12 mb-2">
                    <div>
                        <div class="card-header "  style="padding:5px;border-bottom: none !important;">
                            <!--                            <h5 class="text-center text-danger"><i class="fa fa-users"></i>  با واگویه های فعلی شما در حال حاضر:</h5>-->
                            <h5  class="text-center text-dark" style="line-height: 20px;padding-right: 5px;margin-bottom: 25px;" >
                                سود حسی
                            </h5>
                        </div>
                    </div>
                </div>
                <div class="col-md-6 mb-1">
                    <div class="card"  >
                        <!-- <center><img style="width: 32px;height: 32px;" src="<?php   echo RELA_DIR . 'templates/' . CURRENT_SKIN; ?>/assets/img/love.png" class="card-img-top" alt="..."></center>-->
                        <div class="card-header">
                            <h5 class="card-title"><i class="fa fa-edit"></i>
                                عزت نفس
                            </h5>
                        </div>
                        <div class="card-body">

                            <p class="card-text">
                                حس ارزشمند درونی
                            </p>
                            <!--                            <div class="progress-bar" data-percent="--><?php //echo $percentArray['A'] ; ?><!--" data-duration="1000" data-color="#ccc,#67eb34"></div>-->

                        </div>
                        <div class="card-footer">
                            <a href="#" class="btn btn-secondary btn-block openBtn disabled" data-id="2" data-toggle="modal" data-target="#myModal"><i class="fa fa-question-circle"></i> مشاهده تحلیل </a>

                        </div>
                    </div>
                </div>
                <!--section2-->
                <div class="col-md-6 mb-1 ">
                    <div class="card" >
                        <div class="card-header">
                            <h5 class="card-title"><i class="fa fa-edit"></i>
                                سود حسی
                            </h5>
                        </div>
                        <div class="card-body">

                            <p class="card-text">
                                میزان فایده و ضرر
                            </p>
                            <!--                            <div class="progress-bar" data-percent="--><?php //echo $percentArray['B'] ; ?><!--" data-duration="1000" data-color="#ccc,red"></div>-->
                        </div>
                        <div class="card-footer">
                            <a href="#" class="btn btn-secondary btn-block openBtn disabled" data-id="2" data-toggle="modal" data-target="#myModal"><i class="fa fa-question-circle"></i> مشاهده تحلیل </a>

                        </div>
                    </div>
                </div>

            </div>

            <!--section 4-->

        </div>
        <!-- /Form_container -->
</main>
<!-- Modal 4 Section -->
<div id="myModal" class="modal fade" role="dialog">
    <div class="modal-dialog modal-xl modal-lg ">
        <div class="modal-content">
            <!-- Modal Header -->
            <div class="modal-header text-center">
                <h6 class="modal-title">
                    با واگویه‌های فعلی شما در حال حاضر:
                </h6>
                <button type="button" class="close" data-dismiss="modal">&times;</button>
            </div>
            <!-- Modal Header -->
            <div class="modal-header bg-primary">
                <h6 class="modal-title" >
                    تحلیل ابتدایی گراف
                </h6>
            </div>
            <!-- Modal body -->
            <div class="modal-body text-justify">
                <div class="modal-header">
                    <div id="modal-body-content-1" class="panel-body"></div>
                </div>
            </div>
            <!-- Modal Header -->
            <div class="modal-header bg-success">
                <h6 class="modal-title">
                    نتیجه فعلی گراف برای شما
                </h6>
            </div>
            <!-- Modal body -->
            <div class="modal-body text-justify">
                <div id="modal-body-content-2" class="panel-body"></div>
            </div>
            <!-- Modal Header -->
            <div class="modal-header bg-info">
                <h6 class="modal-title">
                    چرا اینگونه است؟
                </h6>
            </div>
            <!-- Modal body -->
            <div class="modal-body text-justify">
                <div id="modal-body-content-3" class="panel-body"></div>
            </div>
            <!-- Modal Header -->
            <div class="modal-header bg-warning">
                <h6 class="modal-title">
                    پاسخ ما
                </h6>
            </div>
            <!-- Modal body -->
            <div class="modal-body text-justify">
                <div id="modal-body-content-4" class="panel-body"></div>
            </div>

            <!-- Modal footer -->
            <div class="modal-footer">
                <button type="button" class="btn btn-secondary" data-dismiss="modal">بستن</button>
            </div>
        </div>

    </div>
</div>
<script>
    $(".progress-bar").loading();


</script>
<!-- Modal 2_1_2 Section -->
<div id="myModal_s2" class="modal fade" role="dialog">
    <div class="modal-dialog modal-xl modal-lg ">
        <div class="modal-content">
            <!-- Modal Header -->
            <div class="modal-header text-center">
                <h6 class="modal-title">
                    با واگویه‌های فعلی شما در حال حاضر:
                </h6>
                <button type="button" class="close" data-dismiss="modal">&times;</button>
            </div>
            <!-- Modal Header -->
            <div class="modal-header bg-primary">
                <h6 class="modal-title" id="modal-title-s2-content-1">

                </h6>
            </div>
            <!-- Modal body -->
            <div class="modal-body text-justify">
                <div class="modal-header">
                    <div id="modal-body-s2-content-1" class="panel-body"></div>
                </div>
            </div>
            <!-- Modal Header -->
            <div class="modal-header bg-success">
                <h6 class="modal-title" id="modal-title-s2-content-2">

                </h6>
            </div
                    <!-- Modal body -->
            <div class="modal-body text-justify">
                <div id="modal-body-s2-content-2" class="panel-body"></div>
            </div>

            <!-- Modal footer -->
            <div class="modal-footer">
                <button type="button" class="btn btn-secondary" data-dismiss="modal">بستن</button>
            </div>
        </div>

    </div>
</div><!-- Modal 2_1_3 Section -->
<div id="myModal_s2_3" class="modal fade" role="dialog">
    <div class="modal-dialog modal-xl modal-lg ">
        <div class="modal-content">
            <!-- Modal Header -->
            <div class="modal-header text-center">
                <h6 class="modal-title">
                    با واگویه‌های فعلی شما در حال حاضر:
                </h6>
                <button type="button" class="close" data-dismiss="modal">&times;</button>
            </div>
            <!-- Modal Header -->
            <div class="modal-header bg-primary">
                <h6 class="modal-title" id="modal-title-s2_3-content-1">

                </h6>
            </div>
            <!-- Modal body -->
            <div class="modal-body text-justify">
                <div id="modal-body-s2_3-content-1" class="panel-body"></div>
            </div>
            <!-- Modal footer -->
            <div class="modal-footer">
                <button type="button" class="btn btn-secondary" data-dismiss="modal">بستن</button>
            </div>
        </div>

    </div>
</div>




<?php
$scriptModalStr = "
    $('.openBtn').on('click',function(){
        //alert($(this).data('id'));
        var tmp = $(this).data('id');
        if (tmp == 0 || tmp == 1 || tmp == 2 || tmp == 3  ){
            $('#modal-body-content-1').html(analyze[tmp][0]);
            $('#modal-body-content-2').html(analyze[tmp][1]);
            $('#modal-body-content-3').html(analyze[tmp][2]);
            $('#modal-body-content-4').html(analyze[tmp][3]);
            $('#myModal').modal({show:true});
            //$('.modal-body').load('".RELA_DIR."templates/template_fa/AnalyzePages/content'+$(this).data('id')+'.html',function(){
                //$('#myModal').modal({show:true});
            //});
        } else if (tmp == 4 || tmp == 5 ) {
            $('#modal-title-s2-content-1').html(analyze[tmp][0]);
            $('#modal-body-s2-content-1').html(analyze[tmp][1]);
            $('#modal-title-s2-content-2').html(analyze[tmp][2]);
            $('#modal-body-s2-content-2').html(analyze[tmp][3]);
            $('#myModal_s2').modal({show:true});
        } else if (tmp == 6 ) {
            $('#modal-title-s2_3-content-1').html(analyze[tmp][0]);
            $('#modal-body-s2_3-content-1').html(analyze[tmp][1]);
            $('#myModal_s2_3').modal({show:true});
        }
    });
" ;
echo '<script>'.$arrayAnalyze.$scriptModalStr.'</script>';
?>
