<style>
    #middle-wizard{
        padding: 0 !important;
    }
    #left_form {
        background-color: #92278f !important;

        min-height: 460px !important;
        color: #fff;
        text-align: center;
        padding: 70px 50px 30px 50px !important;
        box-sizing: border-box;
        position: relative;
    }

</style>
<main>
    <div id="form_container">
        <div class="row">
            <div class="col-lg-4">
                <div id="left_form" style="height: 100%">

                    <p style="padding-top: 15px;font-weight: 700">
                        گراف حسی
                    </p>
                    <p style="padding-bottom: 20px;">
                        تحلیل آنچه که می خواهیم و نمی توانیم
                    </p>
                    <hr>
                    <p  style="padding-top: 20px;font-weight: 700;font-size: 11pt">
                        ماموریت گراف های حسی از اینجا آغاز می شود:
                    </p>
                    <p>
                        انجام فعل زندگی با هماهنگی و بدون آزار
                    </p>
<hr>
                    <p style="padding-top: 20px;font-weight: 700;font-size: 11pt" >گراف حسی چیست؟</p>
                    <p>گراف حسی مدلی بسیار قدرتمند از توانمندی ها و ضعف های روان/تنی و ویژگی های حسی و عاطفی ما ارایه می دهد. آنچه که می دانم و نمی دانم، آنچه که دوست دارم و دوست ندارم و آنچه که می توانم و نمی توانم، شش اتفاق عقلی و حسی است که با همدیگر روان انسانی را شکل می دهند.</p>
                    <hr>
                    <p style="font-weight: 700;font-size: 11pt" >مدل گراف حسی چه چیز به ما نشان می دهد؟</p>
                    <p>با استفاده از مدل گراف حسی می توانید ساختار دقیق ذهن خود را کشف و تحلیل کنید؛ مثلا:</p>
                    <p>تحلیل گراف حسی به طور دقیق به ما نشان خواهد داد که هر فعالیت و رابطه ی انسانی که در آن هستیم چه میزانی از شادی، غم، و اضطراب تولید می کند.</p>
                    <p>تحلیل گراف حسی نشان می دهد برای چه اهداف، کارها و رابطه هایی از ظرفیت حسی و ذهنی مناسب برخوردار هستیم.</p>
                    <p>تحلیل گراف حسی نشان می دهد برای چه کارهایی در حال حاضر مناسب نیستیم و در هر کار و رابطه ای تا چه میزان توان و احتمال موفقیت داریم.</p>
                    <p>در نهایت به ما نشان خواهد داد چگونه می توانیم ظرفیت حسی و روان/تنی خود را برای اهداف، فعالیت ها و رابطه ها که می خواهیم در آن ها بمانیم، هماهنگ و توانمند کنیم. </p>

                </div>
            </div>
            <div class="col-lg-8">

                <div id="wizard_container">
                    <div id="top-wizard">
                        <div id="progressbar"></div>
                    </div>
                    <!-- /top-wizard -->
                    <form name="example-1" id="wrapped" method="POST">
                        <input id="website" name="website" type="text" value="">
                        <!-- Leave for security protection, read docs for details -->
                        <div id="middle-wizard">
                            <!--section 1-->
                            <div class="step">

                                <ul class="list-unstyled">
                                    <li class="media">
                                        <div class="media-body text-right text-justify" style="padding-left: 20px;">
                                            <h4 class="mt-0 mb-1" style="padding-bottom: 20px"><i class="fa fa-pencil-square-o fa-2x"></i>
                                            فلسفه گراف
                                            </h4>
                                            <p>گراف حسی ، به شما نمی گوید که چه کسی هستید، به شما می گوید که چه رابطه ای با هر چیزی دارید. بنابراین آن در باره شخصیت شما نیست بلکه درباره رابطه شما با جهان پیرامون و انسان های دیگر و نحوه اثر گذاری و اثر پذیری شما از آنها است. </p>
                                            <p>گراف حسی شما را به عنوان یک موجود مستقل از جهان شناسایی و تحلیل نمی کند آن شما را به عنوان جزئی غیر قابل انفکاک از کلیت جهان می شناسد بنابراین بجای مدل کردن شما، رابطه ها را مدل می کند و‌به شما نشان می دهد در یک شبکه چند وجهی از ارتباطات چگونه قادر به تصمیم گرفتن می شوید. </p>
                                            <p>تحلیل گراف حسی نشان می دهد تصمیم های ما از چه درجه ای از هماهنگی و قدرت برای نیل به موفقیت برخوردار هستند و دقیقا چه چیزهایی نیاز به چه تغییراتی دارند. </p>
                                            <p>اگر شرط امکان ارزش صدق و کذب را گرامر منطقی زبان بدانیم ، دانش گراف حسی و ارزش های ده گانه مطرح در آن بیش از هر چیز، گرامر حسی زبان هستند. </p>
                                            <p>در آزمون های تحلیل روانی از داوطلب خواسته می شود که برای پاسخ به هر پرسش یک موضع خاص را اختیار کند. به همین دلیل داوطلب ناچار می شود در ذهن خود به یکی از وضعیت های حسی خود ارجاع دهد و آن را مبنا پاسخ دهی قرار دهد. درحالی که همین شخص در مکان ها و زمان های متفاوت وضعیت های حسی متفاوت دیگری را تجربه می کند. </p>
                                            <p>در واقع  این آزمون ها از روی سوالات موردی و جرئی با ارائه  نتایج کلی درباره شخصیت و ویژگی های روانی شخص اقدام می کنند. اگر چه برخی از آنها به این واقعیت اعتراف می کنند که نتایج اعلام شده مربوط به شرایط خاصی است که در آن داوطلب به پرسش ها پاسخ داده است و نتایج در آزمون مجدد می تواند متفاوت باشد؛ اما از نظر منطقی اخذ احکام کلی از روی نمونه های جزئی، اصولا معتبر نیست. </p>
                                            <p>این مشکل در ساختار تحلیل و مدل سازی گراف وجود ندارد؛ آزمون های گراف، آزمون های کلی هستند. سوالات به گونه هستند که رابطه فرد با موضوع در زمان ها و شرایط مختلف مورد توجه قرار می دهد و اجازه می دهد شخص داوطلب افکار و احساسات گاها متناقض و متضاد خود را درباره موضوع اظهار و ‌ثبت کند و تحلیل گراف همه آنها را لحاظ می کند. </p>
                                            <p>اگر داوطلب پاسخ ها را به درستی داده باشد و اقدام به گراف درمانی نکرده باشد، به هر تعداد و در شرایط مختلف آزمون گراف را تکرار کند تفاوت معنی داری در نتایج مشاهده نخواهد کرد. </p>
                                            <p>البته دلیل آن بسیار واضح است؛ گراف درباره احساس و افکار شخص در لحظه آزمون یا هیچ لحظه خاص دیگری پرسش نمی کند بلکه در باره همه احساسات و افکار او در طول تاریخ رابطه اش با موضوع از همه جهاتی که شخص در ذهن می تواند داشته باشد پرسش می کند. یعنی در آزمون گراف مقدمات تحلیل برخلاف آزمون های رقیب کلی هستند.</p>

                                        </div>
                                    </li>
                                    <li class="media">
                                        <div class="media-body text-right text-justify" style="padding-left: 20px;">
                                            <h4 class="mt-0 mb-1" style="padding-bottom: 20px"><i class="fa fa-pencil-square-o fa-2x"></i>
                                  گراف حسی چیست؟
                                            </h4>
                                            <p>
                                                گاهی می‌گوییم: "هوا گرمه"
                                            </p>

                                            <p>خب! معمولاً دمای ۱۸ تا ۲۲ درجه را برای راحتی انسان مناسب می‌دانند. بنابراین، وقتی می‌شنویم "هوا گرمه" یعنی از حد آسایش انسان بالاتره.
                                                سؤالی که در ادامه پیش میاد، اینه که حالا که هوا گرمه، "چقدر" گرمه؟</p>

                                            <p>۳۰ درجه؟ ۴۰ یا ۵۰؟</p>

                                            <p>یعنی "حس" گرم بودن هوا، با درجه‌بندی دماسنج مشخص می‌شود. و ما بر اساس این گزارش دماسنج، تصمیم می‌گیریم که کولر را روی چه درجه‌ای تنظیم کنیم.
                                            </p>
                                            <p>
                                                گراف‌های حسی، مثل دماسنج هستند؛ ابزاری برای اندازه‌گیری حس‌های آدمی.
                                            </p>
                                            <p>
                                                حس‌هایمان را اندازه می‌گیریم تا بدانیم برای یک تصمیم جدید، شدت لذت یا درد یا امنیت در ما چقدر است؟ شبیه کاری که دماسنج برای ما می‌کند تا درجه کولر را بر اساس آن تنظیم کنیم، گراف حسی هم، شدت احساسات ما را درجه‌بندی می‌کند تا:
                                            </p>
                                            <p> بدانیم با وجود اینه بارها با خود عهد بسته‌ایم، نتوانسته‌ایم سحرخیز باشیم! (تصمیم‌گیری)
                                            </p>
                                            <p>
                                                گراف حسی، احساسات ما را درجه‌بندی می‌کند تا بدانیم چرا باوجود عاقلانه بودن ترک سیگار، تن به این کار نمی‌دهیم. (اصلاح عادت‌ها)
                                            </p>
                                            <p>
                                                گراف حسی، احساسات ما را درجه‌بندی می‌کند تا بدانیم چگونه از بین سفر به کوهستان یا کویر، یکی را انتخاب می‌کنیم. (انتخاب‌های زندگی)
                                            </p>
                                            <p>
                                                گراف حسی، احساسات ما را درجه‌بندی می‌کند تا بدانیم چرا مهمانی گرفتن همسایه، من را خوشحال یا عصبانی می‌کند! (قضاوت‌ها)
                                            <p>
                                                گراف حسی، احساسات ما را درجه‌بندی می‌کند تا بدانیم بحران در روابط خانوادگی و زناشویی، واقعا از کجاها ناشی می‌شود (روابط انسانی)
                                            </p>
                                            <p>
                                                گراف حسی، احساسات ما را درجه‌بندی می‌کند و مسیر اصلاح رابطه‌ها و تصمیم‌گیری‌ها را برایمان هموارتر می‌کند.
                                            </p>

                                        </div>
                                    </li>
                                </ul>
                            </div>

                        </div>
                        <!-- /bottom-wizard -->
                    </form>
                </div>
                <!-- /Wizard container -->
            </div>
        </div><!-- /Row -->
    </div><!-- /Form_container -->
</main>
